Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/saml/entra.po
Languages: tr_tr

source: Add a new SAML Application on GLPI
tr_tr: GLPI üzerine yeni bir SAML uygulaması ekleyin

source: First of all, you need to add a SAML application on GLPI because we need to report some information on GLPI <-> Entra/Google.
tr_tr: Öncelikle GLPI üzerine bir SAML uygulaması eklemeniz gerekiyor çünkü GLPI <-> Entra/Google üzerinde bazı bilgileri bildirmemiz gerekiyor.

source: In **Setup** > **SAML SSO Applications**, click on **+ Add**
tr_tr: **Kurulum** > **SAML SSO uygulamaları** bölümünden **+ Ekle** üzerine tıklayın

source: Give a **name** to your application
tr_tr: Uygulamanıza bir **ad** verin

source: Click on **is active**
tr_tr: **Etkin** üzerine tıklayın

source: Click on **Save**
tr_tr: **Kaydet** üzerine tıklayın

source: Add GLPI app
tr_tr: GLPI uygulaması ekleyin

source: For Entra, in **Transit** tab, select :
tr_tr: Entra için **Geçiş** sekmesinden şunu seçin :

source: Compress requests
tr_tr: İsteği sıkıştır

source: Compress responses
tr_tr: Yanıtları sıkıştır

source: Setup the transit
tr_tr: Geçişi kur

source: Add an app in Entra
tr_tr: Uygulamayı Entra üzerine ekleyin

source: Connect to your `Entra portal <https://portal.azure.com/#home>`_
tr_tr: `Entra portal <https://entra.microsoft.com/#home>`_ sayfasını açın

source: Click on **Entreprise Application**
tr_tr: **Kurumsal uygulama** üzerine tıklayın

source: **And + New application**
tr_tr: **Ve + Yeni uygulama** üzerine tıklayın

source: In the search bar, enter **saml toolkit**
tr_tr: Arama alanın **saml toolkit** yazın

source: Click on **Microsoft Entra SAML Toolkit**
tr_tr: **Microsoft Entra SAML Toolkit** üzerine tıklayın

source: create app entra
tr_tr: Entra uygulaması oluşturun

source: Optionnal : You can rename this app
tr_tr: İsteğe bağlı: Bu uygulamayı yeniden adlandırabilirsiniz

source: Click on **Create**
tr_tr: **Oluştur** üzerine tıklayın

source: When the application is created :
tr_tr: Uygulama oluşturulduğunda:

source: Go to **Single sign-on**
tr_tr: **Tek oturum açma** bölümüne gidin

source: Click on SAML
tr_tr: SAML üzerine tıklayın

source: create SAM app entra
tr_tr: SAM Entra uygulaması oluşturun

source: Setup the app
tr_tr: Uygulamayı kurun

source: In the 1st insert, click on **Edit**
tr_tr: Birinci alanda **Düzenle** üzerine tıklayın

source: Copy the values as follows
tr_tr: Değerleri şu şekilde kopyalayın

source: Report the values in entra
tr_tr: Entra üzerindeki değerleri bildirin

source: See the values in GLPI
tr_tr: GLPI üzerindeki değerlere bakın

source: Setup the Service Provider
tr_tr: Hizmet sağlayıcıyı yapılandırın

source: In **SP certificate** and **SP Private Key**, copy/paste your certificate in place of those already present. There are no strict requirements for these certificates, other than that they are valid X509 certificates.
tr_tr: **Sağlayıcı sertifikası** ve **Sağlayıcı kişisel anahtarı** alanlarında, var olanların yerine sertifikanızı kopyalayıp yapıştırın. Bu sertifikalar için geçerli X509 sertifikaları olmaları dışında katı gereklilikler yoktur.

source: setup the values
tr_tr: Değerleri ayarlayın

source: Setup the Identity Provider
tr_tr: Kimlik hizmeti sağlayıcısını kurun

source: In the third insert of Entra app, click on **Download** from **Certificate (Base64)**
tr_tr: Entra uygulamasının üçüncü alanında **Sertifika (Base64)** bölümünde **İndir** üzerine tıklayın

source: Download certificate
tr_tr: Sertifikayı indirin

source: **Open** this certificate with notepad ++ (or other tool which can read this type of certificate)
tr_tr: Bu sertifikayı Notepad ++ (ya da bu tür sertifikaları okuyabilen başka bir araç) ile **Açın**

source: **Copy** the content of the certificate in GLPI with the tags
tr_tr: GLPI üzerindeki sertifikanın içeriğini kod imleri ile **kopyalayın**

source: **Paste** the certificate in **Identity provider** > **X509 certificate**
tr_tr: Sertifikayı **Kimlik sağlayıcısı** > **X509 sertifikası** alanına **yapıştırın**

source: Then fill in the fields as follows withe the informations in the fourth insert :
tr_tr: Ardından dördüncü alandaki bilgileri aşağıdaki gibi doldurun:

source: Paste certificate and setup the values
tr_tr: Sertifikayı yapıştırın ve değerleri ayarlayın

source: It is advisable to use **none** as the **REQ AUTHN CONTEXT**
tr_tr: **REQ AUTHN CONTEXT** olarak **none** kullanılması önerilir

source: Security
tr_tr: Güvenlik

source: For a production instance, you must activate the **Strict** option.
tr_tr: Bir üretim kopyası için **Strict** seçeneğini etkinleştirmeniz gerekir.

source: We advise you to activate **JIT user creation**. This will allow the rules you create from JIT Rules to be applied.
tr_tr: **JIT kullanıcı oluşturma** özelliğini etkinleştirmenizi öneririz. Bu seçenek, JIT Kuralları ile oluşturduğunuz kuralların uygulanmasını sağlar.

source: options for security
tr_tr: Güvenlik ayarları

source: For the plugin to authenticate a user, the field must contain a **valid UPN** formatted **as an email**. This behaviour can lead to duplicate entries in GLPI when users leave Ldap. This is an important detail because some users who leave Active directory in certain scenarios still use the usersam account name (old netbui names) as the UPN in entra. As a result, the nameId field in the samlResponse will not be populated with a valid email address. The username field is used because the email field is not guaranteed to be unique in GLPI and it is essential that a unique identifier is used to allow authorisation of a specific GLPI user.
tr_tr: Eklentinin bir kullanıcıyı doğrulaması için, alan **e-posta** olarak biçimlendirilmiş **geçerli bir UPN** içermelidir. Bu davranış, kullanıcılar LDAP üzerinden ayrıldığında GLPI üzerinde yinelenen kayıtlara yol açabilir. Bu önemli bir ayrıntıdır çünkü belirli senaryolarda Active Directory üzerinden ayrılan bazı kullanıcılar Entra üzerinde UPN olarak hala usersam hesap adını (eski netbui adları) kullanır. Sonuç olarak, samlResponse paketindeki nameId alanı geçerli bir e-posta adresiyle doldurulmaz. Kullanıcı adı alanı kullanılır çünkü e-posta alanının GLPI üzerinde benzersiz olması garanti edilmez ve belirli bir GLPI kullanıcısının yetkilendirilmesine izin vermek için benzersiz bir kimliğin kullanılması önemlidir.

source: Add users allowed to use SAML
tr_tr: SAML kullanma izni olan kullanıcıları ekleyin

source: SAML needs users/groups to be added so that they are authorised to use authentication.
tr_tr: SAML kimlik doğrulamasını kullanabilmeleri için kullanıcı/grup eklenmesi gerekir.

source: Click on **users and groups** tab,
tr_tr: **Kullanıcılar ve gruplar** sekmesine tıklayın,

source: Click on **+ Add user/group**
tr_tr: **+ Kullanıcı/grup ekle** üzerine tıklayın

source: Select all the users and groups required
tr_tr: Gerekli tüm kullanıcıları ve grupları seçin

source: Click on **Assign**
tr_tr: **Ata** üzerine tıklayın

source: add user allowed
tr_tr: İzin verilecek kullanıcıyı ekleyin

source: Mapping
tr_tr: Eşleştirme

source: If you wish to add additional information to your profile, you can use Attributes & Claims. Your profile will be populated with the information entered in Entra.
tr_tr: Profilinize ek bilgi eklemek isterseniz, Öznitelikleri ve İstekleri kullanabilirsiniz. Profiliniz Entra üzerine girilen bilgilerle doldurulur.

source: In **Single sign on**, click on **Edit**
tr_tr: **Tek oturum açma** bölümünde **Düzenle** üzerine tıklayın

source: Copy the URL of the one of the other claim
tr_tr: Diğer isteklerden birinin adresini kopyalayın

source: Copy the URL schema
tr_tr: Adres şemasını kopyalayın

source: Click on **+ Add new claim**
tr_tr: **+ Yeni istek ekle** üzerine tıklayın

source: Select a name
tr_tr: Bir ad seçin

source: Paste the URL you've just copied ine **Namespace**
tr_tr: Az önce kopyaladığınız adresi **Ad alanı** içine yapıştırın

source: Selct **attribute**
tr_tr: **Öznitelik** seçin

source: Search the value that you want in the **Source attribute**
tr_tr: **Kaynak özniteliği** olarak istediğiniz değeri arayın

source: Save your modification
tr_tr: Değişikliklerinizi kaydedin

source: Repeat this step for all the desired values
tr_tr: Gerekli tüm değerler için bu adımı yineleyin

source: add claims in Entra
tr_tr: Entra içinde istekleri ekleyin

source: see claims in Entra
tr_tr: Entra içindeki istekleri görüntüleyin

source: Rules for assigning authorisations
tr_tr: Yetki atama kuralları

source: It will be necessary to establish rules for assigning authorisations to your users (to give them a profile, for example).
tr_tr: Kullanıcılarınıza yetki atamak için kurallar oluşturmanız (örneğin, onlara bir profil vermeniz) gerekir.

source: To do this, go to **Administration** > **Rules** > **GLPI SAML - Saml import rules** or by the button **JIT Rules** directly in the plugin
tr_tr: Bunu yapmak için **Yönetim** > **Kurallar** > **GLPI SAML - SAML içe aktarma kuralları** bölümüne gidin veya doğrudan eklentideki **JIT kuralları** düğmesine tıklayın

source: add rule
tr_tr: Kural ekleyin

source: A hard limitation in the current plugin is that the rules can only be bound to the 'email' condition. We are planning to allow binding it to additional SamlClaims, currently it only allows the value communicated via the nameId property or emailaddress claim.
tr_tr: Var olan eklentideki kuralların yalnızca 'e-posta' koşuluna bağlanabilmesi gibi bir katı sınırlama var. Bunu ek SamlClaims ile bağlamaya izin vermeyi planlıyoruz. Şu anda yalnızca nameId özelliği veya emailaddress isteği ile iletilen değere izin veriyor.

source: For example, you want your users with SAML authentication to obtain the Self-Service profile.
tr_tr: Örneğin, SAML kimlik doğrulaması kullanan kullanıcılarınızın Self-Service profilini edinmesini istiyorsunuz.

source: You would set your criteria and action as shown here:
tr_tr: Ölçütlerinizi ve işlemlerinizi burada gösterildiği gibi belirleyebilirsiniz:

source: manage cable type
tr_tr: Kablo türünü yönetin

source: Sources
tr_tr: Kaynaklar

source: Creative Commons License
tr_tr: Creative Commons Lisansı
