Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/saml/google.po
Languages: tr_tr

source: Add a new SAML Application on GLPI
tr_tr: GLPI üzerine yeni bir SAML uygulaması ekleyin

source: First of all, you need to add a SAML application on GLPI because we need to report some information on GLPI <-> Entra/Google.
tr_tr: Öncelikle GLPI üzerine bir SAML uygulaması eklemeniz gerekiyor çünkü GLPI <-> Entra/Google üzerinde bazı bilgileri bildirmemiz gerekiyor.

source: In **Setup** > **SAML SSO Applications**, click on **+ Add**
tr_tr: **Kurulum** > **SAML SSO uygulamaları** bölümünden **+ Ekle** üzerine tıklayın

source: Give a **name** to your application
tr_tr: Uygulamanıza bir **ad** verin

source: Click on **is active**
tr_tr: **Etkin** üzerine tıklayın

source: Click on **Save**
tr_tr: **Kaydet** üzerine tıklayın

source: Add GLPI app
tr_tr: GLPI uygulaması ekleyin

source: Add an app in Google
tr_tr: Uygulamayı Google üzerine ekleyin

source: Connect to your `Google portal <https://accounts.google.com/>`_
tr_tr: `Google portal <https://accounts.google.com/>`_ sayfasını açın

source: Click on **Apps**
tr_tr: **Uygulamalar** üzerine tıklayın

source: Cick on **Web and mobile apps**
tr_tr: **Web ve mobil uygulamalar** üzerine tıklayın

source: Then, click on **Add app**
tr_tr: Ardından **Uygulama ekle** üzerine tıklayın

source: And **Add custom SAML app**
tr_tr: Ve **Özel SAML uygulaması ekle** üzerine tıklayın

source: create app Google
tr_tr: Google uygulaması oluşturun

source: Name your application
tr_tr: Uygulamanıza bir ad verin

source: Click on **Continue**
tr_tr: **İlerle** üzerine tıklayın

source: give a name to your app
tr_tr: Uygulamanıza bir ad verin

source: Click on **Save** on GLPI.
tr_tr: GLPI üzerinde **Kaydet** üzerine tıklayın.

source: Setup the Identity Provider
tr_tr: Kimlik hizmeti sağlayıcısını kurun

source: Enter the values as shown in the 2 screenshots below
tr_tr: Değerleri aşağıdaki 2 ekran görüntüsünde gösterildiği gibi yazın

source: IDP info Google
tr_tr: Google kimlik hizmeti sağlama bilgileri

source: report the values in GLPI
tr_tr: GLPI üzerindeki değerleri bildirin

source: Copy/paste the content of the certificate in GLPI with the tags *---BEGIN CERTIFICATE--- ---END CERTIFICATE---*
tr_tr: GLPI üzerinden sertifikanın içeriğini *---BEGIN CERTIFICATE--- ---END CERTIFICATE---* kod imleri ile kopyalayıp yapıştırın

source: Setup the Service Provider
tr_tr: Hizmet sağlayıcıyı yapılandırın

source: In Service provider details, report the values from GLPI to Google :
tr_tr: Hizmet sağlayıcı bilgilerinden GLPI üzerindeki değerleri Google tarafına bildirin:

source: Service provider info GLPI
tr_tr: GLPI hizmet sağlayıcı bilgileri

source: Report the values form GLPI
tr_tr: GLPI üzerindeki değerleri bildirin

source: From Google, select **EMAIL** in **Name ID format**
tr_tr: Google tarafından **Ad kimliği biçimi** olarak **E-POSTA** seçin

source: In **Name ID**, select **Basic information > Primary email**
tr_tr: **Ad kimliği** bölümünden **Temel bilgiler > Birincil e-posta** seçin

source: From GLPI, select **Email Address** in **NAMEID FORMAT**
tr_tr: GLPI üzerinden **NAMEID FORMAT** olarak **E-posta adresi** seçin

source: In **SP certificate** and **SP Private Key**, copy/paste your certificate in place of those already present. There are no strict requirements for these certificates, other than that they are valid X509 certificates.
tr_tr: **Sağlayıcı sertifikası** ve **Sağlayıcı kişisel anahtarı** alanlarında, var olanların yerine sertifikanızı kopyalayıp yapıştırın. Bu sertifikalar için geçerli X509 sertifikaları olmaları dışında katı gereklilikler yoktur.

source: setup the values
tr_tr: Değerleri ayarlayın

source: Then **Finish**
tr_tr: **Bitti** üzerine tıklayın

source: Your app is now created
tr_tr: Uygulamanız oluşturuldu

source: Security
tr_tr: Güvenlik

source: For a production instance, in GLPI, you must activate the **Strict** option in setup plugin SAML.
tr_tr: Bir üretim kopyası için GLPI üzerindeki SAML kurulum eklentisinde **Strict** seçeneğini etkinleştirmeniz gerekir.

source: We advise you to activate **JIT user creation**. This will allow the rules you create from JIT Rules to be applied.
tr_tr: **JIT kullanıcı oluşturma** özelliğini etkinleştirmenizi öneririz. Bu seçenek, JIT Kuralları ile oluşturduğunuz kuralların uygulanmasını sağlar.

source: options for security
tr_tr: Güvenlik ayarları

source: For the plugin to authenticate a user, the field must contain a **valid UPN** formatted **as an email**. This behaviour can lead to duplicate entries in GLPI when users leave Ldap. This is an important detail because some users who leave Active directory in certain scenarios still use the usersam account name (old netbui names) as the UPN in entra. As a result, the nameId field in the samlResponse will not be populated with a valid email address. The username field is used because the email field is not guaranteed to be unique in GLPI and it is essential that a unique identifier is used to allow authorisation of a specific GLPI user.
tr_tr: Eklentinin bir kullanıcıyı doğrulaması için, alan **e-posta** olarak biçimlendirilmiş **geçerli bir UPN** içermelidir. Bu davranış, kullanıcılar LDAP üzerinden ayrıldığında GLPI üzerinde yinelenen kayıtlara yol açabilir. Bu önemli bir ayrıntıdır çünkü belirli senaryolarda Active Directory üzerinden ayrılan bazı kullanıcılar Entra üzerinde UPN olarak hala usersam hesap adını (eski netbui adları) kullanır. Sonuç olarak, samlResponse paketindeki nameId alanı geçerli bir e-posta adresiyle doldurulmaz. Kullanıcı adı alanı kullanılır çünkü e-posta alanının GLPI üzerinde benzersiz olması garanti edilmez ve belirli bir GLPI kullanıcısının yetkilendirilmesine izin vermek için benzersiz bir kimliğin kullanılması önemlidir.

source: Add users allowed to use SAML
tr_tr: SAML kullanma izni olan kullanıcıları ekleyin

source: SAML needs users/groups to be added so that they are authorised to use authentication.
tr_tr: SAML kimlik doğrulamasını kullanabilmeleri için kullanıcı/grup eklenmesi gerekir.

source: On your appl, click on **Viex details** tab in **User access**
tr_tr: Uygulamanızda **Kullanıcı erişimi** bölümündeki **Ayrıntıları görüntüle** sekmesine tıklayın

source: Click on **On for everyone**
tr_tr: **Herkes için** üzerine tıklayın

source: Allow users to use app
tr_tr: Kullanıcıların uygulamayı kullanmasına izin verin

source: Mapping
tr_tr: Eşleştirme

source: If you wish to add additional information to your profile, you can use Attributes. Your profile will be populated with the information entered in Entra.
tr_tr: Profilinize ek bilgi eklemek isterseniz, öznitelikleri kullanabilirsiniz. Profiliniz Entra üzerine girilen bilgilerle doldurulur.

source: In you app, click on **Configure SAML attribute mapping** in **SAML attribute mapping**
tr_tr: Uygulamanızda **SAML öznitelik eşlemesi** bölümünde **SAML öznitelik eşlemesini yapılandır** üzerine tıklayın

source: Copy the URL of the one of the other claim
tr_tr: Diğer isteklerden birinin adresini kopyalayın

source: Add informations that you want
tr_tr: İstediğiniz bilgileri ekleyin

source: add attributes for Google
tr_tr: Google özniteliklerini ekleyin

source: Rules for assigning authorisations
tr_tr: Yetki atama kuralları

source: It will be necessary to establish rules for assigning authorisations to your users (to give them a profile, for example).
tr_tr: Kullanıcılarınıza yetki atamak için kurallar oluşturmanız (örneğin, onlara bir profil vermeniz) gerekir.

source: To do this, go to **Administration** > **Rules** > **GLPI SAML - Saml import rules** or by the button **JIT Rules** directly in the plugin
tr_tr: Bunu yapmak için **Yönetim** > **Kurallar** > **GLPI SAML - SAML içe aktarma kuralları** bölümüne gidin veya doğrudan eklentideki **JIT kuralları** düğmesine tıklayın

source: add rule
tr_tr: Kural ekleyin

source: A hard limitation in the current plugin is that the rules can only be bound to the 'email' condition. We are planning to allow binding it to additional SamlClaims, currently it only allows the value communicated via the nameId property or emailaddress claim.
tr_tr: Var olan eklentideki kuralların yalnızca 'e-posta' koşuluna bağlanabilmesi gibi bir katı sınırlama var. Bunu ek SamlClaims ile bağlamaya izin vermeyi planlıyoruz. Şu anda yalnızca nameId özelliği veya emailaddress isteği ile iletilen değere izin veriyor.

source: For example, you want your users with SAML authentication to obtain the Self-Service profile.
tr_tr: Örneğin, SAML kimlik doğrulaması kullanan kullanıcılarınızın Self-Service profilini edinmesini istiyorsunuz.

source: You would set your criteria and action as shown here:
tr_tr: Ölçütlerinizi ve işlemlerinizi burada gösterildiği gibi belirleyebilirsiniz:

source: manage cable type
tr_tr: Kablo türünü yönetin

source: Sources
tr_tr: Kaynaklar

source: Creative Commons License
tr_tr: Creative Commons Lisansı
