Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/renamestrings/index.po
Languages: tr_tr

source: Rename strings
tr_tr: Dizgeleri yeniden adlandır

source: Requirements (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
tr_tr: GLPI sürümü

source: Minimum PHP
tr_tr: En düşük PHP sürümü

source: Recommended
tr_tr: Önerilen

source: A `GLPI Network BASIC <https://services.glpi-network.com/#offers>`_ subscription (or higher) is required. This plugin is also available for all GLPI Network `Cloud instances <https://glpi-network.cloud>`_.
tr_tr: Bir `GLPI Network BASIC <https://services.glpi-network.com/#offers>`_ aboneliği (ya da üzeri) gereklidir. Bu eklenti tüm GLPI Network `Cloud kopyaları <https://glpi-network.cloud>`_ ile de edinilebilir.

source: Download the plugin
tr_tr: Eklentiyi indirin

source: Go to **Marketplace**. Download and install the plugin **Rename GLPI strings**
tr_tr: Mağazaya gidin. **GLPI dizgelerini yeniden adlandır** eklentisini indirip kurun.

source: isntall the plugin
tr_tr: Eklentiyi kurmak

source: Creating an override
tr_tr: Bir değişiklik oluşturmak

source: Go to **Setup > Rename GLPI strings**
tr_tr: **Kurulum > GLPI dizgelerini yeniden adlandır** bölümüne gidin

source: Click on **Add** and select the appropriate language.
tr_tr: **Ekle** üzerine tıklayın ve uygun dili seçin.

source: In the **Override** tab, click on **New override**.
tr_tr: **Değişiklik** sekmesinden **Yeni değişiklik** üzerine tıklayın.

source: Select the value you wish to change from the drop-down list. You can search directly.
tr_tr: Değiştirmek istediğiniz değeri açılır listeden seçin. Doğrudan arama yapabilirsiniz.

source: We are going to change the value **Computer** to **PC**
tr_tr: **Bilgisayar** değerini **PC** olarak değiştireceğiz

source: Select computer and enter the singular and plural of the word to be changed in the corresponding fields.
tr_tr: Bilgisayar seçip, değiştirilecek sözcüğün tekil ve çoğul biçimini ilgili alanlara yazın.

source: Click on **Save**
tr_tr: **Kaydet** üzerine tıklayın

source: create override
tr_tr: Değişiklik oluşturun

source: Show the change
tr_tr: Değişikliği görüntülemek

source: You may not see the change immediately. To make it appear, log out and then log back in.
tr_tr: Değişikliği hemen göremeyebilirsiniz. Görünmesini sağlamak için oturumunuzu kapatıp yeniden açın.

source: Before :
tr_tr: Önceki:

source: before
tr_tr: Önceki

source: After :
tr_tr: Sonraki:

source: after
tr_tr: Sonraki

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/Rename_strings/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/Rename_strings/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
