Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/centreon/index.po
Languages: tr_tr

source: Download
tr_tr: İndir

source: Sources
tr_tr: Kaynaklar

source: Requirements (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
tr_tr: GLPI sürümü

source: Minimum PHP
tr_tr: En düşük PHP sürümü

source: Recommended
tr_tr: Önerilen

source: Features
tr_tr: Özellikler

source: Centreon is a network, system, applicative supervision and monitoring tool. Centreon plugin allows you to see general information about hosts and their services on your GLPI interface, as long as the items are both in GLPI and Centreon.
tr_tr: Centreon bir ağ, sistem, uygulama denetim ve izleme aracıdır. Centreon eklentisi, ögeler hem GLPI hem de Centreon üzerinde bulunduğu sürece, GLPI arayüzünüzdeki sistemler ve hizmetleri hakkında genel bilgileri görmenizi sağlar.

source: You can perform 3 main actions :
tr_tr: 3 ana işlem yapabilirsiniz:

source: Acknowledge a problem
tr_tr: Bir sorunu onaylamak

source: Schedule a downtime
tr_tr: Bir durma aralığı zamanlamak

source: Trigger a host check,
tr_tr: Bir sistem denetimi başlatmak,

source: and you can also see the timeline of the host.
tr_tr: ve sistemin zaman çizelgesini görmek.

source: Installation
tr_tr: Kurulum

source: Uncompress the archive
tr_tr: Arşivi ayıklayın

source: Move the ``centreon`` folder to ``<GLPI_ROOT>/plugins`` directory
tr_tr: ``centreon`` klasörünü ``<GLPI_ROOT>/plugins`` klasörüne taşıyın

source: Navigate to the **Configuration > Plugins** page,
tr_tr: **Yapılandırma > Eklentiler** bölümüne gidin.

source: Install and activate the plugin.
tr_tr: Eklentiyi kurup etkinleştirin.

source: Usage
tr_tr: Kullanım

source: You need to configure the plugin before using it. To do so, go to the **Setup > Plugins > Centreon** page. You will need to fill the following fields :
tr_tr: Eklentiyi kullanmadan önce yapılandırmanız gerekir. Bunu yapmak için **Kurulum > Eklentiler > Centreon** bölümüne gidin. Aşağıdaki alanları doldurmanız gerekecek:

source: **Centreon URL** : The URL of your Centreon interface, following by the number of the port, and the API version to use
tr_tr: **Centreon adresi**: Centreon arayüzünüzün adresi, ardından bağlantı noktası numarası ve kullanılacak API sürümü

source: **Centreon Username** : The username of your Centreon account
tr_tr: **Centreon kullanıcı adı**: Centreon hesabınızın kullanıcı adı

source: **Centreon Password** : The password of your Centreon account
tr_tr: **Centreon parolası** : Centreon hesabınızın parolası

source: Centreon configuration
tr_tr: Centreon yapılandırması

source: Then, it will create automatically a new SQL table named ``glpi_plugin_centreon_hosts``. This table will contain all the hosts that are both in GLPI and Centreon. A new tab is created on the host page, so you can see the information about the host.
tr_tr: Ardından, otomatik olarak ``glpi_plugin_centreon_hosts`` adında yeni bir SQL tablosu oluşturulur. Bu tabloda, hem GLPI hem de Centreon üzerinde bulunan tüm sistemler bulunur. Sistem sayfasında yeni bir sekme oluşturulur, böylece sistem hakkındaki bilgileri görebilirsiniz.

source: Centreon homepage
tr_tr: Centreon sitesi

source: Centreon timeline
tr_tr: Centreon zaman akışı

source: Creative Commons License
tr_tr: Creative Commons Lisansı
