Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/advanceddashboard/index.po
Languages: cs_cz, pt_br, tr_tr

source: Advanced dashboards
cs_cz: Pokročilé nástěnky
pt_br: Painéis de visualização avançadas
tr_tr: Gelişmiş panolar

source: Requirements (on-premise)
cs_cz: Požadavky (on-premise)
pt_br: Requisitos (localmente)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
cs_cz: Verze GLPI
pt_br: Versão do GLPI
tr_tr: GLPI sürümü

source: Minimum PHP
pt_br: PHP mínimo
tr_tr: En düşük PHP sürümü

source: Recommended
cs_cz: Doporučeno
pt_br: Recomendado
tr_tr: Önerilen

source: A `GLPI Network STANDARD <https://services.glpi-network.com/#offers>`_ subscription (or higher) is required. This plugin is also available for all GLPI Network `Cloud instances <https://glpi-network.cloud>`_.
tr_tr: Bir `GLPI Network STANDARD <https://services.glpi-network.com/#offers>`_ aboneliği (ya da üzeri) gereklidir. Bu eklenti tüm GLPI Network `Cloud kopyaları <https://glpi-network.cloud>`_ ile de edinilebilir.

source: Install the plugin
cs_cz: Nainstalovat zásuvný modul
pt_br: Instalar o plugin
tr_tr: Eklentiyi kurmak

source: Go to the marketplace. Download and install the “**Advanced dashboard**” plugin.
cs_cz: Jít do obchodu. Stáhnout a nainstalovat zásuvný modul “**Advanced dashboard**”.
pt_br: Vá para o marketplace. Baixe e instale o plugin "*Painéis de visualização avançados**".
tr_tr: Mağazaya gidin. **Gelişmiş panolar** eklentisini indirip kurun.

source: Setup the plugin
cs_cz: Nastavení zásuvného modulu
pt_br: Configurar o plugin
tr_tr: Eklentiyi kurmak

source: This plugin requires **a minimum knowledge of SQL** in order to be able to set certain criteria for the various queries that will appear in the dashboards. It is also recommended that you **know the structure of GLPI tables**.
cs_cz: Tento zásuvný modul vyžaduje **minimální znalosti SQL** abyste mohli nastavit určitá kritéria pro různé dotazy, které se zobrazí na panelech. Doporučuje se také **znát strukturu tabulek GLPI**.
pt_br: Este plugin requer **um conhecimento mínimo de SQL** para ser capaz de definir certos critérios para as várias consultas que aparecerão nos painéis. Também é recomendado que você **conheça a estrutura das tabelas do GLPI**.
tr_tr: Bu eklenti, panolarda görünecek çeşitli sorguların belirli ölçütlerini ayarlayabilmek için **en az SQL bilgisi** gereklidir. Ayrıca **GLPI tablolarının yapısını bilmeniz** de önerilir.

source: Create an SQL query
cs_cz: Vytvořit SQL dotaz
pt_br: Criar uma consulta SQL
tr_tr: Bir SQL sorgusu oluştur

source: The below example gives us the number of tickets on the root entity over the last 2 years:
cs_cz: Níže uvedený příklad nám udává počet požadavků na kořenové entitě za poslední 2 roky:
pt_br: O exemplo abaixo nos dá o número de ingressos na entidade raiz nos últimos 2 anos.
tr_tr: Aşağıdaki örnek bize son 2 yılda kök varlıktaki destek kaydı sayısını verir:

source: Setting query-related parameters
cs_cz: Nastavení parametrů souvisejících s dotazem
pt_br: Definindo parâmetros relacionados à consulta
tr_tr: Sorguyla ilgili parametreleri ayarlamak

source: From **tools** > **SQL for dashboards**, click on **add**
cs_cz: Z **Nástroje** > **SQL pro nástěnky** klikněte na **přidat**
pt_br: De **ferramentas** > **SQL para painéis**, clique em **adicionar**
tr_tr: **Araçlar** > **Panolar için SQL**' bölümünde **Ekle** üzerine tıklayın

source: Name your query (the one that will be visible from the dashboards) and identify it as **active**.
cs_cz: Pojmenujte svůj dotaz (ten, který bude viditelný na panelech) a označte jej jako **aktivní**.
pt_br: Nomeie sua consulta (aquela que será visível nos painéis) e identifique-a como **ativa**.
tr_tr: Sorgunuzu (panolarda görüntülenecek olan) adlandırın ve **Etkin** olarak ayarlayın.

source: In the SQL Editor tab, paste the above query, taking care to change the name of the entity if you have changed it.
cs_cz: Na kartě Editor SQL vložte výše uvedený dotaz a dejte pozor, abyste změnili název entity, pokud jste jej změnili.
pt_br: Na guia Editor SQL, cole a consulta acima, tomando cuidado para alterar o nome da entidade, caso você tenha alterado.
tr_tr: SQL düzenleyici sekmesine yukarıdaki sorguyu yapıştırın. Değiştirdiyseniz, varlığın adını değiştirmeyi unutmayın.

source: Click on the floppy icon to save the query and then on play icon to run the query.
cs_cz: Klikněte na ikonu diskety pro uložení dotazu a poté na ikonu přehrávání pro spuštění dotazu.
pt_br: Clique no ícone do disquete para salvar a consulta e depois no ícone de reprodução para executar a consulta.
tr_tr: Sorguyu kaydetmek için disket simgesine, yürütmek için ise oynat simgesine tıklayın.

source: SQL editor
cs_cz: Editor SQL
pt_br: Editor SQL
tr_tr: SQL düzenleyici

source: An insert at the bottom will display the result of the query:
cs_cz: Vložení v dolní části zobrazí výsledek dotazu:
pt_br: Um inserir na parte inferior exibirá o resultado da consulta:
tr_tr: Alttaki bölümde sorgu sonucunu görüntülenir:

source: preview result
cs_cz: náhled výsledku
pt_br: resultado de visualização
tr_tr: Sonuç ön izlemesi

source: In the **set up fields** tab, define the label, the number and the main label (optional, this is the name your table will have). In our case, *the label will be "year"*, *the number will be "number of tickets"* and the *main label will be ""number of tickets per year"*.
cs_cz: Na záložce **nastavení polí** definujte nadpis, číslo a hlavní nadpis (volitelné, toto je název, který bude mít vaše tabulka). V našem případě bude *nadpis "rok"*, *číslo "počet požadavků"* a *hlavní nadpis ""počet požadavků za rok"*.
pt_br: Na guia **configurar campos**, defina o rótulo, o número e o rótulo principal (opcional, este é o nome que sua tabela terá). No nosso caso, *o rótulo será "ano"*, *o número será "número de ingressos"* e o *rótulo principal será "número de ingressos por ano"*
tr_tr: **Alanları ayarla** sekmesinden, etiketi, numarayı ve ana etiketi (isteğe bağlı, tablonuzun adı) tanımlayın. Bizim durumumuzda, *etiket "yıl"* olacak, *numara "destek kaydı sayısı"* olacak ve *ana etiket ""yıl başına destek kaydı sayısı"* olacak.

source: Select the type of graph (this is for information purposes only, so that you can preview your table; you will be asked to select the type of graph you want to appear in the tile later),
cs_cz: Vyberte typ grafu (toto slouží pouze pro informační účely, abyste si mohli zobrazit náhled tabulky; později budete požádáni o výběr typu grafu, který chcete na dlaždici zobrazit),
pt_br: Selecione o tipo de gráfico (isso é apenas a título informativo, para que você possa visualizar sua tabela; você será solicitado a selecionar o tipo de gráfico que deseja que apareça no bloco mais tarde),
tr_tr: Çizelge türünü seçin (yalnızca bilgilendirme amaçlıdır, böylece tablonun ön izlemesini görüntüleyebilirsiniz. Ardından karo içinde görüntülenmesini istediğiniz çizelge türünü seçmeniz istenir),

source: You can limit the amount of data to be displayed.
cs_cz: Můžete omezit množství zobrazovaných dat.
pt_br: Você pode limitar a quantidade de dados a serem mostrados.
tr_tr: Görüntülenecek veri miktarını sınırlayabilirsiniz.

source: Then click on **Save fields and preview**.
cs_cz: Poté klikněte na **Uložit pole a náhled**.
pt_br: Então clique em **Salvar campos e visualizar**.
tr_tr: Ardından **Alanları kaydet ve ön izle** seçeneğine tıklayın.

source: card setup
cs_cz: nastavení karty
pt_br: configuração do cartão
tr_tr: Kart kurulumu

source: Dashboard settings
cs_cz: Nastavení nástěnky
pt_br: Configuração de painel de visualização
tr_tr: Pano ayarları

source: From **Assistance** > **Dashboard**, select the dashboard that is to receive the new tile
cs_cz: V části **Podpora** > **Nástěnka** vyberte řídicí panel, který má obdržet novou dlaždici
pt_br: Do **Assistência** > **Painel de controle**, selecione o painel de controle que irá receber o novo bloco
tr_tr: **Yardım** > **Pano** bölümünden yeni karonun yerleştirileceği panoyu seçin

source: Click on edit icon
cs_cz: Klikněte na ikonu úprav
pt_br: Clique no ícone de edição
tr_tr: Düzenle simgesine tıklayın

source: Add a new tile with plus icon
cs_cz: Přidejte novou dlaždici s ikonou plus
pt_br: Adicione um novo bloco com ícone de adição
tr_tr: Artı simgesi ile yeni bir karo ekleyin

source: Select the query you have just created
cs_cz: Vyberte dotaz, který jste právě vytvořili
pt_br: Selecione a consulta que você acabou de criar
tr_tr: Oluşturduğunuz sorguyu seçin

source: Choose a colour for your tile
cs_cz: Vyberte si barvu dlaždice
pt_br: Escolha uma cor para o seu bloco
tr_tr: Karonuzun rengini seçin

source: more card setup
cs_cz: další nastavení karty
pt_br: mais configurações do cartão
tr_tr: Başka kart kurulumu

source: You will then be asked to select the chart type
cs_cz: Poté budete požádáni o výběr typu grafu
pt_br: Você será então solicitado a selecionar o tipo de gráfico.
tr_tr: Çizelge türünü seçmeniz istenecek

source: Some dashboards may ask you to use colours and display values and labels.
cs_cz: Některé řídicí panely mohou vyžadovat použití barev a zobrazení hodnot a názvů.
pt_br: Alguns painéis podem solicitar que você use cores e exiba valores e rótulos.
tr_tr: Bazı panolar için renk kullanmanız ve değerler ile etiketleri görüntülemeniz istenebilir.

source: label setup
cs_cz: nastavení názvu
pt_br: configuração da etiqueta
tr_tr: Etiket kurulumu

source: Your tile is now ready
cs_cz: Vaše dlaždice je nyní připravena
pt_br: Seu título está pronto agora.
tr_tr: Karonuz hazır

source: the card is ready
cs_cz: karta je připravena
pt_br: o cartão está pronto
tr_tr: Kart hazır

source: FAQ
cs_cz: Časté dotazy
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/Advanced_dashboard/>`_
cs_cz: Máte-li jakékoli dotazy týkající se používání zásuvného modulu, přečtěte si prosím `naše časté dotazy <https://faq.teclib.com/04_Plugins/Advanced_dashboard/>`_
pt_br: Se você tem alguma dúvida sobre o uso do plugin, consulte `nosso FAQ <https://faq.teclib.com/04_Plugins/Advanced_dashboard/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/Advanced_dashboard/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
cs_cz: Licence Creative Commons
pt_br: Licença Creative Commons
tr_tr: Creative Commons Lisansı
