Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/tag/index.po
Languages: tr_tr

source: Download
tr_tr: İndir

source: Sources
tr_tr: Kaynaklar

source: Requirements (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
tr_tr: GLPI sürümü

source: Minimum PHP
tr_tr: En düşük PHP sürümü

source: Recommended
tr_tr: Önerilen

source: Install the plugin
tr_tr: Eklentiyi kurmak

source: Go to the marketplace. Download and install the plugin “**Tag**”.
tr_tr: Mağazaya gidin. **Etiket** eklentisini indirip kurun.

source: install the plugin
tr_tr: Eklentiyi kurmak

source: Setting up the plugin
tr_tr: Eklenti kuruluyor

source: From **Setup > Dropdowns**
tr_tr: **Kurulum > Açılan kutular** bölümünden

source: Click on **Tag management**
tr_tr: **Etiket yönetimi** üzerine tıklayın

source: Then **Tags**
tr_tr: Ardından **Etiketler** üzerine tıklayın

source: setup tags
tr_tr: Etiketleri ayarlayın

source: Enter a name that will be visible when tags are added
tr_tr: Etiketler eklendiğinde görüntülenecek adı yazın

source: Enter a description (optional)
tr_tr: Bir açıklama yazın (isteğe bağlı)

source: Add a colour
tr_tr: Bir renk belirleyin

source: Associate one or more elements. If nothing is ticked, it will not be visible in any element by default.
tr_tr: Bir ya da daha fazla bileşeni ilişkilendirin. Hiçbir şey işaretlenmemişse, varsayılan olarak hiçbir bileşende görüntülenmez.

source: add new tag
tr_tr: Yeni etiket ekleyin

source: Choose where to find the tag
tr_tr: Etiketin nerede bulunacağını seçin

source: You can indicate whether the tag should be at the top or bottom of the list.
tr_tr: Etiketin listenin en üstünde mi yoksa en altında mı olacağını belirtebilirsiniz.

source: From **Setup > General > Tag management**, specify the tag location.
tr_tr: **Kurulum > Genel > Etiket yönetimi** bölümünden etiket konumunu belirtin.

source: Bottom :
tr_tr: En altta:

source: tag on bottom
tr_tr: Etiket en altta

source: Top:
tr_tr: En üstte:

source: tag on top
tr_tr: Etiket en üstte

source: Adding rules
tr_tr: Kurallar eklemek

source: You can add business rules (tickets, computers, etc.) to add tags to particular items.
tr_tr: Etiketlerin belirli ögelereeklenmesi için iş kuralları (destek kayıtları, bilgisayarlar, vb.) tanımlayabilirsiniz.

source: Example : Assign a VIP tag when a member of the management group writes a ticket.
tr_tr: Örnek : Yönetim grubundaki bir üye destek kaydı açtığında VIP etiketi atansın.

source: Here are the criteria to be implemented from **Administration > Rules > Business rules for tickets**
tr_tr: **Yönetim > Kurallar > Destek kayıtları için iş kuralları** bölümünden uygulanacak ölçütler şunlardır:

source: add new rule
tr_tr: Yeni kural ekle

source: criterion and action
tr_tr: Ölçüt ve işlem

source: After creating a ticket :
tr_tr: Destek kaydı oluşturulduktan sonra:

source: result
tr_tr: Sonuç

source: Tags can, of course, be added manually if they have been set to be visible in the specified item.
tr_tr: Etiketler, belirtilen ögede görünür olacak şekilde ayarlanmışsa el ile de eklenebilir.

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/Tags/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/Tags/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
