Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/fields/index.po
Languages: cs_cz, fr_fr, pt_pt, tr_tr

source: Dropdown values can be translated using the core's dropdown configuration.
cs_cz: Hodnoty rozbalovací nabídky mohou být překládány pomocí nastavení rozbalovacích nabídek aplikace samotné.
fr_fr: Les valeurs des listes déroulantes peuvent être traduites en utilisant la configuration des intitulés du cœur.
pt_pt: Os valores suspensos podem ser traduzidos usando a configuração suspensa do núcleo.
tr_tr: Açılan kutu değerleri çekirdek açılan kutu yapılandırması bölümünden yapılabilir.

source: As of GLPI 9.1.1; some issues on the core side prevent dropdown plugin values to be translated; the possibility has been deactivated in the plugin. It will be enabled again once the core has been fixed.
cs_cz: U GLPI 9.1.1; některé problémy na straně aplikace brání tomu aby byly překládány hodnoty rozbalovací nabídky zásuvného modulu; možnost byla v zásuvném modulu vypnuta. Bude zapnuta jakmile bude problém v aplikaci opraven.
fr_fr: Dans GLPI 9.1.1 ; certains problèmes empêchent la traduction des valeurs des listes déroulantes ; la possibilité a donc été désactivée dans le plugin. Elle sera réactivée lorsque le cœur aura été corrigé.
pt_pt: A partir de GLPI 9.1.1; alguns problemas no lado central impedem que os valores do plugin DropDown sejam traduzidos; a possibilidade foi desativada no plugin. Ele será ativado novamente uma vez que o núcleo foi corrigido.
tr_tr: GLPI 9.1.1 sürümüyle birlikte; Çekirdek üzerindeki bazı sorunlar açılan kutu eklentisi değerlerinin çevrilmesini engeller. Eklenti etkisizleştirilebilir. Çekirdek sorunları giderildikten sonra yeniden etkinleştirilecek.

source: Entities
cs_cz: Entity
fr_fr: Entités
pt_pt: Entidades
tr_tr: Varlıklar

source: If you are using entities in your GLPI instance, a block will be displayed only if the entity it is attached to is compatible with the one of the item it applies to.
cs_cz: Pokud ve své instanci GLPI používáte entity, blok bude zobrazen pouze pokud je entita ke které je připojena s tou na kterou je položka uplatněna.
fr_fr: Si vous utilisez des entités dans votre instance de GLPI, un bloc ne sera affiché que si l'entité à laquelle il est attaché correspond est compatible avec celle de l'objet auquel il s'applique.
pt_pt: Se estivermos a usar entidades em GLPI, um bloco será exibido somente se a entidade à qual ele está anexado for compatível com o item ao qual ele se aplica.
tr_tr: GLPI kopyanızda varlıkları kullanıyorsanız, bir blok yalnızca, varlık uygulandığı uyumlu ögelerinden birine atanmış ise görüntülenir.

source: When you create or edit a block in multi entities mode, you'll have to choose if the block will be available in children entities:
cs_cz: Když vytvoříte nebo upravíte blok v režimu více entit, bude třeba zvolit zda blok bude dostupný v podřízených entitách:
fr_fr: Lorsque vous créez ou modifiez un bloc en mode multi-entités, vous devrez choisir s'il sera accessible depuis les entités enfants.
pt_pt: Quando se cria ou se edita um bloco no modo de várias entidades, teremos que escolher se o bloco estará disponível em entidades seguintes:
tr_tr: Birden çok varlık kipinde bir blok ekler ya da düzenlerseniz, bloğun alt varlıklar için kullanılabilir olup olmadığını belirtmeniz gerekir:

source: As an example, let's say our entities have the following structure:
cs_cz: Jako příklad, řekněme že vaše entity mají následující strukturu:
fr_fr: Par exemple, disons que vos entités respectent la structure suivante :
pt_pt: Como exemplo, digamos que nossas entidades tenham a seguinte estrutura:
tr_tr: Örnek olarak, varlık yapımız şu şekilde olsun:

source: ``root``
fr_fr: ``racine``
tr_tr: ``kök``

source: The following table will tell you in wich cases the block is displayed or not:
cs_cz: Následující tabulka uvádí ve kterých případech budou bloky zobrazeny a ve kterých ne:
fr_fr: La table ci-dessous vous dira dans quels cas votre bloc sera affiché ou non :
pt_pt: A tabela a seguir lhe dirá em quais casos o bloco é exibido ou não:
tr_tr: Aşağıdaki tablo bloğun hangi durumlarda görüntülenip görüntülenmeyeceğini belirler:

source: Block entity
cs_cz: Blok položky
fr_fr: Entité du bloc
pt_pt: Entidade do bloco
tr_tr: Blok varlığı

source: Recursive block
cs_cz: Rekurzivní blok
fr_fr: Bloc récursif
pt_pt: Bloco recursivo
tr_tr: Aşağı inen blok

source: Item entity
cs_cz: Entita položky
fr_fr: Entité de l'objet
pt_pt: Entidade de item
tr_tr: Öge varlığı

source: Block displayed
cs_cz: Blok zobrazený
fr_fr: Blo affiché
pt_pt: Bloco exibido
tr_tr: Blok görüntülenmesi

source: Yes or No
cs_cz: Ano nebo Ne
fr_fr: Oui ou Non
pt_pt: Sim ou não
tr_tr: Evet ya da Hayır

source: Yes
cs_cz: Ano
fr_fr: Oui
pt_pt: Sim
tr_tr: Evet

source: No
cs_cz: Ne
fr_fr: Non
pt_pt: Não
tr_tr: Hayır

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/Fields/>`_
fr_fr: Si vous avez des questions à propos de l'utilisation de ce plugin, veuillez consulter `notre FAQ <https://faq.teclib.com/04_Plugins/Fields/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/Fields/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
fr_fr: Licence Creative Commons
tr_tr: Creative Commons Lisansı

source: Fields
cs_cz: Kolonky
fr_fr: Champs additionnels
pt_pt: Campos

source: This plugin is available without a GLPI-Network subscription. It is also available in `Cloud <https://glpi-network.cloud/>`_
fr_fr: Ce plugin est disponible sans souscription GLPI-Network. Il est également disponible sur le `Cloud <https://glpi-network.cloud/>`_.
