Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/fields/index.po
Languages: cs_cz, fr_fr, pt_pt, tr_tr

source: Fields plugin allows to add additional fields on various items GLPI manages: tickets, computers, users, ...
cs_cz: Zásuvný modul kolonky umožňuje přidat další kolonky do různých položek které GLPI spravuje: požadavků, počítačů, uživatelů, …
fr_fr: Le plugin champs additionnels vous permet d'ajouter de nouveaux champs à différents objets de GLPI : tickets, ordinateurs, utilisateurs, ...
pt_pt: Campos plugin permite adicionar campos adicionais em vários itens de gerência GLPI: bilhetes, computadores, utilizadores,…
tr_tr: Alanlar eklentisi destek kayıtları, bilgisayarlar, kullanıcılar gibi çeşitli GLPI ögelerine özel alanlar eklenebilmesini sağlar.

source: Download
fr_fr: Télécharger
tr_tr: İndir

source: Sources
tr_tr: Kaynaklar

source: Requirements (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
fr_fr: Version de GLPI
tr_tr: GLPI sürümü

source: Minimum PHP
fr_fr: PHP minimum
tr_tr: En düşük PHP sürümü

source: Recommended
fr_fr: Recommandé
tr_tr: Önerilen

source: This plugin is available without a `GLPI Network <https://services.glpi-network.com/#offers>`_ subscription. It is also available on `GLPI Cloud <https://glpi-network.cloud>`_.
tr_tr: Bu eklenti bir `GLPI-Network <https://services.glpi-network.com/#offers>`_ aboneliği olmadan kullanılabilir. Ayrıca `GLPI Cloud <https://glpi-network.cloud/>`_ üzerinden de edinilebilir.

source: Features
cs_cz: Funkce
fr_fr: Fonctionnalités
pt_pt: Características
tr_tr: Özellikler

source: Add containers block on various items,
cs_cz: Přidat blok kontejnerů na různé položky,
fr_fr: Ajout de blocs conteneurs sur différents objets,
pt_pt: Adicionar containers block em vários itens,
tr_tr: Çeşitli ögeler için kapsayıcı bloğu ekler,

source: Add fields into blocks,
cs_cz: Přidat kolonky do bloků,
fr_fr: Ajout de champs dans les blocs,
pt_pt: Adicionar campos em blocos,
tr_tr: Bloklara alanlar ekler,

source: Display blocks in an existing tab or in their own tab,
cs_cz: Zobrazit bloky ve stávající kartě nebo na jejich vlastní,
fr_fr: Affichage des blocs dans un onglet existant ou dans leur propre onglet,
pt_pt: Exibir blocos em uma guia existente ou na sua própria guia,
tr_tr: Blokları var olan ya da yeni bir sekmede görüntüler,

source: Many fields types available,
cs_cz: Je k dispozici mnoho typů kolonek,
fr_fr: Plusieurs types de champs disponibles,
pt_pt: Muitos tipos de campos disponíveis,
tr_tr: Pek çok farklı alan türü kullanılabilir,

source: Fields can be flagged as required,
cs_cz: Kolonky je možné označit jako povinné,
fr_fr: Les champs peuvent être marqués comme étant requis,
pt_pt: Os campos podem ser sinalizados conforme necessário,
tr_tr: Alanlar zorunlu olarak işaretlenebilir,

source: Manage profiles ACLs per container,
cs_cz: Spravovat ACL profily v jednotlivých kontejnerech,
fr_fr: Gestion des accès des profils par conteneur,
pt_pt: Gerir perfis ACLs por container,
tr_tr: Herp kapsayıcı için profil Erişim Denetimi Listesi kullanılabilir,

source: Install the Plugin
cs_cz: Nainstalovat zásuvný modul
fr_fr: Installer le plugin
pt_pt: Instalar este Plugin
tr_tr: Eklentiyi kurmak

source: Uncompress the archive.
cs_cz: Rozbalit archiv.
fr_fr: Décompresser l'archive.
pt_pt: Descompactar o arquivo.
tr_tr: Arşivi ayıklayın.

source: Move the ``fields`` directory to the ``<GLPI_ROOT>/plugins`` directory
cs_cz: Přesuňte složku ``fields`` do složky ``<GLPI_ROOT>/plugins``
fr_fr: Déplacer le répertoire ``fields`` dans le répertoire `<GLPI_ROOT>/plugins``.
pt_pt: Mova o diretório ‘‘Fields’’ para o diretório ‘’<GLPI_ROOT>/plugins’’</GLPI_ROOT>
tr_tr: ``fields`` klasörünü ``<GLPI_ROOT>/plugins`` klasörüne taşıyın

source: Navigate to the *Configuration > Plugins* page,
cs_cz: Přejděte na stránku *Nastavení > Zásuvné moduly*,
fr_fr: Aller à la page *Configuration > Plugins*,
pt_pt: Navegue até à página * configuração > plugins *,
tr_tr: *Yapılandırma > Eklentiler* bölümüne gidin.

source: Install and activate the plugin.
cs_cz: Nainstalovat a zapnout zásuvný modul.
fr_fr: Installer et activer le plugin.
pt_pt: Instale e ative o plugin.
tr_tr: Eklentiyi kurup etkinleştirin.

source: Usage
cs_cz: Použití
fr_fr: Utilisation
pt_pt: Uso
tr_tr: Kullanım

source: The plugin will create required tables in the database and some files on disk (into ``<GLPI_ROOT>/files/_plugins/fields``) automatically. Those files and tables will be updated along with the plugin.
cs_cz: Zásuvný modul automaticky vytvoří potřebné tabulky v databázi a také soubory na úložišti (v ``<GLPI_ROOT>/files/_plugins/fields``). Tyto kolonky a tabulky budou aktualizovány společně se zásuvným modulem.
fr_fr: Le plugin va créer les tables requises dans la base de données ainsi que certains fichiers sur le disque (dans ``<GLPI_ROOT>/files/_plugins/fields``) automatiquement. Ces fichiers et tables seront mis à jour avec le plugin.
pt_pt: O plugin criará tabelas necessárias na base de dados e alguns arquivos no disco (em ‘’<GLPI_ROOT>/files/_plugins/Fields’’) automaticamente. Esses arquivos e tabelas serão atualizados junto com o plugin.</GLPI_ROOT>.
tr_tr: Bu eklenti otomatik olarak veri tabanında gerekli tabloları ve diskte bazı dosyaları oluşturur (``<GLPI_ROOT>/files/_plugins/fields`` klasöründe). Bu dosyalar ve tablolar eklentiyle birlikte güncellenir.

source: Plugin usage is quite simple:
cs_cz: Používání zásuvného modulu je velmi jednoduché:
fr_fr: L'utilisation du plugin est relativement simple :
pt_pt: O uso do plugin é bastante simples:
tr_tr: Eklentinin kullanımı oldukça basittir:

source: create a block linked with some items,
cs_cz: vytvořte blok propojený s nějakými položkami,
fr_fr: créer un bloc lié avec des objets,
pt_pt: criar um bloco ligado a alguns itens,
tr_tr: Bazı ögelere bağlı bir blok oluşturun,

source: create fields in this block.
cs_cz: vytvořte kolonky v tomto bloku.
fr_fr: créer des champs dans ce bloc.
pt_pt: criar campos neste bloco.
tr_tr: Bu blok içinde alanları oluşturun.

source: You will access the plugin configuration from the *Setup* > *Aditionnal fields* menu.
cs_cz: Nastavení zásuvného modulu jsou přístupná z nabídky *Nastavení* > *Další kolonky*.
fr_fr: Vous accéderez à la configuration du plugin via le menu *Configuration* > *Champs supplémentaires*
pt_pt: Acesso à configuração do plugin do menu * Setup * > * Aditionnal Fields *.
tr_tr: Eklenti yapılandırması için menüden *Yapılandırma* > *Ek alanlar* bölümüne gidin.

source: Adding a new block
cs_cz: Přidání nového bloku
fr_fr: Ajouter un nouveau bloc
pt_pt: Adicionando um novo bloco
tr_tr: Yeni bir blok eklemek

source: `Label`: the label of the block that will appears on items forms,
cs_cz: `Štítek`: štítek bloku který se objeví ve formulářích položek,
fr_fr: `Libellé` : le libellé du bloc qui sera affichée sur les formulaires des objets,
pt_pt: ‘Rótulo’: o rótulo do bloco que aparecerá nos formulários de itens,
tr_tr: `Etiket`: Öge formlarında görüntülenecek blok etiketi,

source: `Type`: type of display, one of:
cs_cz: `Type`: typ zobrazení, jedno z:
fr_fr: `Type` : le type d'affichage, parmi :
pt_pt: ‘Tipo’: tipo de exibição, um dos:
tr_tr: `Tür`: Görünüm türü, şunlardan biri:

source: `Add tab`: will add a new tab on the item form containing the block,
cs_cz: `Přidat panel`: přidá nový panel na položku formuláře obsahujícího blok,
fr_fr: `Ajout d'un onglet` : ajoutera un nouvel onglet sur le formulaire de l'objet qui contient le bloc,
pt_pt: ‘Adicionar guia’: adicionará uma nova guia no formulário de item que contém o bloco,
tr_tr: `Sekme ekle`: Bloğun bulunduğu öge formuna yeni bir sekme ekler,

source: `Insertion in the form`: will add the block at the end of the main item form,
cs_cz: `Vložení do formuláře`: přidá blok na konec formuláře hlavní položky,
fr_fr: `Insertion dans le formulaire` : ajoutera le bloc en bas du formulaire principal de l'objet,
pt_pt: ‘Inserção no formulário’: adicionará o bloco no final do formulário de item principal,
tr_tr: `Form içine ekleme`: Bloğu ana öge formunun sonuna ekler,

source: `Insertion in the form of a specific tab`: will add the block at the end of a specific tab of the item.
cs_cz: `Vložení ve formuláři konkrétního panelu`: přidá blok na konec konkrétního panelu položky.
fr_fr: `Insertion dans le formulaire d'un onglet spécifique` : ajoutera le bloc en bas d'un onglet spécifique de l'objet.
pt_pt: ‘Inserção na forma de uma guia específica’: adicionará o bloco no final de uma guia específica do item.
tr_tr: `Formdaki belirli bir sekmeye ekleme`: Bloğu ögenin belirli bir sekmesine ekler.

source: `Associated item type`: a list of items types on which the block will be added,
cs_cz: `Přiřazený typ položky`: seznam typů položek na který bude blok přidán.
fr_fr: `Type d'élément associé` : une liste de types sur lesquels le bloc sera ajouté,
pt_pt: ‘Tipo de item associado’: uma lista de tipos de itens nos quais o bloco será adicionado,
tr_tr: `İlgili öge türü`: Bloğun ekleneceği öge türlerinin listesi,

source: `Active`: whether the block is active or not.
cs_cz: `Active`: zda blok bude nebo nebude aktivní.
fr_fr: `Actif` : si le bloc est actif ou non.
pt_pt: ‘Ativo’: se o bloco está ativo ou não.
tr_tr: `Etkin`: Bloğun etkin olup olmadığı.

source: You can add only one block of the type `Insertion in the form` for an associated item type.
cs_cz: Pro přiřazený typ položky je možné přidat pouze jeden blok typu `Vložení do formuláře`.
fr_fr: Vous ne pouvez ajouter qu'un seul bloc de type `Insertion dans le formulaire` pour un type d'objet associé.
pt_pt: Você pode adicionar apenas um bloco do tipo ‘inserção no formulário’ para um tipo de item associado.
tr_tr: İlgili öge türü için `Form içine ekleme` türünde yalnızca bir blok eklenebilir.

source: Inserting a block in a specific tab is only possible for one item:
cs_cz: Vložit blok do konkrétní karty je možné pouze pro jedinou položku:
fr_fr: L'ajout d'un bloc dans un onglet spécifique n'est possible que pour un seul objet :
pt_pt: Inserir um bloco em uma guia específica só é possível para um item:
tr_tr: Blok belirli bir sekmeye blok yalnızca bir öge için eklenebilir:

source: Once a block have been created, it is possible to change its label or is active flag, but not its type or associated items list.
cs_cz: Jakmile je blok vytvořený, je možné změnit jeho štítek nebo aktivní příznak, ale už ne jeho typ nebo seznam souvisejících položek.
fr_fr: Une fois le bloc créé, il est possible de changer son libellé ou son étét actif, mais pas son type ni la liste des éléments associés.
pt_pt: Depois que um bloco tiver sido criado, é possível alterar seu rótulo ou é sinalizado ativo, mas não seu tipo ou lista de itens associados.
tr_tr: Blok oluşturulduktan sonra, etiketi ya da etkin durumu değiştirilebilir ancak türü ya da ilgili ögeler listesi değiştirilemez.

source: Profiles
cs_cz: Profily
fr_fr: Profils
pt_pt: Perfis
tr_tr: Profiller

source: You can refine profiles access on the block using the `Profiles` tab from the block. You will be able to choose either `No access`, `Read` or `Write` for every existing profile.
cs_cz: Přístup profilů je možné blíže určit na bloku pomocí panelu `Profily` z bloku. Budete schopní zvolit buď `Žádný přístup`, `Čtení` nebo `Zápis` pro každý z existujících profilů.
fr_fr: Pour pouvez affiner les accès des profils en utilisant l'onglet `Profils` du bloc. Vous aurez la possibilité de choisir entre `Pas d'accès`, `Lecture` ou `Écriture` pour chaque profil existant.
pt_pt: Poderá aperfeiçoar o acesso a perfis no bloco usando a guia ‘perfis’ do bloco. Poderá escolher ‘sem acesso’, ‘ler’ ou ‘escrever’ para cada perfil existente.
tr_tr: Bloğa erişebilecek profiller `Profiller` sekmesinden ayarlanabilir. Var olan her profil için `Erişim yok`, `Okuma` ya da `Yazma` izni seçilebilir.

source: Adding a new field
cs_cz: Přidání nové kolonky
fr_fr: Ajout d'un nouveau champ
pt_pt: A adicionar um novo campo
tr_tr: Yeni bir alan eklemek

source: `Type` field type, one of:
cs_cz: `Type` typ kolonky, jedno z:
fr_fr: `Type` type du champ, parmi :
pt_pt: Tipo de campo ‘tipo’, um dos:
tr_tr: `Tür`: Alan türü, şunlardan biri:

source: `Header`: an header label, for visual distinction,
cs_cz: `Header`: štítek hlavičky pro vizuální rozlišení,
fr_fr: `Entête` : un intitulé d'en-tête, pour une distinction visuelle,
pt_pt: `Cabeçalho`: uma etiqueta de cabeçalho, para distinção visual,
tr_tr: `Başlık`: Görsel ayrım için kullanılan başlık etiketi,

source: `Text (single line)`: a single line (``input/@type="text"``) of text,
cs_cz: `Text (jeden řádek)`: jeden řádek (``input/@type="text"``) textu,
fr_fr: `Texte (ligne simple)` : une ligne de texte simple (``input/@type=text``)
pt_pt: `Texto (linha simples)`: uma linha simples (``input/@type=“text”``) do texto,
tr_tr: `Metin (tek satır)`: Tek satırlık metin (``input/@type="text"``),

source: `Text (multiples lines)`: a multiline (``textarea``) text,
cs_cz: `Text (víceřádkový)`: víceřádkový (``textarea``) text,
fr_fr: `Texte (lignes multiples)` : un champ de texte multilignes (``textarea``)
pt_pt: `Texto (múltiplas linhas)`: um texto multilinha (``texto``),
tr_tr: `Metin (birden çok satır)`: Çok satırlı metin (``textarea``),

source: `Number`: a single number (no text allowed),
cs_cz: `Number`: jediné číslo (text není dovolen),
fr_fr: `Nombre` : un nombre (pas de texte autorisé)
pt_pt: `Numero`: um único número (nenhum texto é permitido)
tr_tr: `Sayı`: Tek bir sayı (metin yazılamaz),

source: `Dropdown`: a configurable dropdown list, values are configured from the main GLPI dropdown configuration you can find in *Setup* > *Dropdowns* menu,
cs_cz: `Rozbalovací nabídka`: nastavitelná rozbalovací nabídka, hodnoty jsou nastavené z nastavení hlavního rozbalovacího seznamu GLPI, které se nachází v nabídce *Nastavení* > *Rozbalovací nabídky*,
fr_fr: `Liste déroulante` : une liste déroulante configurable, les valeurs sont paramétrées depuis la configuration des intitulés de GLPI que vous trouverez dans le menu *Configuration* > *Intitulés*.
pt_pt: `Dropdown`: uma lista suspensa configurável, os valores são configurados a partir da configuração principal do dropdown GLPI que você pode encontrar no menu *Setup* > *Dropdowns*,
tr_tr: `Açılan kutu`: Yapılandırılabilir bir açılan kutu. Kutudaki değerler, çekirdek GLPI üzerinde *Yapılandırma* > *Açılan kutular bölümünden ayarlanabilir.

source: `Yes/No`: a dropdown list with only `Yes` and `No` values,
cs_cz: `Ano/Ne`: rozbalovací nabídka s hodnotami pouze `Ano` a `Ne`,
fr_fr: `Oui/Non` : une liste déroulante avec uniquement les valeurs `Oui` et `Non`,
pt_pt: `Sim/Não`: uma lista suspensa com apenas os valores `Sim` e `Não`,
tr_tr: `Evet/Hayır`: Yalnızca `Evet` ve `Hayır` değerleri olan bir açılan kutu,

source: `Date`: a standalone date with a date picker,
cs_cz: `Datum`: samostatné datum s jeho volbou,
fr_fr: `Date` : une date seule avec un sélecteur,
pt_pt: `Date`: um encontro independente com um seleccionador de encontros,
tr_tr: `Tarih`: Tarih seçici bulunan bir tarih alanı,

source: `Date & time`: a date field with a date picker and a time dropdown field (step is configured from GLPI core),
cs_cz: `Datum a čas`: kolonka datum s rozbalovacím voličem data a času a kolonkou času s rozbalovací nabídkou (krok je nastavený z GLPI samotného),
fr_fr: `Date et heure` : un champ de date avec un sélecteur et une liste déroulante pour l'heure (le pas étant configuré depuis le cœur de GLPI),
pt_pt: `Date & hora`: um campo de data com um seletor de data e um campo dropdown de tempo (passo é configurado a partir do núcleo GLPI),
tr_tr: `Tarih ve saat`: Tarih seçici ve saat açılan kutusu olan tarih alanı (adım GLPI çekirdeğinden yapılandırılabilir),

source: `Users`: list of users.
cs_cz: `Users`: seznam uživatelů.
fr_fr: `Utilisateurs` : une liste d'utilisateurs,
pt_pt: `Utilizadores`: lista de utilizadores.
tr_tr: `Kullanıcılar`: Kullanıcı listesi.

source: `Active`: whether the block is active or not,
cs_cz: `Aktivní`: zda je blok aktivní či ne,
fr_fr: `Actif` : si le champ est actif ou non,
pt_pt: ‘Ativo’: se o bloco está ativo ou não,
tr_tr: `Etkin`: Bloğun etkin olup olmadığı.

source: `Read only`: flag this field as read only,
cs_cz: `Pouze pro čtení`: označit tuto kolonku pouze pro čtení,
fr_fr: `Lecture seule` : si le champ est en lecture seule,
pt_pt: `Somente leitura`: marcar este campo como somente leitura,
tr_tr: `Salt okunur`: Bu alanı salt okunur kılar,

source: `Default values`: default field values,
cs_cz: `Výchozí hodnoty`: výchozí hodnoty kolonky,
fr_fr: `Valeurs par défaut` : valeurs par défaut du champ,
pt_pt: `Valores padrão`: valores de campo padrão,
tr_tr: `Varsayılan değerler`: Alanın varsayılan değerleri,

source: `Mandatory field`: flag this field as mandatory.
cs_cz: `Povinná kolonka`: označit tuto kolonku jako povinnou.
fr_fr: `Champ obligatoire` : détermine si le champ est obligatoire.
pt_pt: `Campo obrigatório`: assinale este campo como obrigatório.
tr_tr: `Zorunlu`: Alanı zorunlu kılar.

source: Of course, you will need to pay attention playing with the various options... For example, if you flag a field as mandatory and as read only, and if you do not provide a default value, form validation will fail.
cs_cz: Samozřejmě je třeba dávat pozor při nakládání s různými volbami… Například pokud označíte kolonku jako povinnou a pouze pro čtení a neposkytnete výchozí hodnotu, ověření formuláře se nezdaří.
fr_fr: Bien entendu, il vous faudra prêter attention en modifiant les différentes options... Si par exemple, vous définissez un champ obligatoire et en lecture seule, et que vous ne définissez pas de valeur par défaut, la validation du formulaire échouera.
pt_pt: É claro que terá de prestar atenção ao brincar com as várias opções… Por exemplo, se você marcar um campo como obrigatório e como somente leitura, e se você não fornecer um valor padrão, a validação do formulário falhará.
tr_tr: Çeşitli ayarları değiştirirken dikkatli olmalısınız... Örneğin bir alanı hem zorunlu hem salt okunur olarak işaretleyip varsayılan bir değer atamazsanız form doğrulamadan geçemez.

source: Another example: you should not set a text default value for a number field... That kind of things ;)
cs_cz: Jiný příklad: neměli byste výchozí textovou hodnotu pro číselnou kolonku… A tak podobně ;)
fr_fr: Un autre exemple : si vous définissez une valeur texte par défaut pour un champ nombre... Ce genre de choses ;)
pt_pt: Outro exemplo: você não deve definir um valor padrão de texto para um campo de número…. Esse tipo de coisas ;)
tr_tr: Başka bir örnek: Bir sayı alanına varsayılan değer olarak bir metin atayamazsınız... gibi :)

source: Once fields have been created, you can reorder or edit them from the Fields tab of the block:
cs_cz: Jakmile jsou kolonky založené, je možné přeuspořádat jejich pořadí nebo je upravit z panelu Kolonky bloku:
fr_fr: Une fois les champs créés, vous pouvez les réorganiser ou les modifier depuis l'onglet champs du bloc :
pt_pt: Uma vez criados os campos, você pode reordená-los ou editá-los na ficha Campos do bloco:
tr_tr: Alanlar oluşturulduktan sonra bloğun Alanlar sekmesinden sıralaması değiştirilebilir ya da düzenlenebilir:

source: And see what it should look like on a `User` item for example:
cs_cz: A podívejte jak by to vypadalo například u položky `Uživatel`:
fr_fr: Et voyez ce à quoi cela ressemble sur un objet `Utilisateur` par exemple :
pt_pt: E veja como ele deve ficar em um item `User`, por exemplo:
tr_tr: Örneğin `Kullanıcı` ögesinde nasıl görüntüleneceği görülebilir:

source: Search
cs_cz: Hledat
fr_fr: Recherche
pt_pt: Pesquisar
tr_tr: Arama

source: All fields that have been added are available in the attached items search forms.
cs_cz: Všechny kolonky které byly přidány jsou dostupné ve vyhledávacích formulářích připojených položek.
fr_fr: Tous les champs qui ont été ajoutés sont disponibles dans les recherches des objets attachés.
pt_pt: Todos os campos que foram adicionados estão disponíveis nos formulários de pesquisa de itens anexados.
tr_tr: Eklenen tüm alanlar eklenmiş ögeler arama formlarından aranabilir.

source: Simplified Interface
cs_cz: Zjednodušené rozhraní
fr_fr: Interface simplifiée
pt_pt: Interface simplificado
tr_tr: Basit arayüz

source: Only blocks attached to tickets and with the type `Insertion in the form` will be displayed in the simplified interface of ticket creation. Of course, it will also take care of current profile rights!
cs_cz: Ve zjednodušeném rozhraní vytváření budou zobrazeny pouze bloky připojené k požadavkům a s typem `Vložení do formuláře`. Samozřejmě také dle oprávnění stávajícího profilu!
fr_fr: Les seuls blocs attachés à des tickets et de type `Insertion dans le formulaire` seront affichés dans l'interface simplifiée. Bien sûr, les droits du profil courant seront également pris en compte !
pt_pt: Somente os blocos anexados aos bilhetes e com o tipo ‘inserção no formulário’ serão exibidos na interface simplificada da criação de ingressos. Claro, ele também vai cuidar dos direitos de perfil atual!
tr_tr: Yalnızca destek kayıtlarına eklenmiş ve `Forma ekleme` türündeki bloklar basit destek kaydı oluşturma arayüzünde görüntülenir. Geçerli profilin izinleri dikkate alınır!

source: Translations
cs_cz: Překlady
fr_fr: Traductions
pt_pt: Traduções
tr_tr: Çeviriler

source: Plugin itself is translated using `the transifex services <https://www.transifex.com/teclib/glpi-plugin-plugin-fields>`_; but you aslo can translate the label values for blocs and fields; the process is identical on both those ones:
cs_cz: Zásuvný modul samotný je překládán prostřednictvím `služby Transifex <https://www.transifex.com/teclib/glpi-plugin-plugin-fields>`_; ale je možné překládat hodnoty štítků pro bloky a kolonky; postup je v obou případech totožný:
fr_fr: Le plugin lui même est traduit par l'intermédiaire des `services de transifex <https://www.transifex.com/teclib/glpi-plugin-plugin-fields>`_ ; mais vous pourrez également traduire les libellés des blocs et des champs ; le processus est identique pour les deux :
pt_pt: Plugin em si é traduzido usando ‘os serviços Transifex <https:https://www.transifex.com/teclib/glpi-plugin-plugin-fields>` _; mas você também pode traduzir os valores de rótulo para blocos e campos; o processo é idêntico em ambos os:
tr_tr: Eklenti Transifex <https://www.transifex.com/teclib/glpi-plugin-plugin-fields>`_; üzerinden çevrilebilir. Ayrıca blok ve alanlar için etiket değerleri de çevrilebilir. İşlem ikisi için de aynıdır:

source: On the block form, choose the *Translations* tab:
cs_cz: Ve formuláři bloku, zvolte kartu *Překlady*:
fr_fr: Sur le formulaire du bloc, choisissez l'onglet *Traductions* :
pt_pt: No formulário de bloco, escolha a guia * Translations *:
tr_tr: Blok formundaki *Çeviriler* sekmesine gidin:

source: On block creation, a new translation with current language and value set as label will be created; you can add as many translations as you want.
cs_cz: Při vytváření bloku bude vytvořen nový překlad se stávajícím jazykem a hodnotou nastavenou jako štítek; překladů je možné přidat kolik budete chtít.
fr_fr: Lors de la création d'un bloc, une nouvelle traduction dans la langue courante sera ajoutée avec le libellé renseigné sera créée ; vous pouvez ajouter autant de traductions que vous le souhaitez.
pt_pt: Na criação de blocos, será criada uma nova tradução com o idioma atual e o valor definido como rótulo; Você pode adicionar quantas traduções quiser.
tr_tr: Blok oluşturulurken geçerli dildeki yeni bir çeviri ve etiket değer kümesi oluşturulur; İstediğiniz kadar çeviri ekleyebilirsiniz.
