Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/news/index.po
Languages: tr_tr

source: Download
tr_tr: İndir

source: Sources
tr_tr: Kaynaklar

source: Requirements (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
tr_tr: GLPI sürümü

source: Minimum PHP
tr_tr: En düşük PHP sürümü

source: Recommended
tr_tr: Önerilen

source: Features
tr_tr: Özellikler

source: This plugin allows to display alerts messages on GLPI homepage and / or login page.
tr_tr: Bu eklenti, uyarı iletilerinin GLPI giriş sayfasında ve/veya oturum açma sayfasında görüntülenmesini sağlar.

source: Create alert with rich text as for notes.
tr_tr: Notlar için olduğu gibi zengin metin kullanarak uyarılar oluşturur.

source: Choice of begin/end publication date.
tr_tr: Yayınlanma başlangıç ve bitiş tarihlerini seçilebilir.

source: Manage alerts by entity.
tr_tr: Uyarılar birime göre yönetilebilir.

source: Target : display alerts by profile / group / user.
tr_tr: Hedef: Uyarılar profile / gruba / kullanıcıya göre görüntülenebilir.

source: Install the Plugin
tr_tr: Eklentiyi kurmak

source: Uncompress the archive.
tr_tr: Arşivi ayıklayın.

source: Move the ``news`` directory to the ``<GLPI_ROOT>/plugins`` directory
tr_tr: ``news`` klasörünü ``<GLPI_ROOT>/plugins`` klasörüne taşıyın

source: Navigate to the *Configuration > Plugins* page,
tr_tr: *Yapılandırma > Eklentiler* bölümüne gidin.

source: Install and activate the plugin.
tr_tr: Eklentiyi kurup etkinleştirin.

source: Usage
tr_tr: Kullanım

source: The plugin will create required tables in the database automatically. Those tables will be updated along with the plugin.
tr_tr: Bu eklenti otomatik olarak veri tabanında gerekli tabloları oluşturur. Bu tablolar eklentiyle birlikte güncellenir.

source: Plugin usage is quite simple:
tr_tr: Eklentinin kullanımı oldukça basittir:

source: configure alerts
tr_tr: Uyarıları yapılandırın

source: You will access the plugin configuration from the *Tools* > *Alerts*.
tr_tr: Eklenti yapılandırması için menüden *Araçlar* > *Uyarılar* bölümüne gidin.

source: Create alerts
tr_tr: Uyarı oluşturmak

source: Name : display as talert title
tr_tr: Ad: Görüntülenecek uyarının başlığını yazın

source: Active : is active or not
tr_tr: Etkin: Uyarının etkin olup olmadığını seçin

source: Description : content of alert
tr_tr: Açıklama: Uyarının içeriğini yazın

source: Visibility start / end : period of Visibility
tr_tr: Görüntülenme başlangıcı / bitişi: Uyarının görüntüleneceği zaman aralığını belirtin

source: Type : type of alert (General, Information, Warning, Problem)
tr_tr: Tür: Uyarının türünü belirtin (Genel, Bilgi, Uyarı, Sorun)

source: Can close alert : User can close alert ?
tr_tr: Uyarı kapatılabilsin mi: Kullanıcının uyarıyı kapatıp kapatamayacağını seçin

source: Show on login page : display or not alert on login page
tr_tr: Oturum açma sayfasında görüntülensin: Uyarının oturum açma sayfasında görüntülenip görüntülenmeyeceğini seçin

source: Show on helpdesk page : display or not alert on helpdesk page
tr_tr: Yardım masası sayfasında görüntülensin: Uyarının yardım masası sayfasında görüntülenip görüntülenmeyeceğini seçin

source: Sub-entity : display or not on sub-entity
tr_tr: Alt birim: Uyarının alt birimlerde görüntülenip görüntülenmeyeceğini seçin

source: Targets
tr_tr: Hedefler

source: You can define target by type
tr_tr: Türe göre hedef belirtebilirsiniz

source: Group : for all users of group
tr_tr: Grup: Gruptaki tüm kullanıcılar

source: Profil : for all users with profile
tr_tr: Profil: Belirli bir profildeki tüm kullanıcılar

source: User : for specifi user
tr_tr: Kullanıcı: Belirli bir kullanıcı

source: Display on login page
tr_tr: Oturum açma sayfasında görüntülensin

source: Display on helpdesk page
tr_tr: Yardım masası sayfasında görüntülensin

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/News/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/News/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
