Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/GDPR/index.po
Languages: es_ar, tr_tr

source: GDPR Tools
es_ar: Herramientas GDPR
tr_tr: GDPR Araçları

source: Requirements (on-premise)
es_ar: Requisitos (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
es_ar: Versión GLPI
tr_tr: GLPI sürümü

source: Minimum PHP
es_ar: PHP mínimo
tr_tr: En düşük PHP sürümü

source: Recommended
es_ar: Recomendado
tr_tr: Önerilen

source: Install the plugin
tr_tr: Eklentiyi kurmak

source: Go to the marketplace. Download and install the **GDPR Tools** plugin.
es_ar: Ve a la tienda. Descargue e instale el complemento **Herramientas GDPR**.
tr_tr: Mağazaya gidin. **GDPR Araçları** eklentisini indirip kurun.

source: Configure the plugin
es_ar: Configurar el complemento
tr_tr: Eklentiyi yapılandırın

source: From **Setup > General > GDPR tools**
es_ar: Desde **Configuración > General > Herramientas GDPR**
tr_tr: **Kurulum > Genel > GDPR araçları** bölümünden şunları seçebilirsiniz:

source: Cleaning up inactive users
es_ar: Limpiar usuarios inactivos
tr_tr: Etkin olmayan kullanıcıları temizlemek

source: There are two possible ways of managing inactive users:
es_ar: Hay dos formas posibles de gestionar usuarios inactivos:
tr_tr: Etkin olmayan kullanıcılar iki şekilde yönetilebilir:

source: Clearing the user’s data
es_ar: Borrar los datos del usuario
tr_tr: Kullanıcının verilerini temizlemek

source: Deleting the user
es_ar: Eliminando el usuario
tr_tr: Kullanıcıyı silmek

source: Cleaning up user data
es_ar: Limpiar datos de usuario
tr_tr: Kullanıcı verilerini temizlemek

source: When the plugin is configured in **Clean** mode, the following actions will be performed:
es_ar: Cuando el complemento esté configurado en modo **Limpiar**, se realizarán las siguientes acciones:
tr_tr: Eklenti **Temizlik** kipinde yapılandırıldığında, şu işlemler yapılır:

source: Delete all references to the user from the GLPI history
es_ar: Eliminar todas las referencias al usuario del historial GLPI
tr_tr: GLPI geçmişinden kullanıcıya ait tüm referanslar silinir

source: Delete all associated emails
es_ar: Eliminar todos los correos electrónicos asociados
tr_tr: Tüm ilgili e-postalar silinir

source: Reset all user fields and profiles
es_ar: Restablecer todos los campos y perfiles de usuario
tr_tr: Tüm kullanıcı alanları ve profiller sıfırlanır

source: Move the user to the recycle bin
es_ar: Mover al usuario a la papelera de reciclaje
tr_tr: Kullanıcı çöp kutusuna atılır

source: Delete the user
es_ar: Eliminar el usuario
tr_tr: Kullanıcı silinir

source: When the plugin is configured in “Delete” mode, the following actions will be performed:
es_ar: Cuando el complemento esté configurado en modo "Eliminar", se realizarán las siguientes acciones:
tr_tr: Eklenti **Silme** kipinde yapılandırıldığında, şu işlemler yapılır:

source: Deletion is permanent, the user cannot be recovered
es_ar: La eliminación es permanente, el usuario no se puede recuperar
tr_tr: Silme işlemi kalıcıdır ve kullanıcı geri alınamaz

source: Scope restriction
es_ar: Alcende de restricción
tr_tr: Kapsam kısıtlaması

source: The automated deletion process can be restricted to the following scopes:
es_ar: El proceso de eliminación automatizada puede restringirse a los siguientes ámbitos:
tr_tr: Otomatik silme işlemi şu kapsamlar ile sınırlanabilir:

source: All inactive users
es_ar: Todos los usuarios inactivos
tr_tr: Tüm etkin olmayan kullanıcılar

source: Inactive users with no current tickets
es_ar: Usuarios inactivos sin tickets actuales
tr_tr: Güncel destek kaydı olmayan etkin olmayan kullanıcılar

source: Inactive users without tickets
es_ar: Usuarios inactivos sin tickets
tr_tr: Hiç destek kaydı olmayan etkin olmayan kullanıcılar

source: setup
tr_tr: Kurulum

source: Automated action
es_ar: Acción automatizada
tr_tr: Otomatik işlem

source: Deletion will take place via a standard GLPI automatic action that can be configured to run as often as you like.
es_ar: La eliminación se realizará mediante una acción automática GLPI estándar que se puede configurar para que se ejecute con la frecuencia que desee.
tr_tr: Silme işlemi, istediğiniz sıklıkta çalışacak şekilde yapılandırılabilen standart bir GLPI otomatik işlemi ile yapılır.

source: Go to **Setup > Automatic actions**, and select the **cleaninactiveuser** action then configure it according to your needs.
es_ar: Vaya a **Configuración > Acciones automáticas** y seleccione la acción **limpiarusuarioinactivo** y luego configúrela según sus necesidades.
tr_tr: **Kurulum > Otomatik işlemler** bölümüne gidin ve **cleaninactiveuser** işlemini seçip istediğiniz şekilde yapılandırın.

source: automatic action
tr_tr: Otomatik işlem

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/GDRP/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/GDRP/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
