Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/order/index.po
Languages: cs_cz, tr_tr

source: Order
cs_cz: Objednávka
tr_tr: Sipariş

source: Download
tr_tr: İndir

source: Sources
tr_tr: Kaynaklar

source: Requirements (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
tr_tr: GLPI sürümü

source: Minimum PHP
tr_tr: En düşük PHP sürümü

source: Recommended
tr_tr: Önerilen

source: This plugin is available without a `GLPI Network <https://services.glpi-network.com/#offers>`_ subscription. It is also available on `GLPI Cloud <https://glpi-network.cloud>`_.
tr_tr: Bu eklenti bir `GLPI-Network <https://services.glpi-network.com/#offers>`_ aboneliği olmadan kullanılabilir. Ayrıca `GLPI Cloud <https://glpi-network.cloud/>`_ üzerinden de edinilebilir.

source: Features
cs_cz: Funkce
tr_tr: Özellikler

source: This plugin supports the following aspects of order management :
cs_cz: Tento zásuvný modul podporuje následující aspekty správy objednávek:
tr_tr: Bu eklenti, aşağıdaki sipariş yönetimi özelliklerini destekler:

source: Definition and management of a catalogue of product references
cs_cz: Definice a správa katalogu referencí na výrobky
tr_tr: Ürün referansları kataloğunun tanımlanması ve yönetimi

source: Order management (with approval workflow)
cs_cz: Správa objednávek (s procesem schvalování)
tr_tr: Sipariş yönetimi (onay iş akışı ile)

source: Budgets management
cs_cz: Správa rozpočtů
tr_tr: Bütçe yönetimi

source: Management of invoices associated with orders
cs_cz: Správa faktur spojených s objednávkami
tr_tr: Siparişlerle ilgili faturaların yönetimi

source: Install the Plugin
cs_cz: Instalace zásuvného modulu
tr_tr: Eklentiyi kurmak

source: Uncompress the archive.
cs_cz: Rozbalit archiv.
tr_tr: Arşivi ayıklayın.

source: Move the ``order`` directory to the ``<GLPI_ROOT>/plugins`` directory
tr_tr: ``order`` klasörünü ``<GLPI_ROOT>/plugins`` klasörüne taşıyın

source: Navigate to the *Configuration > Plugins* page,
cs_cz: Přejít na stránku *Nastavení > Zásuvné moduly*,
tr_tr: *Yapılandırma > Eklentiler* bölümüne gidin.

source: Install and activate the plugin.
cs_cz: Instalovat a aktivovat zásuvný modul.
tr_tr: Eklentiyi kurup etkinleştirin.

source: Configuration
cs_cz: Nastavení
tr_tr: Yapılandırma

source: You will access the plugin configuration from the *Setup* > *Plugins* > *Orders managment*.
cs_cz: Nastavení zásuvného modulu získáte přístupem z * Nastavení *> * Zásuvné moduly *> * Správa objednávek *.
tr_tr: Eklenti yapılandırması için menüden *Yapılandırma* > "Eklentiler" > *Sipariş yönetimi* bölümüne gidin.

source: When the plugin is installed and enabled, the following options are available:
cs_cz: Pokud je zásuvný modul nainstalován a zapnut jsou k dispozici následující volby:
tr_tr: Eklenti kurulup etkinleştirildiğinde, aşağıdaki seçenekler kullanılabilir:

source: Default VAT: indicates the amount of VAT that will be proposed by default in the plugin
cs_cz: Výchozí DPH: označuje výši DPH, která bude ve výchozím nastavení zásuvného modulu
tr_tr: Varsayılan KDV: Eklentide varsayılan olarak kullanılacak KDV oranı

source: Use the validation process: indicates whether the full validation circuit should be used, or whether anyone can validate applications.
cs_cz: Použít proces ověřování: označuje, zda by měl být použit celý ověřovací cyklus, nebo zda může někdo jiný validovat aplikace.
tr_tr: Doğrulama yapılsın: Tam doğrulama devresinin kullanılması gerekip gerekmediğini ya da herhangi birinin uygulamaları doğrulayıp doğrulayamadığını belirler.

source: Purchase order generation: indicates if the tab allowing the generation of a purchase order in ODT format is displayed or not.
cs_cz: Generování objednávky: Označuje, zda je nebo není zobrazena karta umožňující generování objednávky ve formátu ODT.
tr_tr: Satınalma siparişi oluşturma: Bu seçenek etkinleştirildiğinde, satınalma siparişinin ODT biçiminde oluşturulmasını sağlayan sekme görüntülenir.

source: Enable supplier quality: indicates whether the tab for judging supplier satisfaction is displayed once the order is delivered.
cs_cz: Povolit kvalitu dodavatele: označuje, zda se po doručení objednávky zobrazí karta pro posouzení spokojenosti s dodavatelem.
tr_tr: Sağlayıcı memnuniyeti ölçülsün: Bu seçenek etkinleştirildiğinde, sipariş teslim edildikten sonra sağlayıcı memnuniyetini değerlendirme sekmesi görüntülenir.

source: Display purchase order vendor information: Shows whether or not the tab for storing the reference and vendor purchase order number is displayed.
cs_cz: Zobrazit informace o dodavateli objednávky: Zobrazuje, zda se zobrazí karta pro uložení referenčního čísla a čísla objednávky dodavatele.
tr_tr: Satınalma siparişi satıcı bilgileri görüntülensin: Bu seçenek etkinleştirildiğinde, referans ve satıcı satınalma siparişi numarasının kaydedileceği sekme görüntülenir.

source: Colour when the estimated delivery date is exceeded: colour of display in the search engine of an undelivered order for which the estimated delivery date is exceeded
cs_cz: Barva při překročení předpokládaného data dodání: barva zobrazení nedoručené objednávky ve vyhledávacím nástroji, u které je překročeno datum předpokládaného doručení
tr_tr: Öngörülen teslim tarihi aşıldığında renk: Öngörülen teslim tarihi aşıldığı halde teslim edilmemiş bir siparişin arama motorunda görüntüleneceği renk

source: Copy order documents when a new item is created : Copy order documents to generated item
cs_cz: Kopírování objednávkových dokumentů při vytvoření nové položky: Kopírování objednávkových dokumentů na vygenerovanou položku
tr_tr: Yeni bir öge oluşturulduğunda sipariş belgeleri kopyalansın: Bu seçenek etkinleştirildiğinde, sipariş belgeleri oluşturulan ögeye kopyalanır

source: Default heading when adding a document to an order : define default heading
cs_cz: Výchozí záhlaví při přidávání dokumentu do objednávky: definuje výchozí záhlaví
tr_tr: Bir siparişe belge eklerken varsayılan başlık : Varsayılan başlığı belirler

source: Author group (Default values) : Define default author
cs_cz: Skupina autora (výchozí hodnoty): Definice výchozího skupiny autora
tr_tr: Yetkili grup (varsayılan değerler): Varsayılan yetkiliyi belirler

source: Recipient group (Default values) : Define defaut Recipient group
cs_cz: Skupina příjemce (výchozí hodnoty): Definice výchozí skupiny příjemce
tr_tr: Alıcı grubu (varsayılan değerler): Varsayılan alıcı grubunu belirler

source: Recipient (Default values) : Define default Recipient
cs_cz: Příjemce (výchozí hodnoty): Definice výchozího příjemce
tr_tr: Alıcı (varsayılan değerler): Varsayılan alıcıyı belirler

source: Do not display expired budgets : yes or no
cs_cz: Nezobrazovat vypršené rozpočty: ano nebo ne
tr_tr: Süresi dolan bütçeler görüntülenmesin: Evet ya da hayır

source: Transmit budget change to linked assets : yes or no
cs_cz: Přenést změnu rozpočtu na propojená aktiva: ano nebo ne
tr_tr: Bütçe değişikliği bağlantılı varlıklara iletilsin: Evet ya da hayır

source: Display account section on order form : yes or no
cs_cz: Zobrazit sekci účtu na objednávkovém formuláři: ano nebo ne
tr_tr: Sipariş formunda hesap bölümü görüntülensin: Evet ya da hayır

source: Set account section as mandatory on order form : yes or no
cs_cz: Nastavit sekci účtu jako povinnou na objednávkovém formuláři: ano nebo ne
tr_tr: Sipariş formunda hesap bölümü zorunlu olarak ayarlansın: Evet ya da hayır

source: Use free references : yes or no
cs_cz: Použít prázdné reference: ano nebo ne
tr_tr: Özgür referanslar kullanılsın: Evet ya da hayır

source: Rename documents added in order :yes or no
cs_cz: Přejmenovat přidané dokumenty v objednávce: ano nebo ne
tr_tr: Eklenen belgeler sırayla yeniden adlandırılsın: Evet ya da hayır

source: Automatic actions when delivery Item
cs_cz: Automatické akce při doručení položky
tr_tr: Öge teslim edilirken otomatik işlemler

source: Generation does not apply to contracts, cartridges and consumables. In order to activate this feature, change the option Activate automatic generation to yes and validate. During the generation, the material will be created with some randomly generated information:
cs_cz: Generování se nevztahuje na smlouvy, kazety a spotřební materiál. Chcete-li tuto funkci aktivovat, změňte možnost Aktivovat automatické generování na Ano a potvrďte. Během generování bude materiál vytvořen s náhodně vygenerovanými informacemi:
tr_tr: Oluşturma, sözleşmeler, kartuşlar ve sarf malzemeleri için geçerli değildir. Bu özelliği etkinleştirmek için Otomatik oluşturulsun seçeneğini evet olarak değiştirin ve doğrulayın. Oluşturma sırasında, materyal bazı rastgele bilgilerle doldurulur:

source: Default name
cs_cz: Výchozí název
tr_tr: Varsayılan ad

source: Default Serial Number
cs_cz: Výchozí sériové číslo
tr_tr: Varsayılan seri numarası

source: Default inventory number
cs_cz: Výchozí inventární číslo
tr_tr: Varsayılan stok numarası

source: If a template is associated with the part number, and in this template the name and serial number are generated, then the settings defined above for these 2 fields do not apply.
cs_cz: Pokud je šablona přiřazena s číslem dílu a v této šabloně je generováno jméno a sériové číslo, pak se výše uvedená nastavení pro tato 2 pole nepoužijí.
tr_tr: Parça numarası ile bir kalıp ilişkilendirilirse ve bu kalıpta ad ve seri numarası oluşturulursa, bu iki alan için yukarıda belirtilen ayarlar geçerli olmaz.

source: The default status will be set when the material is created. The positioning of the status during the creation of the material can lead to a date filling of the financial information. See the Entity Inventory tab.
cs_cz: Výchozí stav bude nastaven při vytvoření materiálu. Pozice stavu během vytváření materiálu může vést k datovému vyplnění finančních informací. Viz karta Inventář entit.
tr_tr: Malzeme oluşturulduğunda varsayılan durum ayarlanır. Materyalin oluşturulması sırasında durumun konumlandırılması, mali bilgilerde bir tarih doldurulmasına yol açabilir. Birim envanteri sekmesine bakın.

source: Order lifecycle
cs_cz: Životní cyklus objednávky
tr_tr: Sipariş yaşam döngüsü

source: You can define your own status for order lifecycle
cs_cz: Pro životní cyklus objednávky můžete definovat svůj vlastní stav
tr_tr: Sipariş yaşam döngüsü için kendi durumunuzu tanımlayabilirsiniz

source: Creation of a reference catalogue
cs_cz: Vytvoření referenčního katalogu
tr_tr: Referans kataloğunu oluşturmak

source: You will access the reference catalogue from the *Management* > *Orders* > *Products references*.
cs_cz: K formuláři pro vytvoření katalogu referencí se dostanete z * Správa *> * Objednávky *> * Produktové reference *.
tr_tr: Referans kataloğuna *Yönetim* > *Siparişler* > *Ürün referansları* bölümünden erişebilirsiniz.

source: The creation of product references is the prerequisite for order management. Any product to be ordered must be referenced in the plugin catalog. When creating a product reference, the following fields must be filled in:
cs_cz: Vytvoření referencí na produkt je předpokladem pro správu objednávek. Na jakýkoli produkt, který má být objednán, musí být uveden odkaz v katalogu zásuvného modulu. Při vytváření odkazu na produkt je třeba vyplnit následující pole:
tr_tr: Ürün referanslarının oluşturulması, sipariş yönetimi için ön koşuldur. Sipariş edilecek herhangi bir ürüne eklenti kataloğunda başvurulmalıdır. Ürün başvurusu oluştururken aşağıdaki alanlar doldurulmalıdır:

source: Sub-entities: indicates if the reference will be visible in the current entity only or in the sub-entities as well.
cs_cz: Podřízené entity: označuje, zda bude odkaz viditelný pouze v aktuální entitě nebo také v podřízených entitách.
tr_tr: Alt birimler: Referansın yalnızca var olan birimde mi yoksa alt birimlerde de mi görüntülenip görüntülenmeyeceğini belirtir.

source: Name: name of the reference, as it will be displayed when managing an order (required)
cs_cz: Název: název reference, jak bude zobrazen při správě objednávky (povinné)
tr_tr: Ad: Bir sipariş yönetilirken görüntülenecek referansın adı (zorunlu)

source: Manufacturer: the manufacturer of the product (not the supplier)
cs_cz: Výrobce: výrobce produktu (ne dodavatel)
tr_tr: Üretici: Ürünün üreticisi (sağlayıcı değil)

source: Type of equipment: indicates what type of equipment we are dealing with
cs_cz: Typ zařízení: označuje, jaký typ zařízení bude dodán
tr_tr: Aygıt türü: Ne tür bir aygıtla uğraştığımızı belirtir

source: Type: the type of the product
cs_cz: Typ: typ produktu
tr_tr: Tür: Ürünün türü

source: Model: the model of the product
cs_cz: Model: model produktu
tr_tr: Model: Ürünün modeli

source: Template: the GLPI template of the product if one already exists.
cs_cz: Šablona: šablona GLPI produktu, pokud již existuje.
tr_tr: Kalıp: Zaten varsa ürünün GLPI kalıbı.

source: comments: additional information on the reference
cs_cz: komentáře: další informace o referenci
tr_tr: Açıklamalar: Referans hakkında ek bilgiler

source: Once the reference is created, it is then necessary to indicate from which supplier(s) the product is available, as well as the price associated with it.
cs_cz: Jakmile je reference vytvořena, je nutné uvést, od kterého dodavatele (dodavatelů) je produkt k dispozici, a cenu s ním spojenou.
tr_tr: Referans oluşturulduktan sonra, ürünün temin edildiği sağlayıcıların ve bununla ilişkili fiyatın belirtilmesi gerekir.

source: It is also possible to :
cs_cz: Je také možné:
tr_tr: Şunlar da yapılabilir:

source: Add related documents
cs_cz: Přidat související dokumenty
tr_tr: İlişkili belgeler eklenebilir

source: View history
cs_cz: Zobrazit historii
tr_tr: Geçmiş görüntülenebilir

source: Creating an order
cs_cz: Vytvoření objednávky
tr_tr: Bir sipariş oluşturulabilir

source: You will access orders from the *Management* > *Orders* > *Orders*.
cs_cz: Přístup k objednávkám je z "Správa" > "Objednávky" > "Objednávky".
tr_tr: Siparişlere *Yönetim* > *Siparişler* > *Siparişler* bölümünden erişebilirsiniz.

source: Once the reference catalogue has been created, it is now possible to add material orders. The fields to be filled in are :
cs_cz: Po vytvoření referenčního katalogu je nyní možné přidat materiálové objednávky. Pole, která je třeba vyplnit, jsou:
tr_tr: Referans kataloğu oluşturulduktan sonra malzeme siparişleri eklenebilir. Doldurulması gereken alanlar şunlardır:

source: Sub-entities: indicates if the order is visible in the sub-entities
cs_cz: Podřízené entity: označuje, zda je objednávka viditelná v podřízených entitách
tr_tr: Alt birimler: Siparişin alt birimlerde görüntülenip görüntülenmeyeceğini belirler

source: Order name
cs_cz: Název objednávky
tr_tr: Sipariş adı

source: Order number (required)
cs_cz: Číslo objednávky (povinné)
tr_tr: Sipariş numarası (zorunlu)

source: Date of order (required)
cs_cz: Datum objednávky (povinné)
tr_tr: Sipariş tarihi (zorunlu)

source: Budget: The budget to which the purchase order is posted.
cs_cz: Rozpočet: Rozpočet, do kterého je objednávka zaúčtována.
tr_tr: Bütçe: Satınalma siparişinin kaydedildiği bütçe.

source: Vendor purchase order number: Indicates the internal number for the purchase order at the vendor.
cs_cz: Číslo objednávky dodavatele: Uvádí interní číslo objednávky u dodavatele.
tr_tr: Satıcı satınalma sipariş numarası: Satıcı tarafındaki satınalma siparişinin numarası.

source: Payment terms: free field (can contain for example 30 days end of month, 60 days end of month, etc)
cs_cz: Platební podmínky: volné pole (může obsahovat například 30 dní na konci měsíce, 60 dní na konci měsíce atd.)
tr_tr: Ödeme koşulları: Serbest alan (ay sonu 30 gün, ay sonu 60 gün gibi bilgiler)

source: Billing number
cs_cz: Číslo faktury
tr_tr: Fatura numarası

source: Supplier: the supplier with whom the order is placed. Only the catalogue references from this supplier may be added to the order.
cs_cz: Dodavatel: dodavatel, u kterého je objednávka zadána. K objednávce lze přidat pouze katalogové reference od tohoto dodavatele.
tr_tr: Sağlayıcı: Siparişin verildiği sağlayıcı. Yalnızca bu sağlayıcının katalog referansları siparişe eklenebilir.

source: Place of delivery of the order: indicates the place where the equipment will be delivered. This option has value only in the entity in which the order is created.
cs_cz: Místo dodání objednávky: označuje místo, kam bude zařízení dodáno. Tato volba má hodnoty pouze z entity, ve které je objednávka vytvořena.
tr_tr: Siparişin teslim yeri: Aygıtın teslim edileceği yeri belirtir. Bu seçeneğin yalnızca siparişin oluşturulduğu birimde değeri vardır.

source: Description: description of the order
cs_cz: Popis: popis objednávky
tr_tr: Açıklama: Siparişin açıklaması

source: Status: Indicates the current status of the purchase order in the release run.
cs_cz: Stav: Označuje aktuální stav objednávky v době vytvoření.
tr_tr: Durum: Yayın çalıştırmasındaki satınalma siparişinin güncel durumunu görüntüler.

source: Estimated delivery date: indicates the indicative date by which the supplier must deliver the order.
cs_cz: Předpokládané datum dodání: označuje orientační datum, do kterého musí dodavatel dodat objednávku.
tr_tr: Öngörülen teslimat tarihi: Sağlayıcının siparişi teslim etmesi öngörülen tarihi belirtir.

source: Define author and recipient
cs_cz: Definice autora a příjemce
tr_tr: Yetkili ve alıcıyı belirtin

source: Adding articles
cs_cz: Přidání zboží
tr_tr: Ürünleri eklemek

source: In the Details tab, it is now possible to add products to the order.
cs_cz: Na kartě Podrobnosti je nyní možné do objednávky přidat produkty.
tr_tr: Şimdi ayrıntılar sekmesinden siparişe ürünler eklenebilir.

source: Select the type of material to add to the order
cs_cz: Vyberte typ materiálu, který chcete přidat do objednávky
tr_tr: Siparişe eklenecek malzeme türünü seçin

source: Select product number
cs_cz: Vyberte číslo produktu
tr_tr: Ürün numarasını seçin

source: Indicate the quantity to order
cs_cz: Uveďte množství na objednávku
tr_tr: Sipariş edilecek miktarı belirtin

source: Change the unit price if it is not the price indicated in the product reference.
cs_cz: Pokud to není uvedená cena v referenci na produkt, změňte jednotkovou cenu.
tr_tr: Ürün referansında belirtilen fiyat geçerli değilse birim fiyatını değiştirin.

source: Indicate the percentage discount on products
cs_cz: Uveďte procentuální slevu na produkty
tr_tr: Ürünlerin indirim yüzdesini belirtin

source: You can then validate the addition of these products to the order.
cs_cz: Poté můžete ověřit přidání těchto produktů k objednávce.
tr_tr: Şimdi bu ürünlerin siparişe eklenmesini doğrulayabilirsiniz.

source: Note: it is possible to modify the price and the discount of a set of materials when the order is being edited. To do this, simply double-click on one of these 2 fields, modify its value and then validate the change.
cs_cz: Poznámka: Při editaci objednávky je možné upravit cenu a slevu sady materiálů. Chcete-li to provést, jednoduše poklepejte na jedno z těchto 2 polí, upravte jeho hodnotu a poté změnu potvrďte.
tr_tr: Not: Sipariş düzenlenirken bir takım malzemelerin fiyatını ve indirimini değiştirebilirsiniz. Bunu yapmak için, bu iki alandan birine çift tıklayın, değerini değiştirin ve değişikliği doğrulayın.

source: Validation workflow
cs_cz: Proces ověření
tr_tr: Doğrulama iş akışı

source: The plugin has a validation workflow that works as follows:
cs_cz: Zásuvný modul má proces ověření, který funguje takto:
tr_tr: Eklentinin doğrulama iş akışı şu şekildedir:

source: Creating the order: status In progress
cs_cz: Vytvoření objednávky: status Probíhá
tr_tr: Sipariş oluşturma: Sipariş işleniyor durumundadır

source: Request for order release: status Pending approval
cs_cz: Žádost o uvolnění objednávky: stav Čeká na schválení
tr_tr: Sipariş onayı isteği: Sipariş onay bekleniyor durumundadır

source: Order confirmed: the order then goes to the status In process of delivery.
cs_cz: Objednávka potvrzena: objednávka pak přejde do stavu Probíhá doručení.
tr_tr: Sipariş onaylandı: Sipariş teslimat sürecinde durumuna geçer.

source: Order completely received: automatic switch to Delivered status
cs_cz: Objednávka zcela přijata: automatický přepínač do stavu Doručeno
tr_tr: Sipariş tamamen alındı: Sipariş otomatik olarak teslim edildi durumuna geçer

source: Cancelled purchase order: Change to status Cancelled
cs_cz: Zrušená objednávka: Změna stavu na Zrušeno
tr_tr: Satınalma siparişi iptal edildi: Sipariş İptal edildi durumuna geçer

source: The definition of the persons having the right to make a validation request, to validate or to cancel an order is done in the edition of the profiles.
cs_cz: Definice osob, které mají právo podat žádost o ověření, potvrdit nebo zrušit objednávku, se provádí v editaci profilů.
tr_tr: Onay isteğinde bulunma, siparişi onaylama ya da iptal etme yetkisi olan kişilerin tanımı profil düzenlemesi ile yapılır.

source: Receiving the order
cs_cz: Přijímání objednávky
tr_tr: Sipariş alımı

source: Once the order has been confirmed, the equipment can begin to be received. To do this, you must go to the Receiving Equipment(s) tab. Each product is identified by a line with the following information:
cs_cz: Jakmile je objednávka potvrzena, zařízení může začít být přebíráno. Chcete-li to provést, musíte přejít na kartu Převzetí položky (položek) objednávky. Každý produkt je označen řádkem s následujícími informacemi:
tr_tr: Sipariş onaylandıktan sonra, aygıtı teslim alma işlemine başlanabilir. Bunun için, Aygıtları alma sekmesine gitmelisiniz. Her ürün, şu bilgileri içeren bir satırla tanımlanır:

source: Product reference
cs_cz: Produktové reference
tr_tr: Ürün referansı

source: Number of equipment(s) received
cs_cz: Počet přijatých položek(y)
tr_tr: Alınan aygıt sayısı

source: Number of material(s) related to inventory items in GLPI
cs_cz: Počet materiálu(ů) souvisejících s položkami inventáře v GLPI
tr_tr: GLPI envanter ögeleri ile ilgili malzeme sayısı

source: Unit price of the product (excl. VAT)
cs_cz: Cena za jednotku (bez DPH)
tr_tr: Ürünün birim fiyatı (KDV hariç)

source: Unit price of the product (incl. VAT)
cs_cz: Cena za jednotku (s DPH)
tr_tr: Ürünün birim fiyatı (KDV dahil)

source: Price per unit awarded (excl. VAT)
cs_cz: Cena za přidělenou jednotku (bez DPH)
tr_tr: Ödenen birim fiyatı (KDV hariç)

source: By clicking on the *+* icon on the left of the line, it is possible to access the details of the products ordered.
cs_cz: Kliknutím na ikonu * + * vlevo od řádku získáte přístup k podrobnostem o objednaných produktech.
tr_tr: Satırın solundaki *+* simgesine tıklayarak sipariş edilen ürünlerin ayrıntılarına erişilebilir.

source: Receiving material
cs_cz: Příjem materiálu
tr_tr: Malzeme alımı

source: It is possible to receive the material that has been ordered, from the moment the order is validated. You have to go to the tab Reception of material(s). One line is displayed for each product reference ordered. This line contains the following information:
cs_cz: Je možné přijmout objednaný materiál od okamžiku, kdy je objednávka potvrzena. Musíte přejít na kartu Přijímání materiálu(ů). Pro každý objednaný odkaz na produkt se zobrazí jeden řádek. Tento řádek obsahuje následující informace:
tr_tr: Sipariş onaylandığı andan itibaren sipariş edilen malzeme teslim alınabilir. Malzeme alımı sekmesine gitmeniz gerekir. Sipariş edilen her ürün referansı için bir satır görüntülenir. Bu satırda şu bilgiler bulunur:

source: Received equipment(s): indicates the number of equipment received out of the total number of equipment ordered for this product.
cs_cz: Přijatá položka(y): označuje počet přijatých položek z celkového počtu položek objednaných pro tento produkt.
tr_tr: Alınan aygıtlar: Bu ürün için sipariş edilen toplam aygıt sayısından alınan aygıt sayısını gösterir.
