Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/order/index.po
Languages: cs_cz, tr_tr

source: Related equipment(s): number of goods received related to inventory items in GLPI
cs_cz: Související položky(a): počet přijatého zboží související s položkami inventáře v GLPI
tr_tr: İlgili aygıtlar: GLPI üzerindeki envanter ögeleriyle ilgili alınan mal sayısı

source: Price per unit (excl. VAT)
cs_cz: Cena za jednotku (bez DPH)
tr_tr: Birim fiyatı (KDV hariç)

source: Unit price (incl. VAT)
cs_cz: Cena jednotky (s DPH)
tr_tr: Birim fiyatı (KDV dahil)

source: In order to proceed to the reception of products, just click on the + icon on the left of the line.
cs_cz: Chcete-li pokračovat v přijímání produktů, stačí kliknout na ikonu + v levé části řádku.
tr_tr: Ürün alımına devam etmek için satırın solundaki + simgesine tıklayın.

source: There are 2 ways to receive material :
cs_cz: Existují 2 způsoby, jak přijímat materiál:
tr_tr: Malzeme almanın 2 yolu vardır:

source: Reception of materials selected from the list of products ordered but not yet received
cs_cz: Příjem materiálů vybraných ze seznamu objednaných produktů, ale dosud neobdržených
tr_tr: Sipariş edilen ancak henüz teslim alınmayan ürünler listesinden seçilen malzemelerin alınması

source: Receipt of materials in bulk: in this case we will indicate how many products are received (without first selecting from the list).
cs_cz: Příjem materiálu hromadně: v tomto případě uvedeme, kolik produktů bylo přijato (bez předchozího výběru ze seznamu).
tr_tr: Malzemelerin toplu olarak alınması: Bu durumda kaç adet ürün teslim alındığı belirtilir (önce listeden seçim yapmadan).

source: In both cases, it is necessary to return the delivery note associated with the reception of the material. Alternatively, a status of the received objects can be indicated (e.g. Conforming, Non-conforming, etc). Once received, it is possible to :
cs_cz: V obou případech je nutné vrátit dodací list spojený s příjmem materiálu. Alternativně může být indikován stav přijatých objektů (např. Shoda, nevyhovující atd.). Po přijetí je možné:
tr_tr: Her iki durumda da, malzemenin teslim alınmasıyla ilgili sevk irsaliyesinin iade edilmesi gerekir. Alternatif olarak, alınan nesnelerin durumu belirtilebilir uygun, uygun değil gibi). Alındıktan sonra şunlar yapılabilir:

source: Generate a material in GLPI from the received product
cs_cz: Vytvořie položku v GLPI z přijatého produktu
tr_tr: Alınan üründen GLPI üzerinde bir malzeme oluşturulabilir

source: Link the product received to existing GLPI equipment
cs_cz: Propojit obdržený produkt se stávajícím položkou GLPI
tr_tr: Alınan ürün var olan bir GLPI aygıtına bağlanabilir

source: Generate the material
cs_cz: Generovat položku
tr_tr: Malzeme üretme

source: In order to generate materials from received products, simply select from the list those for which this operation is to be performed. Then select the Generate associated material option. A screen will appear. Each line represents a received product, and the following information must be given:
cs_cz: Chcete-li generovat materiály z přijatých produktů, jednoduše vyberte ze seznamu ty, pro které má být tato operace provedena. Poté vyberte možnost Generovat související materiál. Objeví se obrazovka. Každý řádek představuje přijatý produkt a musí být uvedeny následující informace:
tr_tr: Alınan ürünlerden malzeme üretmek için listeden bu işlemin yapılacağı ürünlerin seçilmesi yeterlidir. Ardından ilişkili malzeme oluştur seçeneğini seçin. Görüntülenen sayfada her satır alınan bir ürünü gösterir ve şu bilgiler verilmelidir:

source: Name of the material generated in GLPI
cs_cz: Název generované položky v GLPI
tr_tr: GLPI üzerinde üretilen malzemenin adı

source: Serial code
cs_cz: Sériové číslo
tr_tr: Seri numarası

source: Asset number
cs_cz: Číslo aktiva
tr_tr: Varlık numarası

source: Note:
cs_cz: Poznámka:
tr_tr: Not:

source: If there is a template associated with the reference of the generated product, and if the latter is created in the same entity as the reference, then the inventory object in GLPI will be created from this template.
cs_cz: Pokud je k referenci vygenerovaného produktu přiřazena šablona a pokud je produkt vytvořen ve stejné entitě jako reference, bude z této šablony vytvořen objekt inventáře v GLPI.
tr_tr: Oluşturulan ürünün referansıyla ilişkili bir kalıp varsa ve ikincisi referans ile aynı birimde oluşturulmuşsa, GLPI üzerindeki envanter varlığı bu kalıptan oluşturulur.

source: The financial information of the order will be carried in the newly created inventory object.
cs_cz: Finanční informace objednávky budou přeneseny do nově vytvořeného objektu inventáře.
tr_tr: Siparişin mali bilgileri, yeni oluşturulan stok nesnesinde bulunur.

source: Link to an inventory item
cs_cz: Odkaz na položku inventáře
tr_tr: Bir envanter ögesine bağlamak

source: It is possible not to generate a received product, but to link it to material already present in GLPI. To do this, you must select the option Link to an existing material. A drop-down list will appear and will present all the materials present in GLPI which :
cs_cz: Není možné generovat přijatý produkt, ale spojit jej s materiálem již přítomným v GLPI. Chcete-li to provést, musíte vybrat možnost Odkaz na existující materiál. Objeví se rozevírací seznam a představí všechny materiály přítomné v GLPI, které:
tr_tr: Alınan bir ürün üretilmek yerine, GLPI üzerinde zaten var olan bir malzemeye bağlanabilir. Bunun için, var olan bir malzemeye bağla seçeneğini seçin. Bir açılan kuruda GLPI üzerinde bulunan tüm malzemeler şuna göre görüntülenir:

source: Are in the entity of the order (or in a sub-entity if the order is visible in the sub-entities)
cs_cz: Jsou v entitě objednávky (nebo v podřízené, pokud je objednávka viditelná v podřízených entitách)
tr_tr: Siparişin birimindeyse (ya da sipariş alt birimlere görüntüleniyorsa bir alt birimdeyse)

source: With the same type of equipment
cs_cz: Se stejným typem položek
tr_tr: Aynı aygıt türündeyse

source: Identical
cs_cz: Identický
tr_tr: Aynıysa

source: Once linked to a product, the material in GLPI will receive the financial information from the order.
cs_cz: Po propojení s produktem obdrží materiál v GLPI finanční informace z objednávky.
tr_tr: Bir ürüne bağlandıktan sonra, GLPI üzerindeki malzeme siparişten mali bilgileri alır.

source: Rights management
cs_cz: Správa oprávnění
tr_tr: İzin yönetimi

source: The plugin rights management allows to define, by profile, if the user has the right to :
cs_cz: Správa oprávnění zásuvného modulu umožňuje definovat oprávnění podle profilu, pokud má uživatel právo:
tr_tr: Eklenti izin yönetimi, kullanıcının profilinden aşağıdaki izinleri tanımlamayı sağlar:

source: Manage commands
cs_cz: Spravovat příkazy
tr_tr: Komut yönetimi

source: Manage product references
cs_cz: Spravovat produktové reference
tr_tr: Ürün referansları yönetimi

source: Manage invoices
cs_cz: Spravovat faktury
tr_tr: Fatura yönetimi

source: Confirm an order
cs_cz: Potvrdit objednávku
tr_tr: Sipariş onayı

source: Cancel an order
cs_cz: Zrušit objednávku
tr_tr: Sipariş iptali

source: Modify a validated order
cs_cz: Upravit ověřenou objednávku
tr_tr: Onaylanmış sipariş değişikliği

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/Order/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/Order/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
