Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/webhook/mattermost.po
Languages: tr_tr

source: From a Mattermost administrator account, go to the menu at the top left,
tr_tr: Bir Mattermost yönetici hesabından, sol üst taraftaki menüye gidin,

source: Then Integrations
tr_tr: Bütünleştirmeler üzerine tıklayın

source: integrations
tr_tr: Bütünleştirmeler

source: Select **Incoming Webhooks**
tr_tr: **Gelen internet kancaları** üzerine tıklayın

source: Then **Add a new incoming webhook**.
tr_tr: **Yeni gelen internet kancası ekle** üzerine tıklayın.

source: incoming webhooks
tr_tr: Gelen internet kancaları

source: add new webhook
tr_tr: Yeni internet kancası ekleyin

source: Fill in the necessary fields and select the channel that will receive the notifications
tr_tr: Gerekli alanları doldurun ve bildirimleri alacak kanalı seçin

source: Then click on **Save**.
tr_tr: Ardından **Kaydet** üzerine tıklayın

source: complete webhook
tr_tr: İnternet kancasını tamamlayın

source: You will then be sent the link to your Webhook:
tr_tr: Ardından internet kancanıza giden bağlantı size gönderilir:

source: URL incoming webhook
tr_tr: Gelen internet kancası adresi

source: Creative Commons License
tr_tr: Creative Commons Lisansı
