Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/webhook/setup_glpi.po
Languages: tr_tr

source: Set up the webhook in GLPI
tr_tr: GLPI üzerinde internet kancasını ayarlayın

source: Fill in the requested information and select the channel on which you want the notifications to be sent.
tr_tr: İstenilen bilgileri doldurun ve bildirimlerin gönderilmesini istediğiniz kanalı seçin.

source: Once registered, a link will be sent to you. Copy this link and transfer it to **Setup > Notifications > Configuration of notifications by webhooks**
tr_tr: Hesap açtıktan sonra size bir bağlantı gönderilir. Bu bağlantıyı kopyalayın ve **Kurulum > Bildirimler > İnternet kancaları ile bildirimlerin yapılandırılması** bölümüne aktarın

source: Click on + and enter :
tr_tr: + üzerine tıklayın ve şunları yazın:

source: Webhook name,
tr_tr: İnternet kancasının adı

source: the type,
tr_tr: Türü

source: the URL.
tr_tr: Adresi

source: setup GLPI
tr_tr: GLPI kurulumu

source: Click on **Add**
tr_tr: **Ekle** üzerine tıklayın

source: For Telegram, you will need to re-enter the webhook and add the **chat_id** you selected earlier
tr_tr: Telegram için internet kancasına yeniden girmeniz ve daha önce seçtiğiniz **chat_id** değerini eklemeniz gerekir

source: paste chat_ID
tr_tr: chat_ID değerini yapıştırın

source: You can test how it works by selecting your webhook and clicking on **Send notification**
tr_tr: İnternet kancanızı seçip **Bildirim gönder** üzerine tıklayarak nasıl çalıştığını sınayabilirsiniz

source: test your webhook
tr_tr: İnternet kancanızı sınayın

source: Recipients
tr_tr: Alıcılar

source: You now need to determine which notifications will be affected by the sending of a Webhook and assign them a template.
tr_tr: Artık bir internet kancası gönderildiğinde hangi bildirimlerin etkileneceğini belirlemeniz ve bunlara bir kalıp atamanız gerekiyor.

source: Go to **Setup > Notifications > Notifications**
tr_tr: **Kurulum > Bildirimler > Bildirimler** bölümüne gidin

source: Select the 1st notification concerned by Webhooks (here **New ticket**)
tr_tr: İnternet kancaları tarafından etkilenecek ilk bildirimi seçin (burada **Yeni destek kaydı**)

source: In the **Recipients** tab, add your Webhook then **Update**.
tr_tr: **Alıcılar** sekmesinden internet kancanızı ekleyin ve ardından **Güncelle** üzerine tıklayın.

source: setup recipients
tr_tr: Alıcıları ayarlayın

source: Templates
tr_tr: Kalıplar

source: In the tab **Templates** click **Add a template**
tr_tr: **Kalıplar** sekmesinden **Kalıp ekle** üzerine tıklayın

source: Choose **Webook** in the **Notification method** and **New** in the **Notification template**
tr_tr: **Bildirim yöntemi** olarak **İnternet kancası** ve **Bildirim kalıbı** olarak **Yeni** seçin

source: Your Webhook is ready to use. You can customise the template by clicking on **New** so that it matches your requirements.
tr_tr: İnternet kancanız kullanılmaya hazır. Kalıbı gereksinimlerinize uygun olarak **Yeni** üzerine tıklayarak özelleştirebilirsiniz.

source: custom notification
tr_tr: Özel bildirim

source: Creative Commons License
tr_tr: Creative Commons Lisansı
