Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/webhook/teams.po
Languages: tr_tr

source: Following the end of O365 connectors, Microsoft is imposing a new method of setting up your webhooks using workflows. This procedure must be implemented before August 15th. After this date, your webhooks will no longer function. Your webhooks used by incoming Webhooks (old method) will no longer be available
tr_tr: O365 bağlayıcılarının sona ermesinin ardından Microsoft, iş akışlarını kullanarak internet kancalarınızın kurulması için yeni bir yöntem kullanılmasını istiyor. Bu prosedür 15 Ağustos tarihinden önce uygulanmalıdır. Bu tarihten sonra, internet kancalarınız çalışmayacaktır. Gelen internet kancaları (eski yöntem) tarafından kullanılan internet kancalarınız artık kullanılamayacak

source: The channel used must be public. Microsoft does not currently allow webhooks with Workflows from a private channel.
tr_tr: Herkese açık kanalı kullanılmalıdır. Microsoft şu anda özel bir kanal kullanan iş akışları olan internet kancalarına izin vermiyor.

source: From **Teams**, go to **Apps**
tr_tr: **Teams** altından **Apps** bölümüne gidin

source: In the search box, enter **Workflows**
tr_tr: Arama alanına **Workflows** yazın

source: In the list of applications, click on **Add**
tr_tr: Uygulama listesinde **Add** üzerine tıklayın

source: copy URL
tr_tr: Adresi kopyalayın

source: Some information may take a while to appear, so please be patient between each step and wait for the information to appear on the screen before moving on to the next step.
tr_tr: Bazı bilgilerin görüntülenmesi biraz zaman alabilir. Bu nedenle lütfen adımlar arasında sabırla bekleyin ve bir sonraki adıma geçmeden önce bilgilerin ekranda görüntülenmesini bekleyin.

source: From the desired Teams channel, click on the **···** menu
tr_tr: İstenilen Teams kanalından **···** menüsüne tıklayın

source: Click on **Workflows**
tr_tr: **Workflows** üzerine tıklayın

source: Choose "**Post to a channel when a webhook request is received**"
tr_tr: "**Post to a channel when a webhook request is received**" olarak seçin

source: In the new window, make sure that the current account has a sufficient licence to send webhooks
tr_tr: Yeni pencerede, geçerli hesabın internet kancaları gönderebilecek bir lisansı olduğundan emin olun

source: Teams will give you a summary of the selected channel. If you've got it right, click on Add Workflows
tr_tr: Teams size seçilen kanalın bir özetini verecektir. Doğru yaptıysanız, iş Add Workflows üzerine tıklayın

source: The URL of your workflow appears. Copy it and keep it, it will be used to configure GLPI.
tr_tr: İş akışınızın adresi görüntülenir. Bunu kopyalayıp saklayın, GLPI yapılandırmasında kullanılacak.

source: Go to :doc:`setup the webhook in GLPI <setup_glpi>`
tr_tr: :doc:`GLPI içinde internet kancası kurmak <setup_glpi>` bölümüne bakın

source: Creative Commons License
tr_tr: Creative Commons Lisansı
