Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/webhook/telegram.po
Languages: pt_br, tr_tr

source: From Telegram, start a new chat with the bot **@BotFather** and run the following command **/newbot**
pt_br: No Telegram, abra um novo chat com o bot @BotFather e execute o seguinte comando /newbot
tr_tr: Telegram üzerinde **@BotFather** botuyla yeni bir sohbet başlatın ve şu komutu çalıştırın **/newbot**<br>

source: Answer the few questions you will be asked to set up your bot
pt_br: Preencha as informações solicitadas para criar o seu bot.
tr_tr: Botunuzu kurmak için sorulacak birkaç soruyu yanıtlayın

source: Once finished, a token will be sent to you:
pt_br: Após a conclusão, um token será enviado para você:
tr_tr: İşleminiz tamamlandığında size bir kod gönderilir:

source: token HTTP API
tr_tr: HTTP API kodu

source: If you have already created a dedicated channel to receive GLPI notifications, add your bot to it.
pt_br: Se você já criou um canal dedicado para receber notificações do GLPI, adicione seu bot a ele.
tr_tr: GLPI bildirimlerini almak için özel bir kanal oluşturduysanız, botunuzu bu kanala ekleyin.

source: Otherwise, create your own channel
pt_br: Caso contrário, crie seu próprio canal.
tr_tr: Bir özel kanal yoksa kendi kanalınızı oluşturun

source: add the newly created bot
pt_br: Adicione o bot que você acabou de criar:
tr_tr: Yeni oluşturulan botu ekleyin

source: Send a message in the channel created to initiate a conversation and generate the various IDs we will need.
pt_br: Envie uma mensagem no canal criado para iniciar uma conversa e gerar os IDs necessários.
tr_tr: Yazışmayı başlatmak için oluşturulan kanala bir ileti gönderin ve gerek duyacağımız çeşitli kimlikleri oluşturun.

source: From your browser, enter the following URL:
pt_br: Do navegador, acesse a seguinte URL:
tr_tr: Tarayıcınızda şu adresi yazın:

source: Replace *mytoken* with the value of the token generated above
pt_br: Substitua "mytoken" pelo valor do token gerado acima
tr_tr: *mytoken* yerine yukarıda oluşturulan kod değerini yazın

source: Telegram bot URLs take the form **https://api.telegram.org/bot{mytoken}**
pt_br: As URLs de bots do Telegram seguem o formato **https://api.telegram.org/bot{mytoken}**
tr_tr: Telegram bot adresleri şu biçimdedir: **https://api.telegram.org/bot{mytoken}**

source: You should see a similar result:
pt_br: Você deverá ver um resultado similar.
tr_tr: Benzer bir sonuç görmelisiniz:

source: In the **my_chat_member** copy the **ID** value of the **chat**.
pt_br: Em **my_chat_member**, copie o valor do campo **ID** do **chat**.
tr_tr: **My_chat_member** üzerinde **chat** için **ID** değerini kopyalayın.

source: The negative sign **-** must also be copied
pt_br: O sinal negativo **-** também deve ser copiado.
tr_tr: Negatif simgesi de **-** kopyalanmalıdır

source: Go to :doc:`setup the webhook in GLPI <setup_glpi>`
tr_tr: :doc:`GLPI içinde internet kancası kurmak <setup_glpi>` bölümüne bakın

source: Creative Commons License
pt_br: Licença Creative Commons
tr_tr: Creative Commons Lisansı
