Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/oauthsso/entra.po
Languages: tr_tr

source: Register your application in Entra
tr_tr: Uygulamanızı Entra üzerine kaydedin

source: First, register your application with your Entra Active Directory (Entra AD) client. This will provide you with an application ID for your application and allow it to receive tokens.
tr_tr: Öncelikle uygulamanızı Entra Active Directory (Entra AD) istemcinize kaydedin. Bu işlem, uygulamanız için bir uygulama kimliği sağlar ve kodlar almasını sağlar.

source: Connect to the `Entra portal <https://entra.microsoft.com/#home>`_
tr_tr: `Entra portal <https://entra.microsoft.com/#home>`_ sayfasını açın

source: Choose your Entra AD tenant by selecting your account in the top right corner of the page. Then select the **Change directory** navigation bar, then the desired tenant
tr_tr: Sayfanın sağ üst köşesinden hesabınızı seçerek Entra AD kiracınızı seçin. **Dizin değiştir** gezinme çubuğunu ve ardından istediğiniz kiracıyı seçin

source: Skip this step if you only have one Entra AD tenant under your account or if you have already selected one
tr_tr: Hesabınızda yalnızca bir Entra AD kiracısı varsa ya da zaten bir tane seçtiyseniz bu adımı atlayın

source: change tenant
tr_tr: Kiracıyı değiştirin

source: In the Entra Portal, search for and select **Entra Active Directory**
tr_tr: Entra Portal üzerinde **Entra Active Directory** ögesini arayın ve seçin

source: From the left-hand **Active Directory** menu
tr_tr: Sol taraftaki **Active Directory** menüsünden

source: select **Application Registrations**
tr_tr: **Uygulama kayıtları** ögesini seçin

source: Then **New Registration**.
tr_tr: **Yeni kayıt** üzerine tıklayın.

source: add new app
tr_tr: Yeni uygulama ekleyin

source: Enter **web** in the redirect URI and paste the return URL of your GLPI instance:
tr_tr: Yönlendirme adresi olarak **web** yazın ve GLPI kopyanızın dönüş adresini yapıştırın:

source: register app
tr_tr: Uygulamayı kaydedin

source: copy callback
tr_tr: Geri dönüş adresini kopyalayın

source: Secret and certificate
tr_tr: Parola ve sertifika

source: In the **certificates and secrets** tab, create a new secret that will need to be transferred to your Oauth SSO application on the GLPI side:
tr_tr: **Sertifikalar ve parolalar** sekmesinden, GLPI tarafındaki OAuth SSO uygulamanıza aktarılması gereken yeni bir parola oluşturun:

source: add new secret
tr_tr: Yeni parola ekleyin

source: When you click on **add**, **the secret will only be available once**. As soon as you leave this page, **the secret will be hidden** and we will no longer be able to access it. Remember to **store it in a safe place** as we will need it later
tr_tr: **Ekle** üzerine tıkladığınızda, **Parola yalnızca bir kez görüntülenir**. Bu sayfadan ayrılır ayrılmaz, **parola gizlenir** ve bir daha erişilemez. Daha sonra gerek duyacağımız için **güvenli bir yerde saklamayı** unutmayın

source: copy value
tr_tr: Değeri kopyalayın

source: Claims
tr_tr: İstekler

source: If you are using **SSO V2**, an additional step is required. The **claims** on the Entra side **must be entered manually** and should preferably be of type **ID**.
tr_tr: **SSO V2** kullanıyorsanız, ek bir adım gereklidir. Entra tarafındaki **istekler** **el ile** yazılmalı ve tercihen **ID** türünde olmalıdır.

source: In the **Token configuration** tab
tr_tr: **Kod yapılandırması** sekmesinde

source: Click on **Add an optional claim**
tr_tr: **İsteğe bağlı bir istek ekle** seçeneğine tıklayın

source: Add the 4 claims below:
tr_tr: Aşağıdaki 4 isteği ekleyin:

source: add token
tr_tr: Kod ekleyin

source: API authorisations
tr_tr: API yetkilendirmeleri

source: GLPI must be able to read user information in order to use it for connection - In **API permissions** - Click on the API already present (Microsoft Graph for our example)
tr_tr: GLPI bağlantı için kullanabilmek amacıyla kullanıcı bilgilerini okuyabilmelidir - **API izinleri** bölümünden - Var olan API üzerine tıklayın (örneğimizde Microsoft Graph)

source: add API
tr_tr: API ekleyin

source: Select :
tr_tr: Seçin:

source: Then remember to save your changes.
tr_tr: Son olarak değişikliklerinizi kaydetmeyi unutmayın.

source: Setup GLPI
tr_tr: GLPI kurulumu

source: Entra AD provides a description with the essential information you need:
tr_tr: Entra AD, gerek duyduğunuz temel bilgileri içeren bir açıklama sunar:

source: overview app
tr_tr: Uygulama özeti

source: Specify an application **name** visible to end users.
tr_tr: Son kullanıcıların görebileceği bir uygulama **adı** belirtin.

source: setup GLPI
tr_tr: GLPI kurulumu

source: Copy the values from the fields above:
tr_tr: Yukarıdaki alanlardaki değerleri kopyalayın:

source: Application ID
tr_tr: Uygulama kimliği

source: The holder ID
tr_tr: Sahip kimliği

source: The **value** of the secret copied in the previous step
tr_tr: Önceki adımda kopyalanan parola **değeri**

source: Please check that the **value** of the secret is filled in correctly.If the ID of the secret is copied, your application will fall into error.
tr_tr: Lütfen parola **değerinin** doğru olarak doldurulduğundan emin olun. Parola kimliği kopyalanırsa, uygulamanız hata verir.

source: Explanation of ID field
tr_tr: Kimlik alanının açıklaması

source: 3 values are available in this insert:
tr_tr: Bu bölümde 3 değer bulunur:

source: choose ID field
tr_tr: Kimlik alanını seçin

source: **User Principal Name (UPN)**: this option will show the full username of the user logging in (nom.prenom@mondomaine.com for example). If you want only the username to be visible (without the @mondomaine.com, see the **XXXXXXXXXX** paragraph).
tr_tr: **Kullanıcı asıl adı (UPN)**: Bu seçenek oturum açan kullanıcının tam kullanıcı adını görüntüler (örneğin, ad.soyad@ornek.com). Yalnızca kullanıcı adının görünür olmasını istiyorsanız (@ornek.com olmadan, **XXXXXXXXXX** paragrafına bakın).

source: **Entra user ID (OID)**: this option takes the object ID from the Entra AD. This ID will be used for the user login
tr_tr: **Entra kullanıcı kimliği (OID)**: Bu seçenek Entra AD üzerinden nesne kimliğini alır. Bu kimlik kullanıcıların oturum açması için kullanılır

source: what is objet ID
tr_tr: Nesne kimliği nedir

source: **Email address**: This option specifies the user’s email address. This field will be used for the login. If it is empty, the UPN will be used.
tr_tr: **E-posta adresi**: Bu seçenek kullanıcının e-posta adresini belirtir. Bu alan oturum açmak için kullanılır. Boş ise, UPN kullanılır.

source: If you need to find your application in the Entra portal, select **Application subscriptions**, then **Display all applications**.
tr_tr: Uygulamanızı Entra portalında bulmanız gerekiyorsa **Uygulama abonelikleri** üzerine ve ardından **Tüm uygulamaları görüntüle** üzerine tıklayın.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
