Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/oauthsso/google.po
Languages: tr_tr

source: Creating a project
tr_tr: Bir proje oluşturmak

source: From your `Google console <https://console.cloud.google.com/>`_ (administrator access is required)
tr_tr: `Google konsolunuzdan <https://console.cloud.google.com/>`_ (yönetici erişimi gereklidir)

source: Go to your organisation then new project
tr_tr: Kuruluşunuza gidin ve ardından yeni projeye geçin

source: Enter the name of your project
tr_tr: Projenizin adını yazın

source: Click on **Create**
tr_tr: **Oluştur** üzerine tıklayın

source: add project
tr_tr: Proje ekleyin

source: Return to your organisation,
tr_tr: Kuruluşunuza dönün,

source: Select your project
tr_tr: Projenizi seçin

source: select the project
tr_tr: Projeyi seçin

source: Setup Oauth access
tr_tr: OAuth erişimini kurmak

source: From the menu, click on **APIs & Services**
tr_tr: Menüden **API ve Hizmetler** üzerine tıklayın

source: Then **OAuth consent screen**
tr_tr: Ardından **OAuth onay ekranı** üzerine tıklayın

source: add API
tr_tr: API ekleyin

source: Select the type of access that will be granted to the application (internal or external users)
tr_tr: Uygulamaya verilecek erişim türünü seçin (iç ya da dış kullanıcılar)

source: Then click on **Create**.
tr_tr: Ardından **Oluştur** üzerine tıklayın

source: user type
tr_tr: Kullanıcı türü

source: Enter (as a minimum) a name for the application, an email address for application support and the developer’s email address (this information is compulsory).
tr_tr: Uygulama için (en azından) bir ad, uygulama desteği için bir e-posta adresi ve geliştiricinin e-posta adresini yazın (bu bilgi zorunludur).

source: Click on **Save and continue**.
tr_tr: **Kaydedip ilerle** düğmesine tıklayın.

source: In the **Scope** section
tr_tr: **Kapsam** bölümüne gidin

source: Click on **Add or remove application fields**
tr_tr: **Uygulama alanları ekle ya da kaldır** seçeneğine tıklayın

source: Add **auth/userinfo.email** **auth/userinfo.profile** and **openid**
tr_tr: **auth/userinfo.email**, **auth/userinfo.profile** ve **openid** ekleyin

source: update scopes
tr_tr: Kapsamları güncelleyin

source: Click on **Update**
tr_tr: **Güncelle** üzerine tıklayın

source: Then **Save and continue**
tr_tr: **Kaydedip ilerle** üzerine tıklayın.

source: ID settings
tr_tr: Kimlik ayarları

source: From the **Credentials** menu
tr_tr: **Kimlik doğrulama bilgileri** menüsünden

source: Click on **Create credentials**
tr_tr: **Kimlik doğrulama bilgileri oluştur** üzerine tıklayın

source: Then **Oauth client ID**.
tr_tr: Ardından **OAuth istemci kimliği** üzerine tıklayın

source: add credentials
tr_tr: Kimlik doğrulama bilgileri ekleyin

source: Select the type of application **Web application**
tr_tr: Uygulama türünü **Web uygulaması** olarak seçin

source: Enter an application name
tr_tr: Bir uygulama adı seçin

source: In the **Authorized redirect URIs** section
tr_tr: **İzin verilmiş yönlendirme adresleri** bölümünden

source: Enter the GLPI **Callback URL**
tr_tr: GLPI **dönüş adresi** değerini yazın

source: Where can I find my callback URL?
tr_tr: Dönüş adresimi nerede bulabilirim?

source: find url callback
tr_tr: Dönüş adresini bulun

source: A page appears with the identifier values. **Keep this information** as it will be requested in GLPI.
tr_tr: Tanımlayıcı değerlerin olduğu bir sayfa açılır. GLPI tarafından isteneceği için bu bilgileri **saklayın**.

source: Overview
tr_tr: Özet

source: Setup GLPI
tr_tr: GLPI kurulumu

source: From **Setup > Oauth SSO applications**
tr_tr: **Kurulum > Oauth SSO uygulamaları** bölümüne gidin

source: Click on **Add**
tr_tr: **Ekle** üzerine tıklayın

source: Select **Google** in the **Oauth provider** field
tr_tr: **OAuth hizmeti sağlayıcısı** alanından **Google** seçin

source: Select the icon that will be visible on the home page
tr_tr: Giriş sayfasında görüntülenecek simgeyi seçin

source: Enter the **Client ID** (number 1 on the previous screenshot)
tr_tr: **İstemci kimliğini** yazın (önceki ekran görüntüsündeki 1 numara)

source: Enter the **Client secret** (numbered 2 on the previous screenshot)
tr_tr: **İstemci parolasını** yazın (önceki ekran görüntüsündeki 2 numara)

source: Enter the **field user ID** [1]_
tr_tr: **Kullanıcı kimliği alanını** [1] yazın

source: setup GLPI
tr_tr: GLPI kurulumu

source: From the home page, the new Oauth SSO login option will be visible:
tr_tr: Giriş sayfasında yeni OAuth SSO oturum açma seçeneği görüntülenir:

source: home page
tr_tr: Giriş sayfası

source: The first time a user logs on, they will be asked to accept access authorisations for their profile
tr_tr: Bir kullanıcı ilk kez oturum açtığında, profiline erişim yetkilerini kabul etmesi istenir

source: the identifier field will be the user’s login. **Google user Id** represents the unique value for each user generated when the user is created.
tr_tr: Tanımlayıcı alanı kullanıcının oturum açma bilgileri olur. **Google kullanıcı kimliği**, kullanıcı oluşturulduğunda her kullanıcı için oluşturulan benzersiz değeri temsil eder.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
