Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/oauthsso/keycloak.po
Languages: tr_tr

source: Create a REALM
tr_tr: Bir REALM oluşturun

source: After installing keycloak, go to the admin console:
tr_tr: Keycloak kurduktan sonra yönetici panosuna gidin:

source: http://XXXXXXXXXX:8080/admin or https://XXXXXXXXXX:8080/admin
tr_tr: http://XXXXXXXXXX:8080/admin ya da https://XXXXXXXXXX:8080/admin

source: Create your **realm** by clicking on **master** at the top left of your screen
tr_tr: Ekranınızın sol üst köşesinden **master** üzerine tıklayarak **Realm** ortamınızı oluşturun

source: Then **create Realm**
tr_tr: Ardından **Realm oluştur** üzerine tıklayın

source: Give it a name that suits you
tr_tr: Uygun bir ad yazın

source: Click on **Create**
tr_tr: **Oluştur** üzerine tıklayın

source: create Realm
tr_tr: Realm oluşturun

source: Create user
tr_tr: Kullanıcı oluşturmak

source: Then go to the **Users** tab
tr_tr: **Kullanıcılar** sekmesine gidin

source: Then **Create new user** (we’ll use a local user, but you can synchronize your LDAP if necessary)
tr_tr: Ardından **Yeni kullanıcı oluştur** (yerel bir kullanıcı kullanacağız, ancak gerekirse LDAP ile eşitleyebilirsiniz)

source: create user
tr_tr: Kullanıcı oluşturun

source: Create your user according to your needs, remembering to check the Email verified box
tr_tr: Gereksinimlerinize uygun kullanıcınızı oluşturun, E-posta doğrulandı işaretini koymayı unutmayın

source: Click on **Create** once you’ve entered your details.
tr_tr: Bilgilerinizi yazdıktan sonra **Oluştur** üzerine tıklayın.

source: email verified
tr_tr: E-posta doğrulandı

source: Stay in your user file and click on **Credentials**
tr_tr: Kullanıcı dosyanızda kalın ve **Kimlik Bilgileri** üzerine tıklayın

source: Then **Set pasword**
tr_tr: Ardından **Parolayı ayarla** üzerine tıklayın

source: add credentials
tr_tr: Kimlik doğrulama bilgilerini ekleyin

source: Configure the user password, taking care to indicate that the password is not temporary
tr_tr: Kullanıcı parolasını ayarlayın. Parolanın geçici olmamasına dikkat edin

source: Click on save then **Save password**
tr_tr: Kaydet üzerine tıklayın ve ardından **Parolayı kaydet** üzerine tıklayın

source: setup credentials
tr_tr: Kimlik doğrulama bilgilerini ayarlayın

source: You can check that your configuration is correct by logging on to the user account console:
tr_tr: Yapılandırmanızın doğru olup olmadığını kullanıcı hesabı panosunda oturum açarak kontrol edebilirsiniz:

source: http://XXXXXXXXXXX/realms/GLPI/account/#/ or https://XXXXXXXXXXX/realms/GLPI/account/#/
tr_tr: http://XXXXXXXXXXX/realms/GLPI/account/#/ ya da https://XXXXXXXXXXX/realms/GLPI/account/#/

source: (Remember to adapt the realm name if you haven’t named it GLPI).
tr_tr: (GLPI adını vermediyseniz Realm adını uyarlamayı unutmayın).

source: You will then be able to connect to the record of the previously created user or one of your LDAP users.
tr_tr: Ardından daha önce oluşturduğunuz kullanıcının veya LDAP kullanıcılarınızdan birinin kaydı ile bağlantı kurabileceksiniz.

source: Create client
tr_tr: İstemci oluştur

source: Now we can register our GLPI application with Keycloak
tr_tr: Artık GLPI uygulamamızı Keycloak üzerinde kaydedebiliriz

source: Go to **Clients**
tr_tr: **İstemciler** bölümüne gidin

source: create client
tr_tr: İstemci oluşturun

source: Give your application a client ID, which you’ll need to pass on to your GLPI Oauth SSO configuration
tr_tr: Uygulamanıza, GLPI Oauth SSO yapılandırmanıza iletmeniz gereken bir istemci kimliği verin

source: Click on next and make sure on the next page that the **standard flow** and **client authentication** options are active
tr_tr: İleri üzerine tıklayın ve bir sonraki sayfada **standart akış** ve **istemci kimlik doğrulaması** seçeneklerinin etkin olduğundan emin olun

source: Click on **Save**
tr_tr: **Kaydet** üzerine tıklayın

source: Keep this page active, we’ll come back to it later.
tr_tr: Bu sayfayı açık tutun, daha sonra yeniden geleceğiz.

source: client type
tr_tr: İstemci türü

source: Setup GLPI
tr_tr: GLPI kurulumu

source: Go to GLPI
tr_tr: GLPI panosuna gidin

source: In **Setup > Oauth SSO applications click on add** (at the top of your screen)
tr_tr: **Kurulum > Oauth SSO uygulamaları bölümünde Ekle üzerine tıklayın (ekranınızın üst bölümünde)

source: add SSO GLPI
tr_tr: SSO GLPI ekleyin

source: Start by retrieving the return URL and pasting it into Keycloak’s **valid redirect URIs** field
tr_tr: Dönüş adresini alarak ve onu Keycloak **Geçerli yönlendirme adresleri** alanına yapıştırarak başlayın

source: copy URL callback
tr_tr: Dönüş adresini kopyalayın

source: Back in GLPI’s Oauth SSO plugin configuration, fill in the required fields:
tr_tr: GLPI Oauth SSO eklentisi yapılandırmasına geri dönün. Gerekli alanları doldurun:

source: setup GLPI
tr_tr: GLPI kurulumu

source: Give your provider a name, which will appear on the login page for users
tr_tr: Sağlayıcınıza, kullanıcıların oturum açma sayfasında görüntülenecek bir ad verin

source: Activate this plugin so that it is visible and usable on the login page
tr_tr: Bu eklentiyi etkinleştirin. Böylece oturum açma sayfasında görüntülenir ve kullanılabilir

source: Choose Keycloak as your Oauth provider
tr_tr: OAuth sağlayıcınız olarak Keycloak seçin

source: Enter the client name set above
tr_tr: Yukarıda ayarlanan istemci adını yazın

source: Retrieve client secret from Keycloak (client, client_name, credentials)
tr_tr: Keycloak istemci parolasını alın (istemci, istemci_adı, kimlik doğrulama bilgileri)

source: Enter the discovery URL: http://mondomaine/realms/monrealms/.well-known/openid-configuration.
tr_tr: Keşif adresini yazın: http://mondomaine/realms/monrealms/.well-known/openid-configuration.

source: Click on **Add**
tr_tr: **Ekle** üzerine tıklayın

source: In the plugin, to see the approval message:
tr_tr: Eklentide onay iletisini görmek için:

source: test connexion
tr_tr: Bağlantıyı sınayın

source: Now that configuration is complete, you can test the connection with the user you created earlier, or with your LDAP user.
tr_tr: Artık yapılandırma tamamlandığına göre, daha önce oluşturduğunuz kullanıcıyla veya LDAP kullanıcınızla bağlantıyı sınayabilirsiniz.

source: login page
tr_tr: Oturum açma sayfası

source: connexion Keycloak
tr_tr: Keycloak bağlantısı

source: home page
tr_tr: Giriş sayfası

source: Creative Commons License
tr_tr: Creative Commons Lisansı
