Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/oauthsso/okta.po
Languages: tr_tr

source: Create application
tr_tr: Uygulamayı oluşturun

source: First, go to GLPI and download the Oauthsso plugin
tr_tr: Öncelikle GLPI panosuna gidin ve Oauthsso eklentisini indirin

source: Navigate to the **Setup > Oauth SSO applications**
tr_tr: **Kurulum > Oauth SSO uygulamaları** bölümüne gidin

source: Click on **Add**
tr_tr: **Ekle** üzerine tıklayın

source: add SSO GLPI
tr_tr: SSO GLPI ekleyin

source: Keep this window active and retain the callback URL :
tr_tr: Bu pencereyi açık tutun ve dönüş adresini koruyun:

source: copy callback URL
tr_tr: Dönüş adresini kopyalayın

source: In your OKTA interface, go to **Applications**
tr_tr: OKTA arayüzünüzde **Uygulamalar** bölümüne gidin

source: **Create App Integration**
tr_tr: **Uygulama bütünleştirmesi oluştur**

source: create app
tr_tr: Uygulamayı oluşturun

source: Select option **OIDC – OpenID Connect** in the 1st insert and **Web Application** in the second
tr_tr: İlk olarak **OIDC – OpenID Connect** seçeneğini ardından **Web uygulaması** seçeneğini seçin

source: Click on **Next**
tr_tr: **Sonraki** üzerine tıklayın

source: select sign-in
tr_tr: Oturum açmayı seçin

source: Enter an application name and check the box **Client credentials**
tr_tr: Bir uygulama adı yazın ve **İstemci kimlik doğrulama bilgileri** kutusunu işaretleyin

source: web integration
tr_tr: Web bütünleştirmesi

source: Enter the return URL, retrieved above, in Sign-in redirect URIs.
tr_tr: Yukarıdan alınan dönüş adresini oturum açma yönlendirmesi adresi olarak yazın.

source: paste URL callback
tr_tr: Dönüş adresini yapıştırın

source: Assignments
tr_tr: Atamalar

source: In the last box, select the option that suits you best (here we authorize all users present in OKTA)
tr_tr: Son kutuda size uygun seçeneği seçin (burada OKTA üzerinde bulunan tüm kullanıcıları yetkilendiriyoruz)

source: Finally, click on **Save**
tr_tr: Son olarak **Kaydet** üzerine tıklayın

source: assignments
tr_tr: Atamalar

source: Setup GLPI
tr_tr: GLPI kurulumu

source: In GLPI, go back to the Oauth SSO plugin configuration window and enter your OKTA tenant information :
tr_tr: GLPI üzerinde Oauth SSO eklentisini yapılandırma penceresine dönün ve OKTA kiracı bilgilerinizi yazın:

source: setup GLPI
tr_tr: GLPI kurulumu

source: Give your provider a name, which will appear on the login page.
tr_tr: Sağlayıcınıza, oturum açma sayfasında görüntülenecek bir ad verin

source: Indicate this as active
tr_tr: Bunu etkin olarak belirtin

source: Enter OKTA as provider Oauth
tr_tr: OAuth sağlayıcı olarak OKTA seçin

source: Enter the application ID found in the application previously created in OKTA
tr_tr: Daha önce OKTA üzerinde oluşturulan uygulamada bulunan uygulama kimliğini yazın

source: client ID
tr_tr: İstemci kimliği

source: Specify the ID field to be mapped with OKTA
tr_tr: OKTA ile eşleştirilecek kimlik alanını belirtin

source: Specify the customer secret available in OKTA in the previously created application
tr_tr: Daha önce oluşturulan uygulamada OKTA üzerinde bulunan istemci parolasını yazın

source: add secret
tr_tr: Parolayı ekleyin

source: Enter the name of your OKTA instance (https://XXXXXXXXX.okta.com), available in the account creation confirmation e-mail.
tr_tr: Hesap oluşturma onay e-postasında bulunan OKTA kopyanızın adını (https://XXXXXXXXX.okta.com) girin.

source: In the plugin, you will see the approval message:
tr_tr: Eklentide onay iletisini göreceksiniz:

source: test connexion
tr_tr: Bağlantıyı sınayın

source: Now that the configuration is complete, you can test it with a user.
tr_tr: Artık yapılandırmanız tamamlandığına göre bunu bir kullanıcıyla sınayabilirsiniz.

source: login page
tr_tr: Oturum açma sayfası

source: home page
tr_tr: Giriş sayfası

source: Creative Commons License
tr_tr: Creative Commons Lisansı
