Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/oauthsso/requirements.po
Languages: tr_tr

source: Requirements (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
tr_tr: GLPI sürümü

source: Minimum PHP
tr_tr: En düşük PHP sürümü

source: Recommended
tr_tr: Önerilen

source: A `GLPI Network BASIC <https://services.glpi-network.com/#offers>`_ subscription (or higher) is required. This plugin is also available for all GLPI Network `Cloud instances <https://glpi-network.cloud>`_.
tr_tr: Bir `GLPI Network BASIC <https://services.glpi-network.com/#offers>`_ aboneliği (ya da üzeri) gereklidir. Bu eklenti tüm GLPI Network `Cloud kopyaları <https://glpi-network.cloud>`_ ile de edinilebilir.

source: External Authentication
tr_tr: Dış kimlik doğrulaması

source: The plugin uses GLPI’s **External Authentication** functionality and to be functional, it needs some initial Setup.
tr_tr: Eklenti, GLPI **Dış kimlik doğrulama** işlevini kullanır ve çalışması için bazı ilk kurulumlar gerekir.

source: Go to **Setup > Authentication > Other authentication methods**
tr_tr: **Kurulum > Kimlik doğrulama > Diğer kimlik doğrulama yöntemleri** bölümüne gidin

source: In the **Other authentication transmitted in the HTTP request** section
tr_tr: **HTTP isteğinde iletilen diğer kimlik doğrulama** bölümüne gidin

source: The **Storage fields for the identifier in the HTTP request** field must be defined, usually **HTTP_AUTH_USER**.
tr_tr: HTTP isteğindeki tanımlayıcı için **Depolama alanları** tanımlanmalıdır. Genellikle **HTTP_AUTH_USER**.

source: The **Delete the domain from identifiers of the form identifier@domain** field can be set to **Yes** or **No**.
tr_tr: **Form kimlik@etkialani tanımlayıcılarından etki alanı silinsin** alanı **Evet** ya da **Hayır** olarak ayarlanabilir.

source: In the case of authentication via SSO, the option **Delete the domain of identifiers in the form identifier@domain** can be set to **Yes**, which will allow 2 user records to be merged if they are already present in the database (internal or LDAP(S)).
tr_tr: SSO ile kimlik doğrulaması durumunda, **kimlik@etkialani biçimindeki kimliklerin etki alanı silinsin** seçeneği **Evet** olarak ayarlanabilir. Böylece, veri tabanında (iç veya LDAP) zaten var olan 2 kullanıcı kaydı birleştirilebilir.

source: Be careful because this option is subject to identity theft. If your application is open to users other than your own, it is possible that one user could be merged with another. For example, **john.doe@mondomaine.fr** has a namesake but a different email address **john.doe@unautredomaine.fr**. By deleting the domain, the 2 records will be merged and the John Does will have the same account.
tr_tr: Dikkatli olun çünkü bu seçenek kimlik hırsızlığına maruz kalabilir. Uygulamanız kendi kullanıcınız dışındaki kullanıcılara açıksa, bir kullanıcı başka biriyle birleştirilebilir. Örneğin, **ali.kaya@ornek.com** için bir ad varken **ali.kaya@baskaornek.com** gibi farklı bir e-posta adresi olabilir. Etki alanı silinerek, 2 kayıt birleştirilir ve Ali Kaya tek hesaba sahip olur.

source: The users who are going to authenticate themselves will not be known to GLPI, so it is necessary to populate certain fields to create their record in GLPI with a minimum of information.
tr_tr: Kendilerini doğrulayacak kullanıcılar GLPI tarafından bilinmeyeceğinden, GLPI üzerinde kayıtları oluşturmak için belirli alanların doldurulması ve olabilecek en az bilginin yazılması gereklidir.

source: The fields that can be retrieved by SSO are as follows:
tr_tr: SSO ile alınabilecek alanlar şunlardır:

source: Last name : **givenName**
tr_tr: Soyadı: **givenName**

source: First name: **familyName**
tr_tr: Adı: **familyName**

source: Email: **email**
tr_tr: E-posta adresi: **email**

source: Email2: **email2**
tr_tr: 2. e-posta adresi: **email2**

source: Telephone number: **phone**
tr_tr: Telefon numarası: **phone**

source: Mobile: **mobile**
tr_tr: Cep telefonu numarası: **mobile**

source: Title: **title**
tr_tr: Ünvan: **title**

source: Language: **language**
tr_tr: Dil: **language**

source: field to complete
tr_tr: Tamamlanacak alan

source: Save your Setup
tr_tr: Kurulumunuzu kaydedin

source: You must also activate the automatic addition of users in GLPI to create them in GLPI at the time of authentication
tr_tr: Ayrıca kimlik doğrulama sırasında GLPI üzerinde kullanıcı oluşturmak için GLPI ayarlarından otomatik kullanıcı ekleme seçeneğini de açmalısınız

source: In the **Setup > Authentication > Setup** menu
tr_tr: Menüden **Kurulum > Kimlik doğrulama > Kurulum** üzerine tıklayın

source: The **Automatically add users from external authentication sources** field must be changed to **Yes**
tr_tr: **Dış kimlik doğrulama kaynaklarından kullanıcılar otomatik olarak eklensin** alanı **Evet** olarak değiştirilmelidir

source: add user auto
tr_tr: Kullanıcıları otomatik olarak ekleyin

source: Fetch information from user profile option
tr_tr: Bilgileri kullanıcı profilinden alma seçeneği

source: You can choose if you want to retrieve informations from the user profile. In **setup > Oauth SSO applications** select yes or no as required.
tr_tr: Kullanıcı profilinden bilgi almak isteyip istemediğinizi seçebilirsiniz. **Kurulum > OAuth SSO uygulamaları** bölümünde Evet ya da Hayır olarak seçin.

source: If **OAuth SSO** is your **only source of authentication AND provisioning**, we recommend that you set the **Fetch information from user profile option** to **Yes** so that user information can be fetched. Please note that claims must also be set correctly on the provider side.
tr_tr: **OAuth SSO** sizin **tek kimlik doğrulama VE sağlama kaynağınız** ise, kullanıcı bilgilerinin alınabilmesi için **Bilgiler kullanıcı profilinden alınsın** seçeneğini **Evet** olarak ayarlamanızı öneririz. Lütfen isteklerin sağlayıcı tarafında da doğru şekilde ayarlanması gerektiğini unutmayın.

source: If you are using an **external provisioning source** such as SCIM, we recommend that you set the **Fetch information from user profile option** to **No** so that user information is not overwritten and replaced by that of the OAuth SSO plugin.
tr_tr: SCIM gibi bir **dış sağlama kaynağı** kullanıyorsanız, kullanıcı bilgilerinin üzerine yazılmaması ve OAuth SSO eklentisinin bilgileriyle değiştirilmemesi için **Bilgiler kullanıcı profilinden alınsın** seçeneğini **Hayır** olarak ayarlamanızı öneririz.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
