Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/oauthsso/rules.po
Languages: tr_tr

source: Rules for assigning authorisations
tr_tr: Yetki atama kuralları

source: Remember that Oauth SSO authentication allows **only authentication**, in the sense that no user management is carried out following authentication.
tr_tr: Oauth SSO kimlik doğrulamasının **yalnızca kimlik doğrulaması** kullanılmasına izin verdiğini, yani kimlik doğrulamasının ardından kullanıcı yönetimi yapılmadığını unutmayın.

source: In most cases, it will therefore be necessary to establish rules for assigning authorisations to your users (to give them a profile, for example).
tr_tr: Çoğu durumda, kullanıcılarınıza yetki atamak için kurallar oluşturmanız (örneğin, onlara bir profil vermek) gerekir.

source: To do this, go to **Administration > Rules > Rules for assigning authorisations to a user**.
tr_tr: Bunu yapmak için **Yönetim > Kurallar > Kullanıcıya yetki atama kuralları** bölümüne gidin.

source: There are no ‘mandatory’ rules, it’s up to you to create the rule(s) that you feel best suit your needs according to your available criteria.
tr_tr: Zorunlu kurallar yoktur. Var olan ölçütlerinize göre gereksinimlerinize uygun olduğunu düşündüğünüz kural veya kuralları oluşturmak size kalır.

source: For example, a very simple rule
tr_tr: Örneğin, çok basit bir kural

source: A very simple rule -> *I want my users with SSO authentication to obtain the Self-Service profile*.
tr_tr: Çok basit bir kural -> *SSO kimlik doğrulaması yapan kullanıcılarımın Self-Service profilini edinmelerini istiyorum*.

source: So I set my criteria and my action :
tr_tr: Ben de ölçütlerimi ve eylem planımı belirledim:

source: add rules
tr_tr: Kuralları ekleyin

source: Creative Commons License
tr_tr: Creative Commons Lisansı
