Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/moresatisfaction/index.po
Languages: pt_br, tr_tr

source: More satisfaction
pt_br: Mais satisfação
tr_tr: Daha iyi memnuniyet

source: Requirements (on-premise)
pt_br: Requisitos (localmente)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
pt_br: Versão do GLPI
tr_tr: GLPI sürümü

source: Minimum PHP
pt_br: PHP mínimo
tr_tr: En düşük PHP sürümü

source: Recommended
pt_br: Recomendado
tr_tr: Önerilen

source: A `GLPI Network BASIC <https://services.glpi-network.com/#offers>`_ subscription (or higher) is required. This plugin is also available for all GLPI Network `Cloud instances <https://glpi-network.cloud>`_.
tr_tr: Bir `GLPI Network BASIC <https://services.glpi-network.com/#offers>`_ aboneliği (ya da üzeri) gereklidir. Bu eklenti tüm GLPI Network `Cloud kopyaları <https://glpi-network.cloud>`_ ile de edinilebilir.

source: The plugin **cannot work with anonymous users** (with email only) The plugin needs a GLPI account to use the user's token and allow one-click responses without authentication (the plugin takes care of this via the token). In this context you will need to use an external satisfaction survey, for example google forms.
tr_tr: Eklenti **anonim kullanıcılarla çalışamaz** (yalnızca e-posta ile). Eklentide, kullanıcının kodunu kullanması ve kimlik doğrulaması olmadan tek tıklamayla yanıtlamaya izin vermesi için bir GLPI hesabı gereklidir (eklenti kod ile bunu yapar). Bu bağlamda, Google formları gibi dışarıdan bir memnuniyet anketi kullanmanız gerekecektir.

source: Install the plugin
pt_br: Instalar o plugin
tr_tr: Eklentiyi kurmak

source: Go to the marketplace. Download and install the plugin **More satisfaction**
pt_br: Vá para o marketplace. Baixe e instale o plugin **Mais satisfação**
tr_tr: Mağazaya gidin. **Daha iyi memnuniyet** eklentisini indirip kurun.

source: install the plugin
tr_tr: Eklentiyi kurmak

source: Create a survey
pt_br: Criar uma pesquisa
tr_tr: Bir anket oluşturun

source: Once installed, go to **Administration > Satisfaction survey**
pt_br: Uma vez instalado, vá para **Administração > Pesquisa de satisfação**
tr_tr: Kurulduktan sonra **Yönetim > Memnuniyet anketi** bölümüne gidin

source: Click on **Add**
pt_br: Clique em **Adicionar**
tr_tr: **Ekle** üzerine tıklayın

source: Name your survey and set it as active
pt_br: Nomeie sua pesquisa e defina-a como ativa
tr_tr: Anketinize bir ad verin ve etkin olarak ayarlayın

source: Also remember to tick the sub-entity box if you want it to be available to all child entities
pt_br: Também lembre-se de marcar a caixa de subentidade se você deseja que ela esteja disponível para todas as entidades filhas.
tr_tr: Tüm alt varlıklar için de kullanılabilir olmasını istiyorsanız alt varlık kutusunu işaretlemeyi unutmayın

source: Then click on **Add**
pt_br: Então clique em **Adicionar**
tr_tr: Ardından **Ekle** üzerine tıklayın

source: add satisfaction survey
tr_tr: Memnuniyet anketini ekleyin

source: It is only possible to create one survey per entity. If you wish to create several for different entities, remember to position yourself in the appropriate entity and do not tick the sub-entity box
pt_br: É possível criar apenas uma pesquisa por entidade. Se você deseja criar várias pesquisas para entidades diferentes, lembre-se de posicionar-se na entidade apropriada e não marque a caixa de sub-entidade.
tr_tr: Her varlık için yalnızca bir anket oluşturulabilir. Farklı varlıklar için birkaç anket oluşturmak istiyorsanız, kendinizi uygun varlığa geçirmeyi unutmayın ve alt varlık kutusunu işaretlemeyin

source: sub entity
tr_tr: Alt varlık

source: Create a question
pt_br: Criar uma pergunta
tr_tr: Bir soru oluşturun

source: Enter your survey and go to the **Question** tab
pt_br: Digite sua pesquisa e vá para a guia **Pergunta**
tr_tr: Anketinizi açın ve **Soru** sekmesine gidin

source: Click on Add a question
pt_br: Clique em Adicionar uma pergunta
tr_tr: Soru ekle üzerine tıklayın

source: Select the type of question **Yes/No** and enter the text that suits you
pt_br: Selecione o tipo de pergunta **Sim/Não** e digite o texto que lhe convém.
tr_tr: Soru türünü **Evet/Hayır** olarak seçin ve size uygun metni yazın

source: Then click **Add**
pt_br: Então clique em **Adicionar**
tr_tr: Ardından **Ekle** üzerine tıklayın

source: create question
tr_tr: Soru oluşturun

source: Create a text field
pt_br: Adicionar um campo de texto
tr_tr: Bir metin alanı oluşturun

source: In the question tab, click on **Add a question**
pt_br: Na guia de perguntas, clique em **Adicionar uma pergunta**.
tr_tr: Soru sekmesinden **Soru ekle** üzerine tıklayın

source: Select the **Text** type
pt_br: Selecione o tipo de **Texto**
tr_tr: **Metin** türünü seçin

source: Enter the text to be displayed and click **Add**
pt_br: Digite o texto a ser exibido e clique em **Adicionar**
tr_tr: Görüntülenecek metni yazın ve **Ekle** üzerine tıklayın

source: text for question
tr_tr: Soru metni

source: Create a note
pt_br: Criar uma nota
tr_tr: Bir not oluşturun

source: select the **Note** type
pt_br: Selecione o tipo de **Nota**
tr_tr: **Not** türünü seçin

source: You can select a score up to 10 and set a default value
pt_br: Você pode selecionar uma pontuação até 10 e definir um valor padrão.
tr_tr: En fazla 10 olabilecek not seçebilir ve varsayılan bir değer belirleyebilirsiniz

source: Click on "Add" when you are happy with your settings
pt_br: Clique em "Adicionar" quando estiver satisfeito com suas configurações.
tr_tr: Ayarlarınızı tamamladığınızda "Ekle" üzerine tıklayın

source: add note
tr_tr: Not ekleyin

source: Preview
pt_br: Pré-visualização
tr_tr: Ön izleme

source: The preview tab allows you to see what users will receive once their ticket has been closed
pt_br: A guia de pré-visualização permite que você veja o que os usuários receberão assim que o ticket deles for fechado.
tr_tr: Önizleme sekmesi, kullanıcıların destek kayıtları kapatıldıktan sonra neyle karşılaşacağını görmenizi sağlar

source: preview
tr_tr: Ön izleme

source: Translation
pt_br: Tradução
tr_tr: Çeviri

source: You can translate each of the questions asked in the questionnaire into the language of your choice
pt_br: Você pode traduzir cada uma das perguntas feitas no questionário para o idioma de sua escolha.
tr_tr: Ankette sorulan her soruyu istediğiniz dile çevirebilirsiniz.

source: Go to the **Translations** tab
pt_br: Vá para a guia **Traduções**
tr_tr: **Çeviriler** sekmesine gidin

source: Choose the language you want and then, question by question, write the translation
pt_br: Escolha o idioma que você deseja e, em seguida, pergunta por pergunta, escreva a tradução.
tr_tr: Çevirmek istediğiniz dili seçin ve ardından her sorunun çevirisini yazın

source: translate
tr_tr: Çevirin

source: Schedule reminders
pt_br: Agendar lembretes
tr_tr: Anımsatıcılar zamanlayın

source: In the event of a non-response to the survey, you can send out reminders to follow-up with the user. You can create your own reminder or select a predefined one
pt_br: No caso de não haver resposta à pesquisa, você pode enviar lembretes para fazer um acompanhamento com o usuário. Você pode criar seu próprio lembrete ou selecionar um pré-definido.
tr_tr: Ankete yanıt verilmemesi durumunda, kullanıcılara anımsatıcılar gönderebilirsiniz. Kendi anımsatıcınızı oluşturabilir veya önceden tanımlanmış bir hazır anımsatıcı seçebilirsiniz

source: Customised reminder
pt_br: Lembrete personalizado
tr_tr: Özelleştirilmiş anımsatıcı

source: Go to the **Reminders** tab
pt_br: Ir para a guia **Lembretes**
tr_tr: **Anımsatıcılar** sekmesine gidin

source: Click on **Add a reminder**.
pt_br: Clique em **Adicionar um lembrete**.
tr_tr: **Anımsatıcı ekle** seçeneğine tıklayın.

source: Enter a :
pt_br: Digite um:
tr_tr: Şunları yazın:

source: **Name**
pt_br: **Nome**
tr_tr: **Ad**

source: **Type of duration (day or month)**
pt_br: **Tipo de duração (dia ou mês)**
tr_tr: **Süre türü (gün ya da ay)**

source: The **duration** of the reminder
pt_br: A **duração** do lembrete
tr_tr: Anımsatıcı için **süre**

source: **Activate** your reminder
pt_br: **Ative** seu lembrete
tr_tr: Anımsatıcınızı **etkinleştirin**

source: custom reminder
tr_tr: Özel anımsatıcı

source: Predefined reminder
pt_br: Lembrete pré-definido
tr_tr: Hazır anımsatıcı

source: Click on **Add a predefined reminder**
pt_br: Clique em **Adicionar um lembrete predefinido**
tr_tr: **Hazır anımsatıcı ekle** seçeneğine tıklayın.

source: You will have 3 options to choose from:
pt_br: Você terá 3 opções para escolher:
tr_tr: Seçebileceğiniz 3 seçenek vardır:

source: predefined reminder
tr_tr: Hazır anımsatıcı

source: 1 week: reminder every 7 days,
pt_br: 1 semana: lembrete a cada 7 dias,
tr_tr: 1 hafta: 7 günde bir anımsatır,

source: 2 weeks: reminder every 14 days.
pt_br: 2 semanas: lembrete a cada 14 dias.
tr_tr: 2 hafta: 14 günde bir anımsatır,

source: 1 month: monthly reminder.
pt_br: 1 mês: lembrete mensal.
tr_tr: 1 ay: 1 ayda bir anımsatır,

source: Select the option that suits you and click on **Add**
pt_br: Selecione a opção que mais lhe convém e clique em **Adicionar**
tr_tr: Size uygun seçeneği seçin ve **Ekle** üzerine tıklayın

source: Limit the number of reminders
pt_br: Limite o número de lembretes
tr_tr: Anımsatıcı sayısını sınırlayın

source: In the **Setup maximum number of days to send reminder** section, enter a limit for the **Maximum number of days to send a reminder**
pt_br: Na seção **Configurar o número máximo de dias para enviar lembrete**, insira um limite para o **Número máximo de dias para enviar um lembrete**.
tr_tr: **Anımsatıcı gönderilecek en fazla gün sayısını ayarla** bölümünde, **Anımsatıcının gönderileceği en fazla gün sayısı** için bir sınır değeri yazın

source: **Example** : If a person has not responded after 3 reminders, GLPI will no longer send reminders and the satisfaction survey will then remain unanswered
pt_br: **Exemplo**: Se uma pessoa não responder após 3 lembretes, o GLPI não enviará mais lembretes e a pesquisa de satisfação ficará sem resposta.
tr_tr: **Örnek**: Bir kişi 3 anımsatmadan sonra yanıt vermezse, GLPI bir daha anımsatma göndermez ve memnuniyet anketi yanıtsız kalır.

source: reminder example
tr_tr: Anımsatıcı örneği

source: Set up the automatic action
pt_br: Configurar a ação automática
tr_tr: Otomatik işlemi ayarlayın

source: Survey reminders are sent via an automatic action already created by the plugin. Make sure that this is activated and set up correctly
pt_br: Lembretes de pesquisa são enviados por meio de uma ação automática já criada pelo plugin. Certifique-se de que isso esteja ativado e configurado corretamente.
tr_tr: Anket anımsatıcıları, eklenti tarafından önceden oluşturulmuş bir otomatik işlem ile gönderilir. Bu işlemin etkinleştirildiğinden ve doğru ayarlandığından emin olun

source: Go to **Setup > Automatic actions**
pt_br: Ir para **Configuração > Ações automáticas**
tr_tr: **Kurulum > Otomatik işlemler** bölümüne gidin

source: Select the **SatisfactionReminder** action.
pt_br: Selecione a ação **LembretedeSatisfação**.
tr_tr: **SatisfactionReminder** işlemini seçin.

source: automatic action
tr_tr: Otomatik işlem

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/Satisfaction_survey/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/Satisfaction_survey/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
pt_br: Licença Creative Commons
tr_tr: Creative Commons Lisansı
