Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/branding/index.po
Languages: tr_tr

source: Branding
tr_tr: Marka

source: Requirements (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
tr_tr: GLPI sürümü

source: Minimum PHP
tr_tr: En düşük PHP sürümü

source: Recommended
tr_tr: Önerilen

source: Install the plugin
tr_tr: Eklentiyi kurmak

source: Go to the marketplace. Download and install the **Branding** plugin.
tr_tr: Mağazaya gidin. **Marka** eklentisini indirip kurun.

source: install the plugin
tr_tr: Eklentiyi kurmak

source: Customize your instance
tr_tr: Kopyanızı özelleştirin

source: Go to **administration > entities** > **branding** tab
tr_tr: **Yönetim > Varlıklar** > **Marka** sekmesine gidin

source: Here you can replace :
tr_tr: Buradan şu değişiklikleri yapabilirsiniz:

source: the logo at top left (including folded bar)
tr_tr: Sol üstteki logo (katlanmış çubuk ile)

source: the logo on the login page,
tr_tr: Oturum açma sayfasındaki logo,

source: the background of the login page,
tr_tr: Oturum açma sayfasının arka planı,

source: the icon in the browser bar
tr_tr: Tarayıcı çubuğundaki simge

source: list of custom
tr_tr: Özelleştirmelerin listesi

source: Custom by entity
tr_tr: Varlığa göre özelleştirme

source: You can modify certain elements by entity:
tr_tr: Belirli bileşenleri varlığa göre değiştirebilirsiniz:

source: custom by entity
tr_tr: Varlığa göre özelleştirme

source: Other customisations are common to all entities
tr_tr: Diğer özelleştirmeler tüm varlıklar için ortaktır

source: Recommendations
tr_tr: Öneriler

source: **Top Left corner logo** - This can be changed according to the desired entity It is the logo you see when your GLPI page is opened and the left sidebar is expanded
tr_tr: **Sol üst köşe logosu** - İstenilen varlığa göre değiştirilebilir. GLPI sayfanız açıldığında ve sol kenar çubuğu genişletildiğinde görüntülenen logodur.

source: Default recommended size: **100x55 pixels**
tr_tr: Varsayılan önerilen boyut: **100x55 piksel**

source: **Lop Left corner logo** (collapsed sidebar) - This can be changed according to the desired entity It is the logo you see when your GLPI page is opened and the left sidebar is collapsed.
tr_tr: **Lop sol köşe logosu** (daraltılmış kenar çubuğu) - İstenilen varlığa göre değiştirilebilir. GLPI sayfanız açıldığında ve sol kenar çubuğu daraltıldığında görüntülenen logodur.

source: Default recommended size **40x40 pixels**
tr_tr: Varsayılan önerilen boyut: **40x40 piksel**

source: **Favicon** It is the logo you see next to the page title at the beginning of your browser’s the tab.
tr_tr: **Favicon** Tarayıcınızın sekmesi açıldığında sayfa başlığının yanında görüntülenen logodur.

source: Default recommended size: **16x16 or 32x32 pixels**
tr_tr: Varsayılan önerilen boyut: **16x16 ya da 32x32 piksel**

source: **Login page logo** It is the logo you see before you login. It appears with the fields to fill with your username and password
tr_tr: **Oturum açma sayfası logosu** Oturum açmadan önce görüntülenen logodur. Kullanıcı adının ve parolanın yazılması gereken alanlarla birlikte görüntülenir.

source: Default recommended size: **220x130 pixels**
tr_tr: Varsayılan önerilen boyut: **220x130 piksel**

source: **Login page background** It is the image you can add as a background at the login page.
tr_tr: **Oturum açma sayfası arka planı** Oturum açma sayfasının arka planı olarak ekleyebileceğiniz görseldir.

source: Default recommended size: **It depends on the usual size of your screens**. The bigger, the better. (Make sure not to surpass the maximum upload limit for files)
tr_tr: Varsayılan önerilen boyut: **Ekranlarınızın genel boyutuna bağlıdır**. Ne kadar büyükse o kadar iyidir. (Dosyalar için en büyük yükleme sınırını aşmamaya dikkat edin)

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/Branding/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/Branding/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
