Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/treeview/index.po
Languages: cs_cz, ko_kr

source: Treeview
cs_cz: Stromový pohled
ko_kr: 트리뷰

source: Requirements for latest version
cs_cz: Požadavky pro poslední verzi
ko_kr: 최신판 요구사항

source: Features
cs_cz: Funkce
ko_kr: 특징

source: This plugin allows you to browse through your inventory via a tree view in a panel located on the left side of the screen.
cs_cz: Tento zásuvný modul umožňuje procházet váš inventář prostřednictvím stromového zobrazení v panelu umístěném na levé straně obrazovky.
ko_kr: 이 플러그인은 화면의 왼쪽에 위치된 패널 내에 트리뷰를 통해 물품을 탐색하게 해 줍니다.

source: You can browse the tree of your site to see the equipment.
cs_cz: Můžete procházet strom na své stránce pro zobrazení jednotlivých zařízení.
ko_kr: 사이트의 트리를 탐색하여 비품들을 볼 수 있습니다.

source: Install the Plugin
cs_cz: Instalovat zásuvný modul
ko_kr: 플러그인 설치

source: Uncompress the archive.
cs_cz: Rozbalit archiv.
ko_kr: 아카이브를 압축해제 합니다.

source: Move the ``tag`` directory to the ``<GLPI_ROOT>/plugins`` directory
cs_cz: Přesunout adresář "tag" do adresáře "<GLPI_ROOT>/plugins"
ko_kr: ``tag`` 디렉토리를 ``<GLPI_ROOT>/plugins`` 디렉토리로 이동

source: Navigate to the *Configuration > Plugins* page,
cs_cz: Přejděte na stránku *Nastavení > Zásuvné moduly*,
ko_kr: *Configuration > Plugins* 페이지로 이동해서,

source: Install and activate the plugin.
cs_cz: Instalovat a aktivovat zásuvný modul.
ko_kr: 플러그인을 설치하고 활성화 합니다.

source: Usage
cs_cz: Použití
ko_kr: 사용

source: The plugin will create required tables in the database automatically. Those tables will be updated along with the plugin.
cs_cz: Zásuvný modul automaticky vytvoří požadované tabulky v databázi. Tyto tabulky budou aktualizovány zásuvným modulem.
ko_kr: 플러그인은 자동으로 데이터베이스에 필수 테이블을 생성하게됩니다. 해당 테이블들은 플러그인과 함께 갱신되게 됩니다.

source: Plugin configuration is quite simple:
cs_cz: Konfigurace zásuvného modulu je poměrně jednoduchá:
ko_kr: 플러그인 구성은 아주 간단합니다:

source: You will access the create form from the *Setup* > *Plugins* > *treeview*.
cs_cz: K formuláři pro vytvoření se dostanete z * Nastavení *> * Zásuvné moduly *> * Stromové zobrazení *.
ko_kr: *설정* > *플러그인* > *트리뷰* 에서 양식 생성에 접근하게 됩니다.

source: Target for all node : on clic on node, redirect to new window
cs_cz: Cíl pro všechny uzly: kliknutím na uzel, přesměrovat do nového okna
ko_kr: 모든 노드 대상 : 노드를 클릭하면, 새 창으로 리디렉션

source: Nodes can be highlighted : highlight selcted node or not
cs_cz: Uzly lze zvýraznit: zvýrazněný vybraného uzlu nebo nikoliv
ko_kr: 노드를 강조 표시할 수 있음 : 선택된 노드의 강조 유무

source: Tree is drawn with lines : display or not
cs_cz: Strom je nakreslen čárami: zobrazit či nikoliv
ko_kr: 트리에 선 그리기 : 표시 유무

source: Tree is drawn with icons : Display or not icon for node
cs_cz: Strom je nakreslen ikonami: Zobrazit nebo nezobrazit ikonu pro uzel
ko_kr: 트리에 아이콘 그리기 : 노드에 대한 아이콘 표시 유무

source: Only one node within a parent can be expanded at the same time : more tthan one parent node can be expand at same time
cs_cz: Současně lze rozbalit pouze jeden uzel v rámci nadřazené jednotky: současně lze rozbalit více než jeden nadřazený uzel
ko_kr: 한 부모 내에서 하나의 노드만이 동시에 확장될 수 있습니다 : 하나 이상의 부모 노드를 동시에 확장할 수 있습니다

source: Item name : name or inventory number or name + inventory number or inventory number + name
cs_cz: Název položky: název nebo inventární číslo nebo název + inventární číslo nebo inventární číslo + název
ko_kr: 아이템 이름 : 이름 또는 물품 번호 또는 이름 + 물품 번호 또는 물품 번호 + 이름

source: Location name : short name or long name or long name + comment or long name + comment
cs_cz: Název umístění: krátký název nebo dlouhý název nebo krátký název + komentář nebo dlouhý název + komentář
ko_kr: 위치 이름 : 짧은 이름 또는 긴 이름 또는 긴 이름 + 댓글 또는 긴 이름 + 댓글
