Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/scim/entra.po
Languages: tr_tr

source: References
tr_tr: Başvurular

source: `Use SCIM to provision users and groups <https://learn.microsoft.com/en-us/entra/identity/app-provisioning/use-scim-to-provision-users-and-groups#integrate-your-scim-endpoint-with-the-azure-ad-provisioning-service>`_
tr_tr: `Kullanıcıları ve grupları sağlamak için SCIM kullanımı <https://learn.microsoft.com/en-us/entra/identity/app-provisioning/use-scim-to-provision-users-and-groups#integrate-your-scim-endpoint-with-the-azure-ad-provisioning-service>`_

source: Setup
tr_tr: Kurulum

source: Create application
tr_tr: Uygulamayı oluşturun

source: Connect to your `Azure portal <https://aad.portal.azure.com/>`_
tr_tr: `Azure portal <https://aad.portal.azure.com/>`_ sayfasını açın

source: Click on **Add**
tr_tr: **Ekle** üzerine tıklayın

source: then **Enterprise application**.
tr_tr: **Kurumsal uygulama** üzerine tıklayın

source: add application
tr_tr: Uygulama ekleyin

source: Click on **Create your application**.
tr_tr: **Uygulamanızı oluşturun** üzerine tıklayın.

source: In the section that appears on the right, enter the name of your application and choose the 3rd option **`integrate any other application don't find in the gallery`**.
tr_tr: Sağ tarafta çıkan bölüme uygulamanızın adını yazın ve 3. seçenek olan **Galeride bulunmayan herhangi bir uygulamayı bütünleştir** seçeneğini seçin.

source: create application
tr_tr: Uygulamayı oluşturun

source: Setup the application
tr_tr: Uygulamayı kurmak

source: Once you've created your application, go to **Provisioning**.
tr_tr: Uygulamanızı oluşturduktan sonra **Sağlama** bölümüne gidin.

source: add provisionning
tr_tr: Sağlama ekle

source: Select **Automatic**.
tr_tr: **Otomatik** seçin.

source: Specify the **URL** `generated earlier <setup_plugin.html>`_ from GLPI and paste the **token**.
tr_tr: GLPI üzerindenden daha önce oluşturulan **Adres** değerini belirtin ve **Kod** değerini yapıştırın.

source: Make sure you **paste the token (JWT token)** to ensure your application works properly.
tr_tr: Uygulamanızın düzgün çalışmasını sağlamak için **Kodu (JWT kodu) yapıştırdığınızdan** emin olun.

source: setup provisionning
tr_tr: Sağlamayı kurun

source: Click on Test connection. A message will appear informing you of the successful connection.
tr_tr: Bağlantıyı sına üzerine tıklayın. Bağlantı kurulduğunda sizi bilgilendiren bir ileti görüntülenir.

source: On the same page, you can also configure an email address and a number in case of failure or accidental deletions.
tr_tr: Aynı sayfada, başarısızlık veya yanlışlıkla silme durumunda kullanabileceğiniz bir e-posta adresi ve numara da yapılandırabilirsiniz.

source: check provisionning
tr_tr: Sağlamayı denetleyin

source: Click on **Save**
tr_tr: **Kaydet** üzerine tıklayın

source: Synchronising all users
tr_tr: Tüm kullanıcıları eşitlemek

source: You can choose to synchronise your entire directory.
tr_tr: Tüm dizininizi eşitlemeyi seçebilirsiniz.

source: Go to the **Settings > Scope** tab and select **Sync all users and groups**.
tr_tr: **Ayarlar > Kapsam** sekmesine gidin ve **Tüm kullanıcılar ve gruplar eşitlensin** seçeneğini seçin.

source: sync all
tr_tr: Tümünü eşitleyin

source: Synchronising selected groups and users (default option)
tr_tr: Seçilmiş grupları ve kullanıcıları eşitlemek (varsayılan seçenek)

source: You can choose to synchronise only certain groups and/or users. When refreshing the **`Provisioning`** page
tr_tr: Yalnızca belirli grupları ve/veya kullanıcıları eşitlemeyi seçebilirsiniz. **`Sağlama`** sayfasını yenilerken

source: Go to the **Parameters > Scope** tab
tr_tr: **Parametreler > Kapsam** sekmesine gidin

source: Select **Synchronise assigned users and groups only**
tr_tr: **Yalnızca atanmış kullanıcılar ve gruplar eşitlensin** seçeneğini belirleyin

source: sync selection
tr_tr: Eşitleme seçimi

source: Then go to **Users and groups**
tr_tr: Ardından **Kullanıcılar ve gruplar** bölümüne gidin

source: Click on **Add a user/group**
tr_tr: **Kullanıcı/grup ekle** üzerine tıklayın

source: Click on **No selection**
tr_tr: **Seçim yok** üzerine tıklayın

source: Select the groups and users you want in the box on the right
tr_tr: Sağdaki kutudan istediğiniz grupları ve kullanıcıları seçin

source: Then **Select** and **Assign**.
tr_tr: Ardından **Seç** ve **Ata** üzerine tıklayın.

source: select users/groupes
tr_tr: Kullanıcıları/grupları seçin

source: Activate provisioning
tr_tr: Sağlamayı etkinleştirin

source: In the **Provisioning** section
tr_tr: "Sağlama" bölümüne gidin

source: Change the status from **Disabled** to **Enabled**
tr_tr: Durumu **Etkisiz** yerine **Etkin** olarak değiştirin

source: enable sync
tr_tr: Eşitlemeyi etkinleştirin

source: Check synchronisation status
tr_tr: Eşitleme durumunu denetleyin

source: In the **Overview** section, you can check that synchronisation has been successful.
tr_tr: **Özet** bölümünden eşitlemenin başarılı olup olmadığını kontrol edebilirsiniz.

source: On the GLPI side, Go to the **Request log** section of your SCIM plugin **Setup** > **SCIM identity servers** to check that the accounts are correctly synchronised.
tr_tr: GLPI tarafında, hesapların doğru olarak eşitlendiğini kontrol etmek için SCIM eklentinizin **Kurulum** > **SCIM kimlik sunucuları** bölümünden **İstek günlüğü** bölümüne gidin.

source: See the procedure for setting up the `OAuth SSO <https://glpi-plugins.readthedocs.io/en/latest/oauthsso/entra.html>`_ plugin to authenticate users on GLPI.
tr_tr: GLPI üzerinde kullanıcıların kimliğini doğrulamak için `OAuth SSO <https://glpi-plugins.readthedocs.io/en/latest/oauthsso/entra.html>`_ eklentisini kurma yönergesine bakın.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
