Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/scim/okta.po
Languages: tr_tr

source: References
tr_tr: Başvurular

source: `Understanding SCIM <https://developer.okta.com/docs/concepts/scim/>`_
tr_tr: `SCIM nedir <https://developer.okta.com/docs/concepts/scim/>`_

source: `Add SCIM provisioning to app integrations <https://help.okta.com/en-us/Content/Toimages/Apps/Apps_App_Integration_Wizard_SCIM.htm>`_
tr_tr: `Uygulama bütünleştirmelerine SCIM sağlayıcısını eklemek <https://help.okta.com/en-us/Content/Toimages/Apps/Apps_App_Integration_Wizard_SCIM.htm>`_

source: `Assign applications to users <https://help.okta.com/en-us/Content/Toimages/users-groups-profiles/usgp-assign-apps.htm>`_
tr_tr: `Uygulamaları kullanıcılara atamak <https://help.okta.com/en-us/Content/Toimages/users-groups-profiles/usgp-assign-apps.htm>`_

source: Create application
tr_tr: Uygulamayı oluşturun

source: From your `OKTA portal <https://login.okta.com/>`_
tr_tr: `OKTA portal <https://login.okta.com/>`_ panonuza gidin

source: Click on **Applications**
tr_tr: **Uygulamalar** üzerine tıklayın

source: And **Create app integration**
tr_tr: **Uygulama bütünleştirmesi oluştur** üzerine tıklayın

source: Okta create app
tr_tr: OKTA uygulaması oluşturun

source: Select **SWA - Secure Web Authentication**
tr_tr: **SWA - Secure Web Authentication** üzerine tıklayın

source: Select SWA Sign in
tr_tr: SWA oturum açmayı seçin

source: Add a name to your application
tr_tr: Uygulamanıza bir ad verin

source: Add the URL of your GLPI instance (this will redirect your user to your GLPI if this application is avaiblable to the OKTA user portal)
tr_tr: GLPI kopyanızın adresini ekleyin (böylece bu uygulama OKTA kullanıcı portalında varsa kullanıcınız GLPI sitenize yönlendirilir)

source: Click **Finish**
tr_tr: **Finish** üzerine tıklayın

source: add integration
tr_tr: Bütünleştirme ekleyin

source: Setup the application
tr_tr: Uygulamayı kurmak

source: Go back to **General**
tr_tr: **General** bölümüne dönün

source: Click **Edit**
tr_tr: **Edit** üzerine tıklayın

source: Name the label
tr_tr: Etiketi adlandırın

source: Select SCIM to activate the service
tr_tr: Hizmeti etkinleştirmek için SCIM olarak seçin

source: Click **Save**
tr_tr: **Save** üzerine tıklayın

source: setup general
tr_tr: Genel kurulum

source: To setup the provisioning, you need to setup GLPI. Refer to `setup GLPI <setup_plugin.html>`_ to configure **URL API** and **JWT Token**
tr_tr: Sağlama işlemini kurmak için GLPI kurmanız gerekir. **API adresi** ve **JWT kodu** değerlerini yapılandırmak için `GLPI kurulumu <setup_plugin.html>`_ bölümüne bakın

source: Copy the **API URL** and the **JWT token**, you need to paste this information in OKTA.
tr_tr: **API adresi** ve **JWT kodu** değerlerini kopyalayın. Bu bilgileri OKTA üzerine yapıştırmanız gerekiyor.

source: Go back to your OKTA application
tr_tr: OKTA uygulamanıza geri dönün

source: Paste the API URL
tr_tr: API adresini yapıştırın

source: Select the Unique identifier field for users (*name.familyName, phoneNumber, name.givenName, id, userName, email,* etc. This will be the method to authenticate the users)
tr_tr: Kullanıcılar için benzersiz tanımlayıcı alanını seçin (*name.familyName, phoneNumber, name.givenName, id, userName, email,* vb. Bu tanımlayıcı, kullanıcıları doğrulama yöntemi olur)

source: Select the actions which can be supported
tr_tr: Desteklenebilecek işlemleri seçin

source: Select **HTTP Header**
tr_tr: **HTTP Header** seçin

source: Paste the **JWT token**
tr_tr: **JWT kodu** değerini yapıştırın

source: You need to **paste the JWT token** not the secret
tr_tr: **JWT kodunu yapıştırmanız** gerekiyor, parolayı değil

source: setup provisionning
tr_tr: Sağlamayı kurun

source: Click **Test Connector Configuration**
tr_tr: **Bağlantı yapılandırmasını sına** üzerine tıklayın

source: Test connection
tr_tr: Bağlantıyı sınayın

source: you can now **close** this window and **save** your configuration
tr_tr: Artık bu pencereyi **kapatabilir** ve yapılandırmanızı **kaydedebilirsiniz**

source: Always in **provisioning**, you can edit and select the possible actions for updating your user data.
tr_tr: Her zaman **sağlama** aşamasında, kullanıcı verilerinizi güncellemek için olası işlemleri düzenleyebilir ve seçebilirsiniz.

source: We recommand to unselect **Sync Password** and use `OAuth SSO <https://glpi-plugins.readthedocs.io/en/latest/oauthsso/okta.html>`_ to authenticate your user.
tr_tr: Kullanıcınızı doğrulamak için **Parolayı eşitle** seçeneğinin işaretini kaldırmanızı ve `OAuth SSO <https://glpi-plugins.readthedocs.io/en/latest/oauthsso/okta.html>`_ kullanmanızı öneririz.

source: Enable update data
tr_tr: Güncelleme verilerini etkinleştirin

source: The last step is to assign your application to users
tr_tr: Son adım, uygulamanızı kullanıcılara atamaktır

source: Synchronising all users
tr_tr: Tüm kullanıcıları eşitlemek

source: Go to admin console
tr_tr: Yönetim panosuna gidin

source: Select **Directory > Groups**
tr_tr: **Dizin > Gruplar** seçin

source: Select **Everyone**
tr_tr: **Herkes** seçin

source: In **Applications**, click **Assign applications**
tr_tr: **Uygulamalar** bölümünde **Uygulamaları ata** üzerine tıklayın

source: Click on assign on your SCIM application
tr_tr: SCIM uygulamanızda atamayı tıklayın

source: Click **Save and Go Back**
tr_tr: **Kaydedip geri dön** üzerine tıklayın.

source: assign everyone
tr_tr: Herkesi atayın

source: Synchronising selected groups and users
tr_tr: Seçilmiş grupları ve kullanıcıları eşitlemek

source: Select **Directory > People**
tr_tr: **Dizin > Kişiler** seçin

source: Select the **User** you want to import
tr_tr: İçe aktarmak istediğiniz **Kullanıcı** kaydını seçin

source: Repeat this step for all users and groups you want to import.
tr_tr: İçe aktarmak istediğiniz tüm kullanıcılar ve gruplar için bu adımı yineleyin.

source: See the procedure for setting up the `OAuth SSO <https://glpi-plugins.readthedocs.io/en/latest/oauthsso/okta.html>`_ plugin to authenticate users in GLPI.
tr_tr: GLPI üzerinde kullanıcıların kimliğini doğrulamak için `OAuth SSO <https://glpi-plugins.readthedocs.io/en/latest/oauthsso/okta.html>`_ eklentisini kurma yönergesine bakın.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
