Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/oauthimap/index.po
Languages: ko_kr, tr_tr

source: Download
tr_tr: İndir

source: Sources
tr_tr: Kaynaklar

source: Microsoft is gradually removing the TLS 1.0 and 1.1 protocols for all Microsoft 365 applications. In order to keep your collector running, you need to add the **Oauth IMAP** plugin, which is available in the marketplace.
tr_tr: Microsoft, tüm Microsoft 365 uygulamaları için TLS 1.0 ve 1.1 iletişim kurallarını kademeli olarak kaldırıyor. Toplayıcınızı çalışır durumda tutmak için, pazarda bulunan **Oauth IMAP** eklentisini eklemelisiniz.

source: The Oauth tokens for the collector, retrieved during authentication with Azure by the OauthIMAP plugin, are “offline” tokens that delegate authorisation to a third-party application (GLPI). These tokens provide a renewal code that will be used by the application to renew them automatically without user intervention. You will therefore not be asked to re-authenticate after the 1st authorisation request.
tr_tr: OauthIMAP eklentisi tarafından Azure ile kimlik doğrulaması sırasında alınan toplayıcı için OAuth kodları, yetkilendirmeyi üçüncü taraf bir uygulamaya (GLPI) devreden "çevrim dışı" kodlardır. Bu kodlar, kullanıcı etkileşimi olmadan uygulama tarafından otomatik olarak yenilemek için kullanılacak yenileme kodlarıdır. Bu nedenle, 1. yetkilendirme isteğinden sonra yeniden kimlik doğrulamanız istenmez.

source: Requirements (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
tr_tr: GLPI sürümü

source: Minimum PHP
tr_tr: En düşük PHP sürümü

source: Recommended
tr_tr: Önerilen

source: Supported mail services
tr_tr: Desteklenen e-posta hizmetleri

source: OAuth IMAP support :
tr_tr: OAuth IMAP desteği:

source: Install the plugin
tr_tr: Eklentiyi kurmak

source: Go to the marketplace. Download Oauth IMAP and enable it
tr_tr: Mağazaya gidin. Oauth IMAP eklentisini indirip etkinleştirin

source: Open the `Azure Portal <https://portal.azure.com/#home>`_ for your tenant
tr_tr: Kiracınız için `Azure Portal <https://portal.azure.com/#home>`_ arayüzünü açın

source: In the search box type **registration**
tr_tr: Arama kutusuna **kayıt** yazın

source: then select **App registrations**
tr_tr: ardından **Uygulama kayıtları** ögesini seçin

source: add app Entra
tr_tr: Uygulamayı Entra üzerine ekleyin

source: Here are the configuration steps including configuration phases on the Entra side.
tr_tr: Entra tarafındaki yapılandırma ile birlikte yapılandırma adımları şu şekildedir.

source: Register your Entra application
tr_tr: Entra uygulamanızı kaydedin

source: Create the application
tr_tr: Uygulamayı oluşturun

source: Click on **New registration**
tr_tr: **Yeni kayıt** üzerine tıklayın

source: Enter the desired name, select the type of account supported then enter the redirection URL (present in the configuration of the plugin from your GLPI interface: https://XXXXXXXXXXXXXX/marketplace/oauthimap/front/authorization.callback.php) specifying the **Web** option
tr_tr: İstediğiniz adı yazın, desteklenen hesap türünü seçin ve ardından **Web** seçeneğini seçerek yönlendirme adresini yazın (GLPI arayüzünüzdeki eklenti yapılandırmasında bulunur: https://XXXXXXXXXXXXXX/marketplace/oauthimap/front/authorization.callback.php)

source: Then click on **Register**.
tr_tr: Ardından **Kaydet** üzerine tıklayın

source: register app
tr_tr: Uygulamayı kaydedin

source: Add a secret
tr_tr: Bir parola belirtin

source: In the **Certificates and secrets** tab
tr_tr: **Sertifikalar ve parolalar** sekmesinde

source: Click on **Client secrets**
tr_tr: **İstemci parolaları** üzerine tıklayın

source: Then **New client secret**
tr_tr: Ardından **Yeni istemci parolası** üzerine tıklayın

source: add secret
tr_tr: Parolayı ekleyin

source: Enter a description and then an expiration date
tr_tr: Bir açıklama yazın ve ardından bir son geçerlilik sonu tarihi belirtin

source: A secret **value** is then generated. Keep this value well because once you have left this page, it will no longer be recoverable
tr_tr: Ardından bir parola **değeri** oluşturulur. Bu değeri iyi saklayın çünkü bu sayfadan ayrıldıktan sonra bir daha görüntülenmez

source: select value secret
tr_tr: Parola değerini seçin

source: Return to the **Overview** tab and **copy** the following values ​​and the secret seen above
tr_tr: **Özet** sekmesine dönün ve aşağıdaki değerler ile yukarıda görülen parolayı **kopyalayın**

source: overview
tr_tr: Özet

source: Setup GLPI
tr_tr: GLPI kurulumu

source: Now go back to your GLPI interface **Setup > Application Aouth IMAP** and indicate the information collected previously :
tr_tr: Şimdi GLPI arayüzünüze dönün, **Kurulum > OAuth IMAP uygulaması** bölümüne gidin ve daha önce topladığınız bilgileri belirtin:

source: setup GLPI
tr_tr: GLPI kurulumu

source: Click **Add**
tr_tr: **Ekle** üzerine tıklayın

source: Now in the **Oauth authorization** tab, click **Create an authorization**
tr_tr: **OAuth yetkilendirmesi** sekmesinden, **Bir yetkilendirme oluştur** üzerine tıklayın

source: Oauth Auhorization
tr_tr: OAuth yetkilendirmesi

source: When you click on **Create authorization**, you will be redirected to the Microsoft services sign-in page
tr_tr: **Yetkilendirmeyi oluştur** üzerine tıkladığınızda Microsoft hizmetleri oturum açma sayfasına yönlendirileceksiniz

source: Enter the email address and password of the account that will be used for the collector
tr_tr: Toplayıcı için kullanılacak hesabın e-posta adresini ve parolasını yazın

source: You will also need to accept the necessary permissions related to the plugin.
tr_tr: Eklentiyle ilgili gerekli izinleri de vermeniz gerekecektir.

source: app Auhorization
tr_tr: Uygulama yetkilendirmesi

source: check account
tr_tr: Hesabı denetle

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/OAuth_IMAP/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/OAuth_IMAP/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
tr_tr: Creative Commons Lisansı

source: Sources link: https://github.com/pluginsGLPI/oauthimap
ko_kr: 원본 링크: https://github.com/pluginsGLPI/oauthimap

source: Download: https://github.com/pluginsGLPI/oauthimap/releases
ko_kr: 다운로드: https://github.com/pluginsGLPI/oauthimap/releases

source: Features
ko_kr: 기능

source: This plugin supports Oauth connection for emails receivers.
ko_kr: 이 플러그인은 이메일 수신자들에 대한 Oauth 연결을 지원합니다.

source: Supported mail services:
ko_kr: 지원되는 이메일 서비스:

source: `G Suite and Gmail <https://developers.google.com/gmail/imap/xoauth2-protocol>`_,
ko_kr: `G Suite 와 Gmail <https://developers.google.com/gmail/imap/xoauth2-protocol>`_,

source: Install the Plugin
ko_kr: 플러그인 설치

source: Plugin is available inside GLPI marketplace.
ko_kr: 플러그인은 GLPI 마켓플레이스에서 사용할 수 있습니다.

source: You can also install it manually:
ko_kr: 수동으로도 설치할 수 있습니다:

source: Uncompress the archive.
ko_kr: 아카이브 압축해제.

source: Move the ``oauthimap`` directory to the ``<GLPI_ROOT>/plugins`` directory.
ko_kr: ``oauthimap`` 디렉토리를 ``<GLPI_ROOT>/plugins`` 디렉토리로 이동합니다.

source: Navigate to the *Configuration > Plugins* page.
ko_kr: *구성 > 플러그인* 페이지로 탐색합니다.

source: Install and activate the plugin.
ko_kr: 설치 및 플러그인 활성화.

source: Register an external application on service provider management console;
ko_kr: 서비스 공급자 관리 콘솔에 외부 어플리케이션을 등록합니다;

source: Copy callback url from the plugin configuration and fill it in the provider console (GLPI will be called back after authentication process).
ko_kr: 플러그인 구성에서 콜백 url을 복사하여 공급자 콘솔에 입력합니다 (GLPI가 인증 절차 뒤에 다시 호출함).

source: Create an authorization
ko_kr: 인증 생성

source: You can create an authorization for each of the mailboxes you want to use in mail receivers. When you create an authorization for a mailbox, previously existing authorizations for this mailbox are discarded.
ko_kr: 메일 수신자에서 사용하려는 각 메일함에 대한 권한을 생성할 수 있습니다. 메일함에 대한 권한을 만들면, 이 메일함에 대한 이전의 기존 권한이 삭제됩니다.

source: Configure your mail receiver
ko_kr: 메일 수신자 구성

source: To authenticate via Oauth on your mail receiver, you have to change the configuration of your mail receiver:
ko_kr: 메일 수신자에서 Oauth를 통해 인증하려면, 메일 수신자의 구성을 변경해야 합니다:

source: then choose an existing authorization in the *Login* dropdown of select *Create authorization for another user*.
ko_kr: 그다음 *다른 사용자에 대한 인증 생성* 선택의 *로그인* 드롭다운에서 기존 인증을 선택하세요.
