Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/empty/index.po
Languages: cs_cz, fr_fr, pt_pt, tr_tr, zh_cn

source: The release process will automatically compile every ``PO`` file it will found in your ``locales`` directory. But you probably want the sources to contain the latests ``MO`` files, for testing purposes. The release script provide the ``--compile-mo`` (or ``-m``) to achieve that:
cs_cz: Proces vydávání automaticky zkompiluje každý ``PO`` soubor který nalezne ve složce ``locales``. Pro účely testování ale nejspíš chcete, aby zdrojové kódy obsahovaly nejnovější ``MO`` soubory. Skript pro vydávání pro toto nabízí volbu ``--compile-mo`` (nebo ``-m``):
fr_fr: Le processus de release compilera chaque fichier ``PO`` trouvé dans le répertoire ``locales``. Vous souhaiterez certainement que les derniers fichiers ``MO`` soient présents dans els sources, à des fins de tests. Le script de release fournit l'option ``--compile-mo`` (ou ``-m``) pour cela.
pt_pt: O processo de liberação compilará automaticamente todos os arquivos ``PO`` que serão encontrados em seu diretório ``locales``. Mas provavelmente quer que as fontes contenham os últimos arquivos ``MO```, para fins de teste. O script de lançamento fornece o ``—compile-mo``` (ou ``-m``) para conseguir isso:
tr_tr: Yayınlama sürecinde ``locales`` klasöründeki her ``PO`` dosyası otomatik olarak derlenir. Ancak büyük olasılıkla deneme amacıyla kaynak kodlarında son ``MO`` dosyalarının bulunmasını istersiniz. Yayınlama betiğinde bu işlemi gerçekleştirmek için ``--compile-mo`` (ya da ``-m``) seçeneği sunulur:
zh_cn: 发布过程将自动编译它将在``locales``目录中找到的每个``PO``文件。但是你可能希望源包含最后的``MO``文件，用于测试目的。发布脚本提供``--compile-mo``（或``-m``）来实现：

source: The above command will work on your plugins files directly; not on a copy as does other commands.
cs_cz: Výše uvedený příkaz bude fungovat pouze přímo na souborech vašeho zásuvného modulu; nikoli na kopii jako ostatní příkazy.
fr_fr: La commande ci-dessus travaillera directement sur vos fichier et non sur une copie, à l'inverse des autres commandes.
pt_pt: O comando acima funcionará diretamente nos seus arquivos plugins; não em uma cópia como os outros comandos.
tr_tr: Bu komut yukarıdaki diğer komutlar gibi uygulama eki dosyalarınızın kopyaları üzerinde değil, doğrudan uygulama eki dosyalarınızın üzerinde çalışır.
zh_cn: 以上命令将直接对您的插件文件起作用；不像其他命令那样在副本上。

source: Pre-releases
cs_cz: Předběžná vydání
fr_fr: Pré-releases
pt_pt: Pré-lançamentos
tr_tr: Ön yayınlar
zh_cn: 预览版

source: Per default, the release script will work only on existing tags. Any pre-release should have its own tag; but you may want to create a release archive without any tags in some circumstances.
cs_cz: Ve výchozím stavu, skript pro vydávání bude fungovat pouze na existujících štítcích. Jakékoli předběžné vydání by mělo mít svůj štítek; ale v některých případech může být třeba vytvořit archiv vydání bez jakýchkoli štítků.
fr_fr: Par défaut, le script de release ne travaillera que sur des tags existants. Toute pré-release devrait être dûment taguée ; mais il est possible que vous souhaitiez créer une archive sans tag dans certaines circonstances.
pt_pt: Por padrão, o script de lançamento funcionará somente em tags existentes. Qualquer pré-lançamento deve ter sua própria tag; mas pode querer criar um arquivo de lançamento sem nenhuma tag em algumas circunstâncias.
tr_tr: Varsayılan olarak yayınlama betiği yalnız var olan etiketler üzerinde çalışır. Herhangi bir ön yayının kendi etiketi olmalıdır. Ancak bazı durumlarda herhangi bir etiketi olmayan bir yayın arşivi oluşturmak isteyebilirsiniz.
zh_cn: 默认情况下，发布脚本仅适用于现有标记。任何预发布都应该有自己的标签；但在某些情况下，您可能希望创建没有任何标记的版本存档。

source: In order to tell the release script what it should archive, you'll have to specify several parameters:
cs_cz: Co umístit do archivu se skriptu pro vydávání zadává několika parametry:
fr_fr: Pour indiquer au script de release ce qu'il doit archiver, vous devrez spécifier plusieurs paramètres :
pt_pt: Para dizer ao script de lançamento o que ele deve arquivar, terá que especificar vários parâmetros:
tr_tr: Yayınlama betiğinde bu işlemi gerçekleştirmek için bir kaç parametre belirtmeniz gerekir:
zh_cn: 为了告诉发布脚本它应归档的内容，您必须指定几个参数：

source: ``--commit`` (or ``-c``) giving the commit hash,
cs_cz: ``--commit`` (nebo ``-c``) dávající otisk příspěvku,
fr_fr: ``--commit`` (or ``-c``) fournissant le hash du commit,
pt_pt: “—comprometer” (ou ``-c```) dando o hash de submissão,
tr_tr: ``--commit`` (ya da ``-c``) commit karmasını verir,
zh_cn: ``--commit``（或``-c``）给出提交哈希，

source: ``--release`` (or ``-r``) giving the release version (usually, it will be the next release version),
cs_cz: ``--release`` (nebo ``-r``) dávající verzi vydání (obvykle to bude další verze vydání),
fr_fr: ``--release`` (ou ``-r``) fournissant la version (habituellement, la version à venir),
pt_pt: (ou ``-r``) dando a versão de lançamento (normalmente, será a próxima versão de lançamento),
tr_tr: ``--release`` (ya da ``-r``) yayın sürümünü verir (genellikle bir sonraki yayın sürümüdür),
zh_cn: ``--release``（或``-r``）给出发布版本（通常，它将是下一个发行版本），

source: ``--extra`` (or ``-e``) to specify an extra string (such as *alpha*, *beta*, *rc1*, etc...)
cs_cz: ``--extra`` (nebo ``-e``) pro zadání dalšího řetězce (jako třeba *alpha*, *beta*, *rc1*, atd…)
fr_fr: ``--extra`` (or ``-e``) pour préciser une chaîne complémentaire (telle que *alpha*, *beta*, *rc1*, etc...)
pt_pt: (ou ``-e``) para especificar uma string extra (como *alpha*, *beta*, *rc1*, etc…)
tr_tr: ``--extra`` (ya da ``-e``) ek bir dizge belirtmek için kullanılır (*alpha*, *beta*, *rc1* gibi)
zh_cn: ``--extra``（或``-e``）指定一个额外的字符串（例如* alpha *，* beta *，* rc1 *等...）

source: As an example with the *order* plugin:
cs_cz: Jako příklad se zásuvným modulem *objednávky*:
fr_fr: Par exemple pour le plugin *order* :
pt_pt: Como exemplo com a * order * plugin :
tr_tr: Örnek olarak *sipariş* uygulama eki için:
zh_cn: 作为* order *插件的示例：

source: Signing releases
cs_cz: Podepisování vydání
fr_fr: Signature des releases
pt_pt: Lançamentos de assinatura
tr_tr: Sürümleri imzalamak
zh_cn: 签署版本

source: Signing releases with a GPG key would permit users to check download integrity before installing. You'll need a GPG key publically available to users; the sign option is activated per default, you can deactivate using the ``--nosign`` (or ``-S``) option.
cs_cz: Podepisování vydání GPG klíčem umožňuje uživatelům ověřovat neporušenost před instalací. Budete potřebovat GPG klíč veřejně dostupný uživatelům; volba podepisování je ve výchozím stavu zapnutá, je možné ji vypnout pomocí volby ``--nosign`` (nebo ``-S``).
fr_fr: La signature des releases avec une clé GPG permettra aux utilisateurs de vérifier l'intégrité du téléchargement avant l'installation. Vous aurez besoin d'une clé GPG difussée publiquement ; l'option signature est active par défaut, vous pouvez la désactiver en utilisant l'option ``--nosign`` (ou ``-S``).
pt_pt: Assinar versões com uma chave GPG permitiria que os utilizadores verificassem a integridade do download antes da instalação. Necessitará uma chave GPG publicamente disponível aos utilizadores; a opção do sinal é ativada por o defeito, pode desativar usando o ``—nosign``` (ou ``-S``) opção.
tr_tr: Yayın sürümlerinin GPG anahtarı ile imzalanması kullanıcıların yüklemeden önce indirdikleri dosyanın sorunsuz olduğunu anlamalarını sağlar. Bu işlem için herkese açık olarak sunacağınız bir GPG anahtarına gerek vardır. İmzalama seçeneği varsayılan olarak etkindir. ``--nosign`` (ya da ``-S``) seçeneği kullanılarak devre dışı bırakılabilir.
zh_cn: 使用GPG密钥签名版本将允许用户在安装之前检查下载完整性。您需要向用户公开提供GPG密钥；默认情况下会激活sign选项，您可以使用``--nosign``（或``-S``）选项取消激活。

source: A file containing the signature with the same name as the archive with a ``.asc`` extension will be created in the ``dist`` directory.
cs_cz: Ve složce ``dist`` bude vytvořen soubor obsahující podpis se stejným názvem jako archiv s příponou ``.asc``.
fr_fr: Un fichier contenant la signature portant l"e même nom que l'archive avec une extension ``.asc`` sera créé dans le dossier ``dist``.
pt_pt: Um arquivo contendo a assinatura com o mesmo nome do arquivo com uma extensão ``.asc`` será criado no diretório ``dist```.
tr_tr: İmzanın bulunduğu dosya arşiv ile aynı adla ve ``.asc`` uzantısıyla ``dist`` klasörüne eklenir.
zh_cn: 将在``dist``目录中创建一个包含与具有“.asc``扩展名的存档同名的签名的文件。

source: GitHub release
cs_cz: GitHub vydání
fr_fr: Release GitHub
pt_pt: Lançamento no GitHub
tr_tr: GitHub üzerinde yayınlamak
zh_cn: GitHub发布

source: The release script will create a release on your GitHub repository, as a draft, unless you use ``--nogithub`` (or ``-g``) option.
cs_cz: Skript pro vydání vytvoří vydání ve vašem GitHub repozitáři, jako koncept, pokud nepoužijete volbu ``--nogithub`` (nebo ``-g``).
fr_fr: Le script de release créera une release GitHub sur votre dépôt, en brouillon, à moins que vous ne spécifiez l'option ``--nogithub`` (ou ``-g``).
pt_pt: O script de lançamento criará uma release no seu repositório GitHub, como um rascunho, a menos que use a opção ``—nogithub`` (ou ``-g``).
tr_tr: Yayınlama betiği ``--nogithub`` (ya da ``-g``) seçeneği kullanılmadıkça GitHub deposu üzerinde bir taslak yayınlama sürümü oluşturur.
zh_cn: 发布脚本将在您的GitHub存储库上创建一个发布版本，除非您使用``--nogithub``（或``-g``）选项。

source: Unfortunately, I was not able to get the newly created archive uploaded to this new release... Maybe that could be fixed in the future.
cs_cz: Žel nebylo možné získat nově vytvořený archiv nahraný do tohoto nového vydání… Snad toto bude opraveno v budoucnu.
fr_fr: Malheureusement, je n'ai pas été en mesure de téléverser la nouvelle archive sur cette release... Peut-être cela sera-t-il fixé dans le futur.
pt_pt: Infelizmente, eu não fui capaz de obter o arquivo recém-criado carregado para esta nova versão… Talvez isso poderia ser corrigido no futuro.
tr_tr: Maalesef, yeni sürüm için oluşturulmuş arşiv dosyasını henüz yükleyemiyoruz...Bu sorun ileride çözülebilir.
zh_cn: 不幸的是，我无法将新创建的档案上传到这个新版本......也许这可以在将来修复。

source: In order to use this feature, you will need the `github <https://github.com/PyGithub/PyGithub>`_ installed; and you will need an access token. Access token is valid per user, and gives accesss to all his repositories.
cs_cz: Pro získání této funkce bude třeba nainstalovat `github <https://github.com/PyGithub/PyGithub>`_ ; a budete potřebovat přístupový klíč. Přístupový token je platný pro konkrétního uživatele a dává přístup do všech repozitářů.
fr_fr: Pour pouvoir bénéficier de cette fonctionnalité, il faudra que le `module python github <https://github.com/PyGithub/PyGithub>`_ soit installé ; et il vous faudra un token d'accès. Les tokens d'accès sont valides par utilisateur et donnent accès à l'ensemble de ses dépôts.
pt_pt: Para usar este recurso, precisará do `github <https://github.com/PyGithub/PyGithub>`_ instalado; e precisará de um token de acesso. O token de acesso é válido por utilizador, e dá acesso a todos os seus ficheiros.
tr_tr: Bu özelliği kullanabilmek içn `GitHub <https://github.com/PyGithub/PyGithub>`_ kurulmuş; ve erişim kodu alınmış olmalıdır. Her kullanıcıya bir erişim kodu verilir ve depolarına ulaşması için kullanılır.
zh_cn: 要使用此功能，您需要安装`github <https://github.com/PyGithub/PyGithub>`_；你需要一个访问口令。访问口令对每个用户有效，并提供对其所有存储库的访问权限。

source: You'll have to go to your `github account settings page, in the personnal access token tab <https://github.com/settings/tokens>`_. Click on *generate new token*, give the description you want, and make sure you'll check the *public_repo* box only (no need to check anything else, you can create several access token if you need).
cs_cz: Je třeba jít do `nastavení vašeho účtu na github, panel osobní přístupový token <https://github.com/settings/tokens>`_. Kliknout na *generate new token* (vytvořit nový token), zadat popis a zaškrtnout pouze *public_repo* (není třeba zaškrtávat cokoli jiného, je možné vytvořit více přístupových tokenů, pokud je to třeba).
fr_fr: Vous devrez vous rendre sur `la page des préférences de votre compte github, dans l'onglet "personnal access token" <https://github.com/settings/tokens>`_. Clic sur *generate new token*, fournissez la description souhaitée et assurez-vous d'avoir coché la case *public_repo* uniquement (il n'est pas nécessaire de cocher quoi que ce soit d'autre, vous pourrez créer plusieurs tokens au besoin).
pt_pt: Terá que ir ao seu `github página dos ajustes do cliente do `github, na aba do token do acesso pessoal <https://github.com/settings/tokens>`_. Clique sobre *gerar token novo*, dê a descrição que você quer, e certifique-se que verificará a caixa *public_repo* somente (nenhuma necessidade verificar qualquer outra coisa, pode criar diversos tokens de acesso se necessitar).
tr_tr: `GitHub ayarları sayfasınıza giderek, personnal access token sekmesinden <https://github.com/settings/tokens>`_. *generate new token* üzerine tıklayın. Açıklamayı isteğinize göre yazın ve yalnız *public_repo* seçeneğini işaretlediğinizden emin olun (başka bir seçeneği işaretlemeniz gerekmez. Gerek duyarsanız bir kaç erişim kodu üretebilirsiniz).
zh_cn: 您必须访问个人访问令牌选项卡<https://github.com/settings/tokens>`_中的`github帐户设置页面。单击*生成新令牌*，给出您想要的描述，并确保您只检查* public_repo *框（无需检查任何其他内容，如果需要，您可以创建多个访问令牌）。

source: The token will be displayed only once; store it in the ``.gh_token`` file in your plugin directory; and that's all!
cs_cz: Token bude zobrazen pouze jednou; uložte ho do souboru ``.gh_token`` ve složce se zásuvným modulem; a je to!
fr_fr: Le token ne sera affiché qu'une fois ; enregistrez-le dans le fichier ``.gh_token`` dans le répertoire de votre plugin, et c'est tout !
pt_pt: O token será exibido apenas uma vez; armazene-o no arquivo ``.gh_token``` no seu diretório de plugins; e é tudo!
tr_tr: Kod yalnız bir kez görüntülenir. kodu plugin klasörünüzdeki ``.gh_token`` dosyasına kaydederek işlemi tamamlayabilirsiniz.
zh_cn: 令牌只会显示一次；将它存储在插件目录中的``.gh_token``文件中；结束！

source: Excluding files
cs_cz: Vyloučené soubory
fr_fr: Exclure des fichiers
tr_tr: Katılmayacak dosyaları belirlemek

source: You can create a ``.ignore-release`` file at the root of your plugin and list here files and directories you want to explicitely exclude from the release archive. Write one `expression <https://docs.python.org/2/library/re.html>`_ per line
cs_cz: Můžete vytvořit soubor `` .ignore-release`` v kořenovém adresáři vašeho pluginu a uvést zde soubory a adresáře, které chcete explicitně vyloučit z archivu vydání. Napište jeden výraz <https://docs.python.org/2/library/re.html> `_ na řádek
fr_fr: Vous pouvez créer un fichier ``.ignore-release`` à la racine de votre plugin et y lister les fichiers et dossiers que vous voulez exclure explicitement de l'archive. Écrivez une `expression <https://docs.python.org/2/library/re.html>`_ par ligne
tr_tr: Uygulama ekinizin kök klasöründe bir ``.ignore-release`` dosyası oluşturabilir ve içine sürüm arşivine katılmasını istemediğiniz dosya ve klasörleri yazabilirsiniz. Her satıra bir `ifade <https://docs.python.org/2/library/re.html>`_ yazın

source: Some files will automatically be excluded:
cs_cz: Některé soubory budou automaticky vyloučeny:
fr_fr: Certains fichiers seront automatiquement exclus :
tr_tr: Bazı dosyalar otomatik olarak katılmaz:

source: Creative Commons License
cs_cz: Licence Creative Commons
fr_fr: Licence Creative Commons
tr_tr: Creative Commons Lisansı
