Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/empty/index.po
Languages: cs_cz, fr_fr, pt_pt, tr_tr, zh_cn

source: Remember compiled files should not be commited on your repository sources. It is a release process to minify files.
cs_cz: Mějte na paměti, že zkompilované soubory by neměly být nahrávány do zdrojů ve vašem repozitáři. Pro minifikaci souborů slouží proces vydávání.
fr_fr: Souvenez-vous que les fichiers compilés ne doivent pas être commités sur votre dépôt de sources. Leur création fait partie du travail du processus de release.
pt_pt: Lembre-se que arquivos compilados não devem ser comprometidos nas suas fontes de repositório. É um processo de lançamento para comprimir arquivos.
tr_tr: Derlenmiş dosyaların depo kaynaklarınıza yüklenmeyeceğini unutmayın. Bu işlem yayınlamadan önce dosyaları küçültmek içindir.
zh_cn: 请记住，不应在存储库源上提交已编译的文件。这是一个缩小文件的发布过程。

source: Also remember to adapt your scripts so they load your minified versions if available, and the original one otherwise :)
cs_cz: Nezapomeňte přizpůsobit své skripty tak, aby načítaly minifikované verze (pokud jsou k dispozici) a náhradně ty původní :)
fr_fr: Pensez également à adapter vos scripts pour qu'ils chargent les versions minimifiées si elles sont disponibles, et l'original dans le cas contraire :)
pt_pt: Lembre-se também de adaptar seus scripts para que eles carreguem as suas versões reduzidas, se disponíveis, e a original, caso contrário :)
tr_tr: Ayrıca betiklerinizi varsa küçültülmüş sürümleri yoksa özgün sürümleri yükleyecek şekilde uyarlamayı unutmayın :)
zh_cn: 还记得调整你的脚本，以便加载如果可用的缩小版本，原来的版本:）

source: As of GLPI 9.2; you do not have to care about loading minified files when using ``add_css`` and ``add_javascript`` hooks! You just need to call not minified script; and GLPI will use the minified version if it exists and if not in `DEBUG` mode.
cs_cz: U GLPI 9.2; se není třeba starat o načítání minifikovaných souborů při použití háčků ``add_css`` a ``add_javascript``! Jen je třeba nevyvolávat minified skripty; a GLPI použije minified verzi pokud existuje a pokud není v režimu `DEBUG` (ladění).
fr_fr: À partir de GLPI 9.2, vous n'avez plus à vous soucier du chargement des fichier minimifiés lorsque vous utilisez les hooks ``add_css`` et ``add_javascript`` ! Vous dvez simplement appeler vos fichiers standards, et GLPI utilisera automatiquement la version minimifiée si elle existe, et si le mode `DEBUG` n'est pas actif.
pt_pt: A partir do GLPI 9.2; não precisa de se preocupar em carregar arquivos comprimidos ao usar ``add_css`` e ``add_javascript`` hooks! Só precisa de executar o script não comprimido; e o GLPI usará a versão comprimida se ela existir e se não estiver no modo `DEBUG`.
tr_tr: GLPI 9.2 sürümünden itibaren, ``add_css`` ve ``add_javascript`` seçeneklerini kullanarak, küçültülmüş dosyaların yüklenmesi için herhangi bir ek işlem yapmanız gerekmez. Küçültülmemiş betiği çağırmanız yeterlidir. Varsa ve `Hata Ayıklama` kipinde değilse GLPI küçültülmüş sürümü kullanır.
zh_cn: 截至GLPI 9.2；使用``add_css``和``add_javascript``挂钩时，你不必关心加载缩小的文件！你只需要调用不缩小的脚本；如果存在，则GLPI将使用缩小版本，如果不存在，则使用“DEBUG”模式。

source: Translations
cs_cz: Překlady
fr_fr: Traductions
pt_pt: Traduções
tr_tr: Çeviriler
zh_cn: 翻译

source: GLPI and its plugins use gettext for internationnalization. Several steps are required before that can work:
cs_cz: GLPI a zásuvné moduly pro něj používají pro překlady gettext. Aby to fungovalo, je třeba několika kroků:
fr_fr: GLPI et ses plugins utilisent gettext pour l’internationalisation. Plusieurs étapes sont requises pour que cela fonctionne :
pt_pt: GLPI e os seus plugins usam gettext para internacionalização. Vários passos são necessários antes que isso possa funcionar:
tr_tr: GLPI ve uygulama eklerinin dil çevirileri için gettext kullanılır. Çevirilerin doğru çalışması için bir kaç adım gereklidir:
zh_cn: GLPI及其插件使用gettext进行国际化。在此之前需要执行几个步骤：

source: 1 translatable strings must be extracted from source files, a ``POT`` file will be created or updated accordingly, 2 ``PO`` files must be created or updated from the ``POT`` file, 3 ``PO`` files must be translated, 4 ``MO`` files must be compiled from the latest ``PO``.
cs_cz: 1 přeložitelné řetězce je třeba vytáhnout ze souborů se zdrojovými kódy, podle toho bude vytvořen nebo aktualizován ``POT`` soubor, 2 ``PO`` soubory je třeba vytvořit nebo aktualizovat z ``POT`` souboru, 3 ``PO`` soubory je třeba přeložit, 4 ``MO`` soubory je třeba sestavit z nejnovějších ``PO``.
fr_fr: 1 les chaînes à traduire doivent être extraites depuis les fichiers sources, un fichier ``POT`` ser ainsi créé ou mise à jour en conséquence, 2 les fichiers ``PO`` doivent être créés ou mis à jour depuis les fichier ``POT``, 3 les fichiers ``PO`` doivent être traduits, 4 ``les fichiers ``MO`` doivent être compilés depuis la dernière version des ``PO``.
pt_pt: 1 strings traduzíveis devem ser extraídas de arquivos fonte, um arquivo ``POT`` será criado ou atualizado de acordo, 2 arquivos ``PO`` devem ser criados ou atualizados do arquivo ``POT``, 3 arquivos ``PO`` devem ser traduzidos, 4 arquivos ``MO`` devem ser compilados do último ``PO``.
tr_tr: 1. Kaynak dosyalarından çevrilebilecek dizgeler ayıklanarak bir ``POT`` dosyası oluşturulmalı ya da güncellenmelidir. 2. Güncellenen ``POT`` dosyası kullanılarak ``PO``dosyaları oluşturulmalı ya da güncellenmelidir. 3. ``PO`` dosyalarının çevirisi yapılmalıdır. 4. Güncel ``PO`` dosyası kullanılarak ``MO`` dosyaları derlenmelidir.
zh_cn: 1 必须从源文件中提取1个可翻译的字符串，相应地创建或更新``POT``文件，2 ``PO``文件必须从``POT``文件创建或更新，3``PO``文件必须翻译，4``MO``文件必须从最新的``PO``编译。

source: In the ``vendor/bin`` directory, you'll find a ``extract_template.sh`` script. This is designed to extract translatable strings from your source code (see first point above).
cs_cz: Ve složce ``vendor/bin`` naleznete skript ``extract_template.sh``. Je navržen pro extrakci přeložitelných znaků ze zdrojových kódů (viz první bod výše).
fr_fr: Dans le dossier ``vendor/bin``, vous trouverez un script ``extract_template.sh``. Il va extraire les chaînes à traduire depuis le code source (voir le premier point ci-dessus).
pt_pt: No diretório ``vendor/bin``, encontrará um script ``extract_template.sh```. Este é projetado para extrair strings traduzíveis do seu código fonte (veja o primeiro ponto acima).
tr_tr: ``vendor/bin`` klasöründe bulabileceğiniz ``extract_template.sh`` betiği ile kaynak kodunuzdaki çevrilebilecek dizgeleri ayıklayabilirsiniz (yukarıdaki birinci adım).
zh_cn: 在``vendor/bin``目录中，你会找到一个``extract_template.sh``脚本。这旨在从源代码中提取可翻译的字符串（请参阅上面的第一点）。

source: Once it has been ran, a ``locale/mygreatplugin.pot`` file will be created/updated.
cs_cz: Jakmile byl spuštěný, bude vytvořen/aktulizován soubor ``locale/mygreatplugin.pot``.
fr_fr: Une fois qu'il aura été lancé, le fichier ``locale/mygreatplugin.pot`` sera créé ou mis à jour.
pt_pt: Uma vez executado um arquivo, ``locale/mygreatplugin.pot``` será criado/atualizado.
tr_tr: Bu betik çalıştırıldığında ``locale/uygulamaekim.pot`` dosyası oluşturulur ya da güncellenir.
zh_cn: 一旦运行，将创建/更新``locale/mygreatplugin.pot``文件。

source: For the second and third step, you'll have to make a choice. You can use gettext tools to update your ``PO`` files and translate them using a dedicated tool, like `poedit <https://poedit.net/>`_; or you can use an online translation system like `Transifex <http://transifex.com/>`_ or `Zanata <http://zanata.org/>`_. GLPI core and many of existing plugins are translated using Transifex right now.
cs_cz: Pro druhý a třetí krok, bude třeba rozhodnout. Pro aktualizaci ``PO`` souborů je možné použít nástrojů gettext a přeložit je vyhrazeným nástroje, jako třeba `poedit <https://poedit.net/>`_; nebo můžete použít online překladový systém jako `Transifex <http://transifex.com/>`_ nebo `Zanata <http://zanata.org/>`_. GLPI samotné a mnoho existujících zásuvných modulů je nyní překládáno na Transifex.
fr_fr: Pour les secondes et troisièmes étapes, vous aurez à faire un choix. Vous pouvez utiliser les outil gettext pour mettre à jour vos fichier ``PO`` et les traduire en utilisant un outil dédié, tel que `poedit <https://poedit.net/>`_ ; ou vous pouvez utiliser un système de traduction en ligne tel que `Transifex <http://transifex.com/>`_ ou `Zanata <http://zanata.org/>`_. Le cœur de GLPI ainsi que de nombreux plugins sont traduits via Transifex actuellement.
pt_pt: Para o segundo e terceiro passo, terá de fazer uma escolha. Pode usar ferramentas do gettext para atualizar as suas ``PO`` limas e traduzi-las usando uma ferramenta dedicada, como `poedit <https://poedit.net/>`_; ou pode usar um sistema de tradução em linha como `Transifex <http://transifex.com/>`_ ou `Zanata <http://zanata.org/>`_. O núcleo de GLPI e muitos dos plugins existentes são traduzidos usando Transifex agora mesmo.
tr_tr: İkinci ve üçüncü adımlar için bir seçim yapmanız gerekir. ``PO`` dosyalarınızı güncellemek ve çevirmek için `poedit <https://poedit.net/>`_; gibi gettext araçlarını kullanabileceğiniz gibi`Transifex <http://transifex.com/>`_ ya da `Zanata <http://zanata.org/>`_ gibi çevrim içi çeviri sistemlerinden yararlanabilirsiniz. Şu anda Transifex üzerinde GLPI çekirdeği ve çoğu uygulama ekinin çevirileri bulunmaktadır.
zh_cn: 对于第二步和第三步，您必须做出选择。您可以使用gettext工具更新``PO``文件并使用专用工具进行翻译，例如`poedit <https://poedit.net/>`_;或者你可以使用在线翻译系统，如`Transifex <http://transifex.com/>`_或`Zanata <http://zanata.org/>`_。GLPI核心和许多现有插件现在都使用Transifex进行翻译。

source: Once you get your updated ``PO`` files, you'll have to compile them to ``MO`` files. You can run it manually, the release script will compile them again anywways; see the :ref:`compiling MO files section <compile_mo>`.
cs_cz: Jakmile zaktualizujete ``PO`` soubory, bude třeba je zkompilovat do ``MO`` souborů. Můžete to spustit ručně, skript pro vydávání je zkompiluje i tak; viz :ref:`sekce kompilace MO souborů <compile_mo>`.
fr_fr: Une fois que vos fichier ``PO`` auront été mis à jour, vous devrez les compiler en tant que fichiers ``MO``. Vous pouvez lancer cela manuellement, le script de relese le fera de toutes façons ; référez-vous à la :ref:`section relative à la compilation des fichiers MO <compile_mo>`.
pt_pt: Uma vez que obtenha seus arquivos ``PO`` atualizados, terá que compilá-los em arquivos ``MO``. Pode executá-lo manualmente, o script de lançamento irá compilá-los novamente de qualquer maneira; veja a seção :ref:`compilando arquivos MO <compile_mo>`.
tr_tr: ``PO`` dosyalarınızı güncelledikten sonra ``MO`` dosyalarını derlemelisiniz. Bu işlemi el ile yapabilirsiniz. Yayınlama betiği bu dosyaları her durumda yeniden derler. :ref:`MO dosyalarını derlemek bölümüne <compile_mo>` bakın.
zh_cn: 一旦获得更新的``PO``文件，就必须将它们编译为``MO``文件。你可以手动运行它，发布脚本会再次编译它们；请参阅:ref:`编译MO文件部分<compile_mo>`。

source: Release script
cs_cz: Script pro vydání
fr_fr: Script de release
pt_pt: Script de lançamento
tr_tr: Yayınlama betiği
zh_cn: 发布脚本

source: A release script is provided in ``vendor/bin/plugin-release``. This is a "simple" `Python <http://python.org>`_ script; you should just have Python installed on your system (this is installed by default on most linux distributions).
cs_cz: Skript pro vydání se nachází v ``vendor/bin/plugin-release``. Toto je „jednoduchý“ `Python <http://python.org>`_ skript; stačí mít nainstalovaný Python (ve většině linuxových distribucí je ve výchozím stavu nainstalovaný).
fr_fr: Un script de release est fournit dans ``vendor/bin/plugin-release``. C'est un « simple » script `Python <http://python.org>`_ ; vous devez juste avoir Python installé sur votre système (c'est le cas par défaut sur la plupart des distributions linux).
pt_pt: Um script de lançamento é fornecido em ``vendor/bin/plugin-release``. Este é um “script simples” `Python <http://python.org>`_; deve ter o Python instalado no sistema (isto é instalado por padrão na maioria das distribuições Linux).
tr_tr: ``vendor/bin/plugin-release`` klasöründe bir yayınlama betiği bulunur. "Basit" `bir Python <http://python.org>`_ betiğidir. Sisteminizde Python yüklü olmalıdır (çoğu linux dağıtımında varsayılan olarak yüklüdür).
zh_cn: 在``vendor/bin/plugin-release``中提供了一个发布脚本。这是一个“简单的”`Python <http://python.org>`_ script；你应该在系统上安装Python（默认安装在大多数Linux发行版上）。

source: Note that the release script is only compatible if you use semantic versionning!
cs_cz: Uvědomte si, že uvolňovací skript je kompatibilní, pouze pokud používáte sémantické verzování!
fr_fr: Notez que ce script de release n'est compatible que si vous utilisez le versionnage sémantique !
tr_tr: Yayınlama betiğinin yalnız anlam bilimsel sürümleme ile uyumlu olduğunu unutmayın!

source: Using just the defaults, the script will try to retrieve the latest tag in your git repository, add third party dependencies and create a `Release` on the github project:
cs_cz: S pouze výchozími parametry se skript pokusí získat nejnovější štítek ve vašem git repozitáři, přidat potřebné součásti od třetích stran a vytvořit `Vydání` na github projektu:
fr_fr: En utilisant les options par défaut, le script va tenter de retrouver le dernier tag de votre dépôt git, ajouter les dépendances tierces et créer une `Release` sur votre projet github.
pt_pt: Usando apenas os padrões, o script tentará recuperar a última tag no arquivo git, adicionar dependências de terceiros e criar um `Release` no projeto github:
tr_tr: Yalnız varsayılan değerler kullanıldığında betik git deponuzdaki son etiketi almayı, üçüncü taraf bağlılıklarını eklemeyi ve github projesinde `Yayın` sürümünü oluşturmayı dener:
zh_cn: 仅使用默认值，脚本将尝试检索git存储库中的最新标记，添加第三方依赖项并在github项目上创建“Release”：

source: Requirements
cs_cz: Požadavky
fr_fr: Pré-requis
pt_pt: Requisitos
tr_tr: Gereksinimler
zh_cn: 要求

source: You will need a python interpreter installed as well as the following modules:
cs_cz: Je třeba mít nainstalovaný interpret jazyka python a následující moduly:
fr_fr: Vous aurez besoin d'un interpréteur python installé ainsi que les modules suivants :
pt_pt: Precisará de um interpretador python instalado, bem como os seguintes módulos:
tr_tr: Python derleyicinin şu modüller ile yüklenmiş olması gerekir:
zh_cn: 您将需要安装python解释器以及以下模块：

source: `github <https://github.com/PyGithub/PyGithub>`_ (to check for existing versions in also in drafts, and to create github releases), unless you use the ``--nogithub`` option
cs_cz: `github <https://github.com/PyGithub/PyGithub>`_ (pro zjištění existujících verzí také v konceptech, a vytvoření github vydání), pokud nepoužijete volbu ``--nogithub``
fr_fr: `github <https://github.com/PyGithub/PyGithub>`_ (pour vérifier les versions existantes dans les brouillons également, et pour créer les releases github), à moins que vous ne spécifiez l'option ``--nogithub``
pt_pt: github <https://github.com/PyGithub/PyGithub>`_ (para verificar se há versões existentes também nos rascunhos, e para criar lançamentos do github), a menos que use a opção ``—nogithub``
tr_tr: `github <https://github.com/PyGithub/PyGithub>`_ (var olan sürümleri ve taslakları denetlemek ve github sürümlerini oluşturmak için ), ``--nogithub`` seçeneğini kullanmadığınız sürece
zh_cn: `github <https://github.com/PyGithub/PyGithub>`_（在草稿中检查现有版本，并创建github版本），除非你使用``--nogithub``选项

source: If you want to get help on the script, try to run ``./vendor/bin/plugin-release -h``.
cs_cz: Pro zobrazení nápovědy ke scriptu ho spusťte takto ``./vendor/bin/plugin-release -h``.
fr_fr: Si vous voulez de l'aide sur le script, essayez de lancer ``./vendor/bin/plugin-release -h``.
pt_pt: Caso queira obter ajuda no script, tente executar ``./vendor/bin/plugin-release -h``.
tr_tr: Betik ile ilgili yardım sayfasını görüntülemek için ``./vendor/bin/plugin-release -h`` yazın.
zh_cn: 如果你想获得有关脚本的帮助，请尝试运行``./vendor/bin/plugin-release -h``。

source: Process
cs_cz: Proces
fr_fr: Processus
pt_pt: Processo
tr_tr: Süreç
zh_cn: 进程

source: The release process will achieve the following tasks for you:
cs_cz: Proces vydání pro vás udělá následující úkoly:
fr_fr: Le processus de release effectuera les tâches suivantes pour vous :
pt_pt: O processo de liberação realizará as seguintes tarefas:
tr_tr: Yayınlama sürecinde şu işlemler yapılır:
zh_cn: 发布过程将为您完成以下任务：

source: check if the version constant is the same as the tag you've requested;
cs_cz: zkontrolovat zda je konstanta verze stejná jako štítek který požadujete;
fr_fr: vérifie que la constante de version soit identique au tag demandé ;
pt_pt: verifique se a constante de versão é a mesma que a tag que solicitou;
tr_tr: Sürüm sabitinin istediğiniz etiket ile aynı olup olmadığı denetlenir,
zh_cn: 检查版本常量是否与您请求的标记相同；

source: check if the version in the website XML file is the same as the tag you've requested;
cs_cz: zkontrolovat zda verze v XML souboru této webové stránky je stejná jako štítek který požadujete;
fr_fr: vérifie que la version dans le fichier XML pour le site web est la même que celle du tag demandé ;
pt_pt: verifique se a versão no arquivo XML do site é a mesma que a tag que solicitou;
tr_tr: Site XML dosyası sürümünün istediğiniz etiket ile aynı olup olmadığı denetlenir,
zh_cn: 检查网站XML文件中的版本是否与您请求的标记相同；

source: check if a release already exists, locally, and remotely (assuming your project is hosted in the *pluginsGLPI* organization and the release is public);
cs_cz: zkontrolujte zda vydání už existuje, místně a vzdáleně (předpokládejme že projekt je hostován v organizaci *pluginsGLPI* a vydání je veřejné);
fr_fr: vérifie si une release existe déjà en local ou en distant (en présumant que votre plugin soit héberge sur l'organisation github *pluginsGLPI* et qu'elle soit publique) ;
pt_pt: verifique se uma versão já existe, localmente, e remotamente (assumindo que o seu projecto está alojado na organização *pluginsGLPI* e a versão é pública);
tr_tr: Yerel ve uzak (projenizin *pluginsGLPI* kuruluşunda yayınlandığı ve herkese açık olarak yayınlandığı varsayılarak) bir sürümün var olup olmadığı denetlenir,
zh_cn: 检查版本是否已存在，本地和远程（假设您的项目托管在* pluginsGLPI *组织中，并且该版本是公开的）;

source: make a `git archive` of the paths that are not excluded (``.git``, ``tools``, ``tests``, ...);
cs_cz: udělejte `git archive` umístění která nejsou vynechány (``.git``, ``tools``, ``tests``, …);
fr_fr: crée une archive des chemins qui ne sont pas exclus (`.git``, ``tools``, ``tests``, ...) ;
pt_pt: faça um `arquivo git` dos caminhos que não são excluídos (``.git```, ``tools``, ``tests``, …);
tr_tr: Devre dışı bırakılmamış yolların `git arşivi` of oluşturulur (``.git``, ``tools``, ``tests``, ...),
zh_cn: 制作一个未被排除的路径的`git archive`（``.git``，``tools``，``tests``，...）;

source: if any, install composer dependencies;
cs_cz: pokud nějaké, nainstalujte součásti, které composer potřebuje;
fr_fr: s'il y en a, installe les dépendances ;
pt_pt: se houver, instale as dependências do compositor;
tr_tr: Varsa derleyici bağımlılıkları yüklenir,
zh_cn: 如果有的话，请安装composer依赖项;

source: if any, compile you ``MO`` files;
cs_cz: pokud nějaké, zkompilujte své ``MO`` soubory;
fr_fr: s'il y en a, compile vos fichier ``MO`` ;
pt_pt: se houver, compile os arquivos ``MO``;
tr_tr: Varsa, ``MO`` dosyaları derlenir,
zh_cn: 如果有的话，编译你的``MO``文件;

source: if any, compile you CSS stylesheets and your Javascript files (using `Robo.li <http://robo.li>`_);
cs_cz: pokud nějaké, zkompilujte své tabulky CSS stylů a soubory Javascript (pomocí `Robo.li <http://robo.li>`_);
fr_fr: s'il y en a, compile vos feuilles de style CSS et vos fichiers Javascript (en utilisant `Robo.li <http://robo.li>`_) ;
pt_pt: se houver, compile suas folhas de estilo CSS e os seus arquivos Javascript (usando `Robo.li <http://robo.li>`_);
tr_tr: Varsa, CSS biçem sayfaları ve JavaScript dosyaları derlenir (`Robo.li <http://robo.li>` kullanılarak_),
zh_cn: 如果有的话，编译你的CSS样式表和Javascript文件（使用`Robo.li <http://robo.li>`_）;

source: create a release archive with all that; that will be available in the ``dist`` directory;
cs_cz: vytvořte archiv s vydáním, obsahující toto vše; který bude k dispozici ve složce ``dist``;
fr_fr: créé une archive de release avec tout cela ; et la met à disposition dans le dossier ``dist`` ;
pt_pt: crie um arquivo release completo; que estará disponível no diretório ``dist```;
tr_tr: Tüm bunlardan bir yayın arşivi derlenerek `Robo.li <http://robo.li>`_ ``dist`` klasörüne eklenir,
zh_cn: 创建一个包含所有这些的发布存档；这将在``dist``目录中提供；

source: use GPG to sign the archive.
cs_cz: podepsat archiv pomocí GPG
fr_fr: utilise GPG pour signer l'archive ;
pt_pt: usar GPG para assinar o arquivo.
tr_tr: Arşivi imzalamak için GPG kullanın.
zh_cn: 使用GPG对存档进行签名。

source: The standard release process will not work on your files directly, it will make a copy in the ``dist/src`` directory before. The only exception is the :ref:`MO compiling option <compile_mo>`.
cs_cz: Standardní proces vydávání nebude fungovat přímo na vašich souborech, udělá před tím kopii složky v ``dist/src``. Jedinou výjimkou je :ref:`volba kompilace MO <compile_mo>`.
fr_fr: Le processus de release standard ne travaillera pas sur vos fichiers directement, il effectuera en premier lieu une copie dans le dossier ``dist/src`` auparavant. La seule exception concerne l'option de :ref:`compilation des fichiers MO <compile_mo>`.
pt_pt: O processo de lançamento padrão não funcionará diretamente nos seus arquivos, ele fará uma cópia no diretório ``dist/src`` antes. A única exceção é a opção de compilação :ref:`MO <compile_mo>`.
tr_tr: Standart yayınlama sürecinde doğrudan dosyalarınız üzerinde çalışılmaz. Dosyalar önce ``dist/src`` klasörüne kopyalanır. Bu işlemin uygulanmadığı tek durum :ref:`MO derleme seçeneğidir <compile_mo>`.
zh_cn: 标准的发布过程不能直接对你的文件起作用，它会在``dist/src``目录中复制。唯一的例外是:ref:`MO编译选项<compile_mo>`。

source: In order to check if all is OK before doing real release; create your tag and run ``./vendor/bin/plugin-release -C`` **before pushing your tag**. That way, you'll be able to fix potential issues and re-create your tag locally (remember published tags should **never** be removed).
cs_cz: Pro kontrolu zda je vše v pořádku před skutečným vydáním; vytvořte štítek a spusťte ``./vendor/bin/plugin-release -C`` **před push svého štítku**. Tímto způsobem bude schopní opravit případné problémy a znovuvytvořit štítek místně (pamatujte, že zveřejněné štítky by **nikdy** neměly být odebírány).
fr_fr: Dans le but de vérifier si tout est OK avant de créer la vraie release ; créez votre tag et lancez ``./vendor/bin/plugin-release -C`` **avant de le pousser sur votre dépôt distant**. De cette manière, vous serez en mesure de corriger les éventuels problèmes et re-créer votre tag en local (n'oubliez pas que les tags publiés ne devraient **jamais** être supprimés).
pt_pt: Para verificar se tudo está OK antes de fazer o lançamento real; crie a tag e execute ``./vendor/bin/plugin-release -C``` **antes de colocar a tag**. Dessa forma, será capaz de corrigir problemas potenciais e recriar a tag localmente (lembre-se que as tags publicadas devem **nunca** ser removidas).
tr_tr: Gerçek sürümü yayınlamadan önce her şeyin tamam olup olmadığını görmek için etiketinizi oluşturun ve ``./vendor/bin/plugin-release -C`` komutunu yürütün **etiketinize push işlemi yapmadan önce**. Böylece olası sorunları çözerek etiketinizi yerel olarak yeniden oluşturabilirsiniz. (yayınlanan etiketlerin **asla** silinemediğini unutmayın).
zh_cn: 在进行实际发布之前检查是否一切正常；创建你的标签并在推动你的标签**之前运行`./vendor/bin/plugin-release -C`` **。这样，您就可以解决潜在问题并在本地重新创建标记（请记住，发布的标记应该永远不会被删除）。

source: Compiling MO files
cs_cz: Kompilace MO souborů
fr_fr: Compilation des fichiers MO
pt_pt: Compilando arquivos MO
tr_tr: MO dosyalarını derlemek
zh_cn: 编译MO文件
