Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/empty/index.po
Languages: cs_cz, fr_fr, pt_pt, tr_tr, zh_cn

source: Empty
cs_cz: Prázdný
pt_pt: Vazio
zh_cn: 空

source: Download
cs_cz: Stáhnout
fr_fr: Télécharger

source: Sources
cs_cz: Zdroje

source: *not relevant*
cs_cz: *není relevantní*
fr_fr: *non applicable*

source: This plugins does... nothing. Really!
cs_cz: Tento zásuvný modul… nic nedělá. Opravdu!
fr_fr: Ce plugin fournit... Rien. Vraiment !
pt_pt: Este plugin faz... nada. na realidade!
tr_tr: Bu uygulama eki aslında... hiç bir şey yapmaz. Gerçekten!
zh_cn: 这个插件什么...也没做。真的！

source: This is designed to be a start point for writing plugins, with very minimal defaults usefull scripts, and some advices. If you're looking for plugins possibilities, take a look at :doc:`the example plugin <../example/index>`.
cs_cz: Toto je navrženo jako startovní bod pro psaní zásuvných modulů, se skutečně minimálními výchozími užitečnými skripty a pár radami. Pokud hledáte co je možné v zásuvných modulech dělat, podívejte se na :doc:`zásuvný modul pro ukázku <../example/index>`.
fr_fr: Il est prévu pour être un point de départ pour l'écriture de plugins, avec des versions minimales de scripts utilitaires, et quelques conseils. Si vous recherchez plutôt les possibilités offertes pas les plugins, regardez :doc:`le plugin exemple <../example/index>`.
pt_pt: Isto é projectado para ser o ponto de partida para escrever plugins, com mínimos scripts úteis padrão, e alguns conselhos. Se você está à procura de possibilidades de plugins , veja: doc: `O plugin de exemplo <../ example / index> `.
tr_tr: Bu uygulama ekinde, geliştirmeye bir başlangıç noktası oluşturmak için kullanılabilecek şekilde bazı varsayılan betikler ve öneriler bulunur. Uygulama eki olanaklarını öğrenmek istiyorsanız :doc:`örnek uygulama eki <../example/index>` bölümüne bakın.
zh_cn: 这是设计用于编写插件的起点，具有非常有用的脚本默认值和一些建议。如果您正在寻找插件的可能性，请查看:doc:`示例插件<../example/index>`。

source: Create a new plugin
cs_cz: Vytvořit nový zásuvný modul
fr_fr: Créer un nouveau plugin
pt_pt: Criar um novo plugin
tr_tr: Yeni bir uygulama eki oluşturmak
zh_cn: 新建插件

source: An utility script to create a new plugin - ``plugin.sh`` is provided. You will call it with a plugin name, a version, an optionally the path where your want it to be created:
cs_cz: Je poskytován nástroj-skript pro vytváření nových zásuvných modulů – ``plugin.sh``. Vyvolává se s názvem zásuvného modulu, verzí a volitelně popisem umístění, ve kterém chcete, aby chcete byl vytvořen:
fr_fr: Un script utilitaire pour créer un nouveau plugin - ``plugin.sh`` est fourni. Vous devrez l'appeler avec un nom de plugin, une version et optionnellement le chemin dans lequel vous souhaitez le créer.
pt_pt: Um script utilitário para criar um novo plugin - `` plugin.sh`` é fornecido. Você vai dar um nome ao plugin, uma versão, e opcionalmente o caminho onde o quer que ele seja criado:
tr_tr: Yeni bir uygulama eki oluşturmak için ``plugin.sh`` betiği kullanılır. Betik çağrılırken bir uygulama eki adı, bir sürüm ve isteğe bağlı olarak uygulama ekinin oluşturulması istenilen yol belirtilmelidir:
zh_cn: 提供了一个用于创建新插件的实用程序脚本 - “plugin.sh”。您将使用插件名称，版本，可选择的路径来调用它：

source: The script will sanityze and lowercase the name you provided, copy the templates files into the new directory, and then make some replacements.
cs_cz: Skript sanuje a převede na malá písmena poskytnutý název, zkopíruje soubory šablon do nové složky a udělá nějaká nahrazení.
fr_fr: Le script nettoiera et passera en minuscules le nom que vous ave fourni, copiera les fichiers modèles dans le nouveau répertoire, et effectuera quelques remplacements.
pt_pt: O script irá sintetizar e colocar em minúsculas o nome dado, copie os arquivos modelo para o novo directório e, em seguida, faça algumas substituições.
tr_tr: Betik yazdığınız adı arındırıp lüçük harfe dönüştürür, tema dosyalarını yeni klasöre kopyalar ve bazı değişiklikler yapar.
zh_cn: 该脚本将对您提供的名称进行审查和小写，将模板文件复制到新目录中，然后进行一些替换。

source: Using the script without destination parameter, it will create you directory plugin, ``mygreatplugin`` just beside its own directory. Otherwise, it would create the new directory in the specified path:
cs_cz: Použitím skriptu bez parametru cíle, je vytvořena složka vašeho zásuvného modulu, ``mygreatplugin`` hned vedle jeho vlastní složky. Jinak by vytvořil novou složku v zadaném umístění:
fr_fr: Si vous utilisez le script sans spécifier de dossier de destination, votre répertoire ``mygreatplugin`` sera placé tout à côté de son propre dossier. Autrement, le répertoire sera créé dans le chemin spécifié :
pt_pt: Usando o script sem parâmetro de destino, ele irá criar o seu plugin de diretório, ' ' mygreatplugin' ' apenas ao lado de seu próprio diretório. Caso contrário, ele criaria o novo diretório no caminho especificado:
tr_tr: Betik hedef parametresi olmadan kullanıldığında kendi bulunduğu klasör içine ``mygreatplugin`` klasörünü ekler. Yol belirtilmiş ise yeni klasör belirtilen yola eklenir:
zh_cn: 使用没有目标参数的脚本，它将创建你的目录插件，``mygreatplugin``就在它自己的目录旁边。否则，它将在指定的路径中创建新目录：

source: Update existing plugin
cs_cz: Aktualizovat stávající zásuvný modul
fr_fr: Mise à jour d'un plugin existant
pt_pt: Actualizar um plugin existente
tr_tr: Var olan uygulama ekini güncellemek
zh_cn: 更新现有插件

source: There is no automated way to update an existing plugin, because there would be too many cases to handle. But don't worry, procedure is quite simple ;)
cs_cz: Neexistuje automatizovaný způsob, jak aktualizovat stávající zásuvný modul, protože by bylo příliš mnoho případů, které podchytit. Ale nebojte se, postup je velmi jednoduchý ;)
fr_fr: Il n'y a pas de méthode automatique pour mettre à jour un plugin existant, il y aurait en effet bien trop de cas de figure à gérer. Mais ne vous inquiétez pas, la procédure est assez simple ;)
pt_pt: Não há nenhuma maneira automatizada de atualizar um plug-in existente, porque haveria muitos casos para manipular. Mas não se preocupe, o procedimento é bastante simples;)
tr_tr: Gözden geçirilmesi gereken çok sayıda durum olduğundan henüz var olan uygulama ekleri otomatik olarak güncellenemiyor. Gene de sorun değil, işlem oldukça basit ;)
zh_cn: 没有自动更新现有插件的方法，因为要处理的案例太多。但不要担心，程序很简单;）

source: Using empty features is as simple as creating a few files:
cs_cz: Použití prázdných funkcí je snadné jako vytvoření několika souborů:
fr_fr: L'utilisation des possibilités de empty est aussi simple que la création de quelques fichiers :
pt_pt: Usando os recursos de vazios é tão simples como criar alguns arquivos:
tr_tr: Boş özellikleri kullanmak bir kaç dosya oluşturmak kadar kolay:
zh_cn: 使用空功能就像创建一些文件一样简单：

source: If you do not have yet any composer or travis configuration file, you can just copy the ones from empty plugin. Otherwise; in you ``composer.json``, just add:
cs_cz: Pokud doposud nemáte soubor s nastavením pro composer nebo travis, je možné jednoduše zkopírovat ty z prázdného zásuvného modulu. Pokud už máte; do ``composer.json`` přidejte:
fr_fr: Si vous n'avez pas encore de configuration composer ou travis, vous pouvez simplement copier celles du plugin empty. Dans le cas contraire ; ajoutez dans votre ``composer.json`` :
pt_pt: Se você ainda não tem qualquer compositor ou arquivo de configuração Travis, você pode simplesmente copiar os de plugin vazio. Caso contrário em você ' ' Composer. JSON ' ', basta adicionar:
tr_tr: Herhangi bir composer ya da travis yapılandırma dosyanız yoksa, boş uygulama ekindeki dosyaları kopyalayın. Varsa; ``composer.json`` dosyasına şunu ekleyin:
zh_cn: 如果您还没有任何composer或travis配置文件，则可以从空插件中复制那些文件。在你``composer.json``中，只需添加：

source: And then run ``composer require glpi-project/tools``.
cs_cz: A poté spusťte ``composer require glpi-project/tools``.
fr_fr: Et ensuite lancez ``composer requires glpi-project/tools``.
pt_pt: E, em seguida, executar ' ' compositor exigem GLPI-Project/Tools ' '.
tr_tr: Ardından ``composer require glpi-project/tools`` komutunu çalıştırın.
zh_cn: 然后运行``composer require glpi-project/tools``。

source: In the travis configuration file, just add the CS call:
cs_cz: V souboru s nastaveními pro travis stačí přidat CS volání:
fr_fr: Dans le ficheir de configuration de travis, ajoutez juste l'appel au CS :
pt_pt: No arquivo de configuração Travis, basta adicionar a chamada CS:
tr_tr: Travis yapılandırma dosyasına CS çağrısını ekleyin:
zh_cn: 在travis配置文件中，只需添加CS调用：

source: In the ``.gitignore`` file, add the following:
cs_cz: Do souboru ``.gitignore`` přidejte následující:
fr_fr: Dans le fichier ``.gitignore``, ajoutez ce qui suit :
pt_pt: No arquivo ' '. gitignore ' ', adicione o seguinte:
tr_tr: ``.gitignore`` dosyasına şunu ekleyin:
zh_cn: 在``.gitignore``文件中，添加以下内容：

source: As for the Robo.li configuration file, note that the one embed in the empty plugin is a bit specific, you'll have to edit it in order to get things working. See below for more informations.
cs_cz: Ohledně souboru s nastaveními Robo.li, mějte na paměti, že ten obsažený v prázdném zásuvném modulu je poněkud specifický a bude ho proto třeba upravit aby vše fungovalo. Viz další informace níže.
fr_fr: Quant au fichier de configuration de Robo.li, notez que celui qui est fourni par le plugin empty est quelque peu spécifique, vous devrez le modifier pour que tout fonctionne. Voir ci-dessous pour plus d'informations.
pt_pt: Quanto ao arquivo de configuração Robo.li, note que o um incorporar no plugin vazio é um pouco específico, você terá que editá-lo, a fim de obter as coisas funcionando. Veja abaixo para mais informações.
tr_tr: Robo.li yapılandırma dosyasında, boş uygulama ekini gömmenin biraz incelikli olduğunu unutmayın. Sorunsuz çalışması için düzenlemeniz gereken bazı şeyler var. Ayrıntılı bilgi almak için aşağıya bakın.
zh_cn: 至于Robo.li配置文件，请注意嵌入空插件的那个有点特别，你必须编辑它才能使它正常工作。有关更多信息，请参见下文。

source: Finally, as the ``tools`` project will provide you some features, you can remove duplicated tools scripts (files such as ``release``, ``extract_template.sh``, ...) that would be present in your plugin.
cs_cz: A nakonec, protože projekt ``tools`` vám poskytne některé funkce, můžete odebrat duplikované skripty-nástroje (soubory jako třeba ``release``, ``extract_template.sh``, …) které by se nacházely ve vašem zásuvném modulu.
fr_fr: Pour finir, comme le projet ``tools`` fournit quelques fonctionnalités, vous pouvez supprimer les scripts utilitaires en doublon (les fichiers tels que ``release``, ``extract_template.sh``, ...) qui pourraient être présents dans votre plugin.
pt_pt: Finalmente, como o projeto ' ' Tools ' ' irá fornecer-lhe alguns recursos, você pode remover scripts de ferramentas duplicadas (arquivos como ' ' Release ' ', ' ' extract_template. sh ' ',...) que estariam presentes em seu plugin.
tr_tr: Son olarak ``tools`` projesi size bazı özellikler sunar. Uygulama ekinizde bulunabilecek çift araç betiği dosyalarını silebilirsiniz (`release``, ``extract_template.sh``, gibi).
zh_cn: 最后，由于``tools``项目将为您提供一些功能，您可以删除重复的工具脚本（例如``release``，``extract_template.sh``，...等文件）。

source: Features
cs_cz: Funkce
fr_fr: Fonctionnalités
pt_pt: Características
tr_tr: Özellikler
zh_cn: 特征

source: Coding standards
cs_cz: Standardy zápisu zdrojových kódů
fr_fr: Standards de codage
pt_pt: Padrões de codificação
tr_tr: Kodlama standartları
zh_cn: 编码标准

source: The GLPI `PHPCodeSniffer <http://pear.php.net/package/PHP_CodeSniffer>`_ rulesets are provided as ``vendor/glpi-project/coding-standard/GlpiStandard/``.
cs_cz: Sady pravidel GLPI `PHPCodeSniffer <http://pear.php.net/package/PHP_CodeSniffer>`_ jsou poskytovány jako ``vendor/glpi-project/coding-standard/GlpiStandard/``.
fr_fr: Les règles GLPI `PHPCodeSniffer <http://pear.php.net/package/PHP_CodeSniffer>`_ sont fournis en tant que ``vendor/glpi-project/coding-standard/GlpiStandard/``.
pt_pt: O GLPI ' PHPCodeSniffer < http://pear.php.net/package/PHP_CodeSniffer > ' _ RuleSets são fornecidos como ' ' fornecedor/GLPI-Project/Coding-Standard/GlpiStandard/' '.
tr_tr: GLPI `PHP KodTarayıcı <http://pear.php.net/package/PHP_CodeSniffer>`_ kural kümesi, ``vendor/glpi-project/coding-standard/GlpiStandard/`` biçiminde sunulur.
zh_cn: GLPI `PHPCodeSniffer <http://pear.php.net/package/PHP_CodeSniffer>`_ rulesets以``vendor/glpi-project/coding-standard/GlpiStandard/``的形式提供。

source: To check coding standards, just use the Robo.li task ``code:cs``:
cs_cz: Pro kontrolu standardu zápisu zdrojových kódů stačí použít Robo.li úlohu ``code:cs``:
fr_fr: Pour vrifier les standards, utilisez la tâche ``code:cs`` de Robo.li :
pt_pt: Para verificar os padrões de codificação, basta usar a tarefa Robo.li ' ' código: cs ' ':
tr_tr: Kodlama standartlarını denetlemek için Robo.li task ``code:cs`` kullanın:
zh_cn: 检查编码标准，只需使用Robo.li任务``code:cs``：

source: The above command will ignore ``vendor`` and run on the current directory.
cs_cz: Výše uvedený příkaz bude ignorovat ``vendor`` a bude spuštěný na stávající složce.
fr_fr: La commande ci dessus ignorera ``vendor`` et sera lancée dans le répertoire courant.
pt_pt: O comando acima ignorará ' ' Vendor ' ' e executado no diretório atual.
tr_tr: Yukarıdaki komut ``vendor`` seçeneğini yok sayar ve geçerli klasörde yürütülür.
zh_cn: 上面的命令将忽略``vendor``并在当前目录上运行。

source: If you want to adapt ignore list or checked directories, you can just override ``$csignore`` and/or ``$csfiles`` in the ``RoboFile.php`` of the plugin:
cs_cz: Pokud chcete přizpůsobit seznam ignorovaného nebo kontrolované složky, stačí přepsat ``$csignore`` a/nebo ``$csfiles`` v souboru ``RoboFile.php`` zásuvného modulu:
fr_fr: Si vous souhaitez adapter la liste d'ignorance ou les dossiers vérifiés; vous pouvez simplement surcharger ``$csignore`` et/ou ``$csfiles`` dans le ``RoboFile.php`` du plugin :
pt_pt: Se você quiser adaptar a lista de ignorados ou diretórios verificados, você pode simplesmente substituir ' ' $csignore ' ' e/ou ' ' $csfiles ' ' no ' ' RoboFile. php ' ' do plugin:
tr_tr: Yok sayma listesi ya da denetlenmiş klasörleri uygulamak istiyorsanız, uygulama ekinin ``RoboFile.php`` dosyasındaki ``$csignore`` ve ``$csfiles`` değerlerini değiştirmeniz yeterlidir:
zh_cn: 如果你想修改忽略列表或检查目录，你可以在插件的``RoboFile.php``中覆盖``$csignore``和/或``$csfiles``：

source: Automated checks
cs_cz: Automatizované kontroly
fr_fr: Vérifications automatiques
pt_pt: Verificações automatizadas
tr_tr: Otomatik denetimler
zh_cn: 自动检查

source: For convenience; a ``.travis.yml`` file is also provided, that is setup to:
cs_cz: Pro pohodlí je poskytován také soubor ``.travis.yml``, který je nastavený na:
fr_fr: Pour des raisons pratiques, un fichier ``.travis.yml`` est également fourni, il est paramétré pour :
pt_pt: Por conveniência; um arquivo ' '. Travis. yml ' ' também é fornecido, que é a configuração para:
tr_tr: Kolaylık sağlamak için önceden hazırlanmış bir ``.travis.yml`` dosyası sunulmuştur ve şunları kapsar:
zh_cn: 为了方便；还提供了``.travis.yml``文件，设置为：

source: check coding standards,
cs_cz: zkontrolovat dodržení standardu zápisu zdrojových kódů
fr_fr: vérifier les standards de codage,
pt_pt: verificar padrões de codificação,
tr_tr: Kodlama standartlarını denetler,
zh_cn: 检查编码标准，

source: run on a bunch on different configuration
cs_cz: spustit na více různých nastaveních
fr_fr: être lancé sur un certain nombre de configurations différentes
pt_pt: executado em um grupo em configuração diferente
tr_tr: Farklı yapılandırmalar üzerinde çalışır
zh_cn: 在不同的配置上运行堆

source: You still have to enable travis-ci builds from the website in order to activate automated tests.
cs_cz: Pro aktivaci automatizovaných testů je i tak třeba zapnout travis-ci sestavení z webové stránky.
fr_fr: Vous devrez cependant activer les constructions depuis travis-ci depuis leur site web pour que les tests automatiques soient actifs.
pt_pt: Você ainda tem que ativar o Travis-CI constrói a partir do site, a fim de ativar testes automatizados.
tr_tr: Otomatik denetimlerin yapılabilmesi için site üzerinde travis-ci yapımlarını etkinleştirmeniz gerekir.
zh_cn: 您仍然必须从网站启用travis-ci构建才能激活自动化测试。

source: Of course, the ``.travis.yml`` file can be pimped; you can run unit tests, create/update a database, activate notifications, and so on. Refer to the `Travis-CI documentation <https://docs.travis-ci.com/>`_ to know more.
cs_cz: Soubor ``.travis.yml`` lze samozřejmě poladit; je možné přidat jednotkové testy, vytvářet/aktualizovat databázi, zapnout upozorňování, atd. Více informací viz `dokumentace k Travis-CI <https://docs.travis-ci.com/>`_.
fr_fr: Bien entendu, le fichier ``.travis.yml`` peut être adapté ; vous pouvez lancer des tests unitaires, créer/modifier une base de données, activer les notifications, etc. Référez-vous à la `documentation Travis-CI <https://docs.travis-ci.com>`_ pour plus de détails.
pt_pt: Claro, o arquivo ' '. Travis. yml ' ' pode ser pimped; Você pode executar testes de unidade, criar/atualizar um banco de dados, ativar notificações e assim por diante. Consulte a documentação do Travis-CI < https://docs.travis-ci.com/> ' _ para saber mais.
tr_tr: ``.travis.yml`` dosyası değiştirilebilir. Birim denetimleri yürütmek, bir veri tabanını oluşturmak ya da güncellemek, bildirimleri etkinleştirmek gibi işlemler ekleyebilirsiniz. Ayrıntılı bilgi almak için `Travis-CI belgelerine <https://docs.travis-ci.com/>`_ bakın.
zh_cn: 当然，``.travis.yml``文件可能原型；您可以运行单元测试，创建/更新数据库，激活通知等。请参阅`Travis-CI文档<https://docs.travis-ci.com/>`_了解更多信息。

source: Minifying CSS and JS
cs_cz: Sloučení CSS a JS
fr_fr: Réduction des CSS et JS
tr_tr: CSS ve JS dosyalarını küçültmek

source: Disabled as of 0.1.13, because libs used from Robo are out of date and connot be replaced.
cs_cz: Zakázáno od 0.1.13, protože libs použitý od Robo jsou zastaralé a nelze je nahradit.
fr_fr: Désactivé à partir de la 0.1.13, les bibliothèques utilisées par Robo sont anciennes et ne peuvent être remplacées.
tr_tr: Robo kitaplıkları eskimiş olduğundan ve değiştirilemediğinden 0.1.13 sürümüyle birlikte devre dışı bırakıldı.

source: A convenient script, using `Robo.li <http://robo.li>`_ is provided. The ``RoboFile.php`` file is an empty class that extends ``Glpi\Tools\RoboFile`` (provided by ``glpi-project/tools`` dependency) in which you can set your own stuff.
cs_cz: Je poskytován pohodlný skript, využívající `Robo.li <http://robo.li>`_. Soubor ``RoboFile.php`` je prázdná třída které rozšiřuje ``Glpi\Tools\RoboFile`` (poskytovanou závislostí ``glpi-project/tools``) ve které si můžete nastavit své vlastní věci.
fr_fr: Un script d'agrément, qui utilise `Robo.li <http://robo.li>`_ est fournit. Le fichier ``RoboFile.php`` est une classe vide qui étends ``Glpi\Tools\RoboFile`` (fournie par la dépendance ``glpi-project/tools``) dans laquelle vous pouvez définir ce que vous voulez.
pt_pt: Um script conveniente, usando ' Robo.li < http://robo.li > ' _ é fornecido. O arquivo ' ' RoboFile. php ' ' é uma classe vazia que estende ' ' Glpi\Tools\RoboFile ' ' (fornecido por ' ' GLPI-Project/Tools ' ' dependência) em que você pode definir suas próprias coisas.
tr_tr: `Robo.li <http://robo.li>`_ kullanan standart bir betik sunulmuştur. `RoboFile.php`` dosyasında ``Glpi\Tools\RoboFile`` (``glpi-project/tools`` bağlılığı tarafından sunulan) özelliklerini genişleten boş bir sınıf bulunur. Burada istediğiniz ayarları yapabilirsiniz.
zh_cn: 使用`Robo.li <http://robo.li>`_提供了一个方便的脚本。``RoboFile.php``文件是一个空类，它扩展了``Glpi\Tools\RoboFile``（由``glpi-project/tools``依赖提供），你可以在其中设置自己的东西。

source: That way, you can quite easily update the common file and get your own tasks remaining the same.
cs_cz: Tímto způsobem je možné velmi snadno aktualizovat společný soubor a přitom vaše vlastní úlohy zůstanou, jak jsou.
fr_fr: De cette manière, vous pourrez facilement tenir à jour le fichier commun sans que vos tâches spécifiques ne soient affectées.
pt_pt: Dessa forma, você pode facilmente atualizar o arquivo comum e obter suas próprias tarefas restantes o mesmo.
tr_tr: Böylece ortak dosyayı kolayca güncelleyerek kendi görevlerinizin aynı kalmasını sağlayabilirsiniz.
zh_cn: 这样，您可以非常轻松地更新公共文件并使您自己的任务保持不变。

source: To get the required libs installed, you'll have to `get composer installed <http://getcomposer.org>`_ and then run:
cs_cz: Pro získání potřebných knihoven bude třeba `nainstalovat composer <http://getcomposer.org>`_ a pak spustit:
fr_fr: Pour installer les bibliothèques requises, vous devrez `installer composer <http://getcomposer.org>`_ puis lancer :
pt_pt: Para obter as bibliotecas necessárias instaladas, você terá que ' obter compositor instalado < http://getcomposer.org > ' _ e, em seguida, executar:
tr_tr: Gerekli kitaplıkların yüklenmesi için get composer <http://getcomposer.org>`_ yükleyip şunu çalıştırmalısınız:
zh_cn: 要安装所需的库，你必须“安装镜像<http://getcomposer.org>`_然后运行：

source: There are three available targets:
cs_cz: Zde jsou k dispozici tři cíle:
fr_fr: Il y a 3 cibles disponibles :
pt_pt: Há três alvos disponíveis:
tr_tr: Üç hedef seçilebilir:
zh_cn: 有三个目标：

source: ``minify`` that will minify all CSS and JS files (see below),
cs_cz: ``minify`` které minifikuje všechny CSS a JS soubory (viz níže),
fr_fr: ``minify`` qui va minimifier tous les ficheirs CSS et JS (voir ci-dessous),
pt_pt: ' ' reduza ' ' que irá comprimir todos os arquivos CSS e js (veja abaixo),
tr_tr: ``küçült`` tüm CSS ve JavaScript dosyalarını küçültür (aşağıya bakın),
zh_cn: ``minify``将缩小所有CSS和JS文件（见下文），

source: ``minify:css`` that will minify all css stylesheets files in the ``css`` directory of your plugin, creating a ``.min.css`` version along with the original file,
cs_cz: ``minify:css`` které minifikuje všechny tabulky css stylů ve složce ``css`` zásuvného modulu, vytvoří verzi``.min.css`` vedle původního souboru,
fr_fr: ``minify:css`` qui va minimifier toutes les feuilles de style CSS dans le dossier ``css`` de votre plugin, en créant une version ``.min.css`` version à côté du fichier original,
pt_pt: ' ' reduza: CSS ' ' que irá comprimir todos os arquivos de folhas de estilo CSS no diretório ' ' CSS ' ' do seu plugin, criando uma versão ' '. min. css ' ' juntamente com o arquivo original,
tr_tr: ``küçült:css`` uygulama ekinizin ``css`` klasöründeki tüm css stil sayfalarını küçülterek özgün dosyaların yanında ``.min.css`` sürümlerini oluşturur.
zh_cn: ``minify：css``将缩小插件的``css``目录中的所有css样式表文件，创建一个``.min.css``版本以及原始文件，

source: ``minify:js`` that will minify all javascript files in the ``js`` directory of your plugin, creating a ``.min.js`` version along with the original file.
cs_cz: ``minify:js`` které minifikuje všechny javascript soubory ve složce ``js`` zásuvného modulu, vytvoří verzi ``.min.js`` vedle původního souboru.
fr_fr: ``minify:js`` qui va minimifier tous les fichiers javascript dans le dossier ``js`` de votre plugin, en créant une version ``.min.js`` version à côté du fichier original.
pt_pt: ‘ ‘ reduza :js’ ‘ que irá comprimir todos os arquivos javascript no diretório ``js`` do seu plugin, criando uma versão ``.min.js``` junto com o arquivo original.
tr_tr: ``küçült:js`` uygulama ekinizin ``js`` klasöründeki tüm javascript dosyalarını küçülterek özgün dosyaların yanında ``.min.js`` sürümlerini oluşturur.
zh_cn: ``minify:js``将缩小插件的``js``目录中的所有javascript文件，创建一个``.min.js``版本以及原始文件。

source: Just choose a target, and run something like:
cs_cz: Stačí zvolit cíl a spustit něco jako:
fr_fr: Choisissez simplement une cible, et lancer comme ceci :
pt_pt: Basta escolher um alvo e executar algo como..:
tr_tr: Yalnız hedefi seçin ve şunun gibi bir şey çalıştırın:
zh_cn: 只需选择目标，然后执行以下操作：
