Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/uninstall/index.po
Languages: tr_tr

source: Uninstall
tr_tr: Kaldır

source: Download
tr_tr: İndir

source: Sources
tr_tr: Kaynaklar

source: Requirements (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
tr_tr: GLPI sürümü

source: Minimum PHP
tr_tr: En düşük PHP sürümü

source: Recommended
tr_tr: Önerilen

source: This plugin is available without a GLPI-Network subscription. It is also available in `Cloud <https://glpi-network.cloud/>`_
tr_tr: Bu uygulama eki bir GLPI-Network aboneliği olmadan kullanılabilir. Ayrıca `Cloud <https://glpi-network.cloud/>`_ üzerinde de bulunuyor

source: Features
tr_tr: Özellikler

source: This plugin, named "uninstall" or "Item Uninstallation", allows you to remove / replace devices from the inventory by automating certain actions on the fields.
tr_tr: "Kaldır" ya da "Öğe kaldır" olarak adlandırılan bu uygulama eki, alanlar üzerinde yapılan belirli işlemleri otomatikleştirerek aygıtları envanterden kaldırmanızı / değiştirmenizi sağlar.

source: It allows to manage the different stages of the life cycle of a hardware. It has been designed, among other things, to handle the following cases:
tr_tr: Bir donanımın yaşam döngüsünün farklı aşamalarının yönetilmesini sağlar. Diğer şeylerin yanında aşağıdaki durumları ele almak üzere tasarlanmıştır:

source: scrapping of equipment
tr_tr: Aygıtın hurdaya çıkarılması

source: removal from inventory of temporary equipment due to breakdown
tr_tr: Bozulma nedeniyle geçici aygıtın envanterden çıkarılması

source: Replacement of equipment under a warranty for example (See: Replacement Equipment Feature)
tr_tr: Aygıtın garanti kapsamında değiştirilmesi (aygıt değiştirme özelliği)

source: Once installed, the plugin includes :
tr_tr: Kurulduğunda uygulama ekinde şunlar bulunur:

source: a rights management directly accessible from Administration -> Profiles (in the Plugins tab -> uninstall),
tr_tr: Yönetim -> Profiller bölümünden doğrudan erişilebilen bir izin yönetimi (Uygulama ekleri sekmesinde -> Kaldır),

source: a "hardware uninstall" menu in "Configuration",
tr_tr: "Yapılandırma" bölümünde "Donanımı kaldır" menüsü,

source: an "uninstall" menu in the user preferences.
tr_tr: Kullanıcı ayarlarında "kaldır" menüsü.

source: Right managment
tr_tr: İzin yönetimi

source: It is possible to deny access to the plugin or to allow it by specifying the read or write option on the templates.
tr_tr: Uygulama ekinin erişimi reddedilebilir ya da kalıplarda okuma ya da yazma seçeneği belirtilerek izin verilebilir.

source: To do this, simply go to the menu "Administration" > "Profiles", to select the profile you wish to modify, then in the "Uninstallation" tab set the following options :
tr_tr: Bunu yapmak için, "Yönetim" > "Profiller" menüsüne giderek değiştirmek istediğiniz profili seçin. Ardından "Kaldır" sekmesinde aşağıdaki seçenekleri ayarlayın:

source: *No access*: the plugin does not appear in the menu 'Plugin'.
tr_tr: *Erişim yok*: Uygulama eki 'Uygulama ekleri' menüsünde görüntülenmez.

source: *Playback*: only the use of previously created templates is possible
tr_tr: *Oynatma*: Yalnız önceden oluşturulmuş kalıplar kullanılabilir

source: *Writing*: Template creation is possible.
tr_tr: *Writing*: Kalıp oluşturulabilir.

source: *Hardware replacement*: standard hardware replacement is possible
tr_tr: *Donanım değişikliği*: Standart donanım değişikliği yapılabilir

source: Uninstall feature
tr_tr: Kaldırma özelliği

source: This functionality of the plugin 'Item Uninstallation' adds the possibility of modifying the value of certain fields and of removing the inventory of a computer of the OCS base or the cleaning of the FusionInventory tables.
tr_tr: 'Öğe kaldır' uygulama ekinin bu özelliği, belirli alanların değerini değiştirme ve OCS tabanındaki bir bilgisayarın envanterini kaldırma ya da FusionInventory tablolarını temizleme olanağı sağlar.

source: The uninstall templates can be accessed in the "Administration > Uninstall Hardware" menu.
tr_tr: Kaldırma kalıplarına "Yönetim > Donanımı kaldır" menüsünden erişilebilir.

source: You can create as many uninstall templates as you want. Each template can contain different features, and be visible in the sub-entities or not.
tr_tr: İstediğiniz kadar kaldırma kalıbı oluşturabilirsiniz. Her kalıpta farklı özellikler bulunabilir ve alt birimlerde görüntülenebilir ya da görüntülenmeyebilir.

source: Uninstall equipment is a transfer of the equipment to itself. During its transfer, a certain number of actions are performed, as specified in the definition of transfer.
tr_tr: Aygıt kaldırma, aygıtın kendisine devredilmesidir. Aktarım sırasında, aktarım tanımında belirtilen işlemler gerçekleştirilir.

source: *Name*: the name of the uninstall template
tr_tr: *Ad*: Kaldırma kalıbının adı

source: *Sub-entities*: indicates whether the template is visible in the creation entity and its sub-entities
tr_tr: *Alt birimler*: Kalıbın oluşturulduğu birimde ve alt birimlerinde görünür olup olmayacağını belirtir

source: *Model type*: indicates which type of model should be used (either Uninstall or Replace)
tr_tr: *Model türü*: Kullanılacak model türünü belirtir (kaldır ya da değiştir)

source: *Comments*: free fields to add details about the model
tr_tr: *Yorumlar*: Modelle ilgili ayrıntıların yazılabileceği alanlar sağlar

source: *Transfer template to be used*: Indicates the transfer template to be used when uninstalling the system.
tr_tr: *Kullanılacak aktarım kalıbı*: Sistemi kaldırırken kullanılacak aktarım kalıbını belirtir.

source: *New hardware status*: indicates which status the hardware should take once uninstalled
tr_tr: *Yeni donanım durumu*: Kaldırıldıktan sonra donanıma atanacak durumu belirtir

source: *New group*: indicates the group to which the hardware can belong once uninstalled.
tr_tr: *Yeni grup*: Kaldırıldıktan sonra donanımın ait olabileceği grubu belirtir.

source: *Software History Deletion* : Allows deletion of all lines in a computer's history that are relevant to software installations/uninstallations.
tr_tr: *Yazılım geçmişi silme* : Bir bilgisayarın geçmişindeki yazılım kurma/kaldırma işlemleriyle ilgili tüm satırların silinmesini sağlar.

source: *REMOVE Name* : removes the name of the hardware during uninstallation
tr_tr: *Adı sil* : Kaldırma sırasında donanımın adını kaldırır

source: *RAZ Contact* : removes the contact reassembled by OCS during uninstallation
tr_tr: *RAZ ilgili* : Kaldırma sırasında OCS tarafından eklenen ilgiliyi kaldırır

source: *Network reset*: resets the "network" field of the equipment record to zero.
tr_tr: *Ağ sıfırlama*: Aygıt kaydının "ağ" alanını sıfır olarak ayarlar.

source: *RAZ OS*: Removes OS information (OS, Version, Service Pack, Product Key, Product ID) when uninstalling.
tr_tr: *RAZ işletim sistemi*: Kaldırma sırasında işletim sistemi bilgilerini (işletim sistemi sürüm, hizmet paketi, ürün anahtarı, ürün kimliği) kaldırır.

source: *RAZ domain* : removes the "domain" field from the hardware
tr_tr: *RAZ etki alanı* : Donanımdan "etki alanı" alanını kaldırır

source: *Remove IP & Gateway & Hacker & Subnet*: removes network information (except for the MAC address, which is hardware-related) during uninstallation
tr_tr: *IP ve ağ geçidini ve hacker ve alt ağı kaldır*: Kaldırma sırasında ağ bilgilerini (donanımla ilgili MAC adresi dışında) kaldırır

source: *Remove the machine from OCS* : when uninstalling a computer in GLPI, remove from the OCS base the corresponding machine
tr_tr: *Bilgisayarı OCS üzerinden kaldır* : GLPI üzerinde bir bilgisayarı kaldırırken, OCS veri tabanından da kaldırır

source: *Delete FusionInventory info*: Delete all FusionInventory info for this material
tr_tr: *FusionInventory bilgilerini sil*: Bu materyal için tüm FusionInventory bilgilerini siler

source: Uninstall hardware
tr_tr: Donanımı kaldırmak

source: There are 2 possibilities to uninstall a hardware:
tr_tr: Bir donanımı kaldırmanın 2 yolu vardır:

source: from its file, in the tab "Uninstallation".
tr_tr: Donanım kaydındaki "Kaldır" sekmesinden.

source: from the massive modifications list
tr_tr: Toplu değişiklik listesinden

source: Since a template can be recursive (visible in the sub-entities), the list of templates displayed in the massive actions indicates all the templates available in the current entity (either those defined in this entity, or in an entity above it and visible in the sub-entities).
tr_tr: Bir kalıp hiyerarşide aşağıya doğru geçerli olabileceğinden (alt birimlerde görüntülenir), toplu işlemlerde görüntülenen kalıpların listesi, geçerli birimde kullanılabilecek tüm kalıpları gösterir (ya bu birimde tanımlananlar ya da bu birimin üzerindeki bir birimde ve alt birimlerinde görüntülenenler).

source: Change of location on uninstallation
tr_tr: Kaldırma sırasında konumu değiştirmek

source: It is possible to change the location of the hardware once it has been uninstalled. This selection is made either :
tr_tr: Kaldırıldıktan sonra donanımın konumu değiştirilebilir. Bu işlem iki şekilde yapılabilir:

source: in the hardware file, once the uninstallation model has been chosen.
tr_tr: Kaldırma modeli seçildikten sonra donanım dosyasından.

source: from the user's preferences for uninstallation by massive modification
tr_tr: Toplu değişiklikle kaldırma için kullanıcının ayarlarından

source: It should be noted that a location is declared within an entity. It is therefore possible, depending on the current entity, to define an uninstall location.
tr_tr: Bir birim içinde bir konumun bildirildiğine dikkat edilmelidir. Bu nedenle, var olan birime bağlı olarak bir kaldırma konumu belirtilebilir.

source: Replace feature
tr_tr: Değiştirme özelliği

source: This feature of the 'Item Uninstallation' plugin adds the possibility to replace one hardware by another.
tr_tr: 'Öge kaldır' uygulama ekinin bu özelliği, bir donanımın diğeriyle değiştirilebilmesini sağlar.

source: Replacement Model Form
tr_tr: Değişiklik modeli formu

source: Replacement models are managed in the same way as uninstall models: They are accessible in the menu "Administration > Uninstall hardware". Each model can contain different characteristics, and be visible in the sub-entities or not.
tr_tr: Değişiklik modelleri, kaldırma modelleriyle aynı şekilde yönetilir: Bunlara "Yönetim > Donanım kaldır" menüsünden erişilebilir. Her modelde farklı özellikler bulunabilir ve alt birimlerde görüntülenmesi ya da görüntülenmemesi sağlanabilir.

source: In this form there are 4 tabs :
tr_tr: Bu formda 4 sekme bulunur:

source: Main: allows to display on the page only the main information of the template.
tr_tr: Temel: Sayfada kalıbın yalnızca temel bilgilerinin görüntülenmesini sağlar.

source: Replacing data: displays the various actions to be performed when replacing one piece of equipment with another.
tr_tr: Verileri değiştirme: Bir aygıtı bir başkasıyla değiştirirken yapılacak çeşitli işlemleri görüntüler.

source: All: displays all the tabs on the same page
tr_tr: Tümü: Tüm sekmeleri aynı sayfada görüntüler

source: Here is the description of the fields of the main tab :
tr_tr: Temel bilgiler sekmesindeki alanlar şunlardır:

source: *Name*: the name of the replacement model *Sub-entities*: indicates whether the template is visible in the creation entity and its sub-entities *Model type*: indicates what type of model should be used (here we are talking about type - Replacement) *Comments*: free fields to add details about the model *New hardware status*: indicates which status the old hardware should take once it has been replaced
tr_tr: *Ad*: Değiştirilen modelin adı *Alt birimler*: Kalıbın oluşturulduğu birimde ve alt birimlerinde görüntülenip görüntülenmeyeceği *Model türü*: Ne tür bir modelin kullanılması gerektiği (Değiştirme işlemi için) *Açıklama*: Modelle ilgili ayrıntıların eklenebileceği boş alanlar *Yeni donanım durumu*: Değiştirildikten sonra eski donanıma atanacak durum

source: Replacing data tab
tr_tr: Değişiklik bilgileri sekmesi

source: Here is the description of the fields of the actions tab.
tr_tr: İşlemler sekmesindeki alanlar şunlardır:

source: *General Information*
tr_tr: *Genel bilgiler*

source: *Copy name*: allows you to define if you want to copy the name of the old hardware to the new one.
tr_tr: *Ad kopyalansın*: Eski donanımın adının yenisine kopyalanmasını sağlar.

source: *Copy the serial number*: Allows you to define if you wish to copy the serial number of the old equipment to the new one.
tr_tr: *Seri numarası kopyalansın*: Eski aygıtın seri numarasının yenisine kopyalanmasını sağlar.

source: *Copy the inventory number*: allows you to define if you want to copy the inventory number of the old equipment to the new one.
tr_tr: *Envanter numarası kopyalansın*: Eski aygıtın envanter numarasının yenisine kopyalanmasını sağlar.

source: *Overwrite information* (from the old material to the new one): this option allows you to choose the behavior to adopt if one of the unique information (Reservation, Financial Information, Name, Serial, Otherserial, Entity...) is present in the old material AND in the new material : *Yes* : by selecting YES, the information in the old material will replace that in the new material. *No*: by selecting NO, the information of the new hardware will NEVER be overwritten by the information of the old hardware.
tr_tr: *Bilgileri değiştir* (eski aygıttan yenisine): Bu seçenek, eski aygıtta varsa eşsiz bilgilerden (ayırtma, mali bilgiler, ad, seri, diğer seri, birim...) birini seçmenizi VE yeni aygıtta: *Evet* : EVET seçildiğinde, eski aygıttaki bilgiler yeni aygıttaki bilgilerin yerini alır. *Hayır*: HAYIR seçildiğinde, eski aygıt bilgileri ASLA yeni aygıt bilgilerinin üzerine yazılmaz.

source: *Method of archiving old material*
tr_tr: *Eski aygıtın arşivlenme yöntemi*

source: In this option, we define the behavior that the uninstall plugin must adopt with the old hardware :
tr_tr: Bu seçenekte, kaldırma uygulama ekinin eski aygıttan alması gereken bilgiler tanımlanır:

source: *Purge + PDF / CSV*: if you have the PDF plugin the old hardware will be purged from the GLPI database and its information will be attached to the new hardware in a PDF document. If you do not have the PDF plugin, they will be stored in CSV format.
tr_tr: *Temizle + PDF / CSV*: PDF uygulama ekiniz varsa, eski aygıt GLPI veri tabanından temizlenir ve bilgileri bir PDF belgesi olarak yeni donanıma eklenir. PDF uygulama ekiniz yoksa, bu bilgiler CSV biçiminde kaydedilir.

source: *Deletion + Comments*: the old hardware is put in the trash and a comment is added in each of the two hardware ("This hardware has been replaced by..." and "This hardware has replaced the hardware...").
tr_tr: *Silme + Açıklamalar*: Eski aygıt çöp kutusuna atılır ve iki aygıta da birer açıklama eklenir ("Bu aygıtın yerine şu aygıt takıldı... ve "Bu aygıt şu aygıtın yerine takıldı...") .

source: *Data location - Connection with other hardware*
tr_tr: *Konum verisi - Diğer donanımlarla bağlantı*

source: *Copy Documents*: Allows you to attach documents from old equipment to new equipment.
tr_tr: *Belgeler kopyalansın*: Eski aygıttaki belgelerin yeni aygıta aktarılmasını sağlar.

source: *Copy Contracts*: allows you to attach the contracts from the old equipment to the new equipment.
tr_tr: *Sözleşmeler kopyalansın*: Eski aygıttaki sözleşmelerin yeni aygıta aktarılmasını sağlar.

source: *Copy financial information*: allows you to attach financial information from the old equipment to the new equipment. Warning: if the "Overwrite information" option is activated, even if the new hardware has financial information, it will be replaced by the old hardware.
tr_tr: *Mali bilgiler kopyalansın*: Eski aygıttaki mali bilgilerin yeni aygıta aktarılmasını sağlar. Uyarı: "Bilgilerin üzerine yazılsın" seçeneği etkinleştirildiğinde, yeni aygıtın mali bilgileri var olsa bile, eski aygıtın bilgileri ile değiştirilir.

source: *Copy Reservations*: Allows you to attach the reservations made on the old equipment to the new equipment. Attention: same remark as for the financial information.
tr_tr: *Ayırtma bilgileri kopyalansın*: Eski aygıttaki ayırtma bilgilerinin yeni aygıta aktarılmasını sağlar. Uyarı: "Bilgilerin üzerine yazılsın" seçeneği etkinleştirildiğinde, yeni aygıtın ayırtma bilgileri var olsa bile, eski aygıtın bilgileri ile değiştirilir.

source: *Copy the user*: allows you to pass on the user of the old equipment to the new one. Caution: same remark as for the financial information.
tr_tr: *Kullanıcı kopyalansın*: Eski aygıttaki kullanıcı bilgilerinin yeni aygıta aktarılmasını sağlar. Uyarı: "Bilgilerin üzerine yazılsın" seçeneği etkinleştirildiğinde, yeni aygıtın kullanıcı bilgileri var olsa bile, eski aygıtın bilgileri ile değiştirilir.

source: *Copy group*: Allows you to assign the group of the old equipment to the new equipment. Caution: same remark as for the financial information.
tr_tr: *Grup kopyalansın*: Eski aygıttaki grup bilgilerinin yeni aygıta aktarılmasını sağlar. Uyarı: "Bilgilerin üzerine yazılsın" seçeneği etkinleştirildiğinde, yeni aygıtın grup bilgileri var olsa bile, eski aygıtın bilgileri ile değiştirilir.

source: *Copy the tickets*: Allows you to attach the tickets of the old equipment to the new equipment.
tr_tr: *Destek kayıtları kopyalansın*: Eski aygıttaki destek kayıtlarının yeni aygıta aktarılmasını sağlar.

source: *Copy network connections*: Allows you to transfer the network connections from the old hardware to the new hardware.
tr_tr: *Ağ bağlantıları kopyalansın*: Eski aygıttaki ağ bağlantılarının yeni aygıta aktarılmasını sağlar.

source: *Copy direct connections*: Allows you to transfer the direct connections (Monitor, Printer, Device, Phone) from the old hardware to the new hardware.
tr_tr: *Doğrudan bağlantılar kopyalansın*: Eski aygıttaki doğrudan bağlantıların (ekran, yazıcı, aygıt, telefon) yeni aygıta aktarılmasını sağlar.

source: Replace hardware
tr_tr: Donanım değiştirme

source: As well as uninstalling equipment, there are two ways to replace equipment:
tr_tr: Aygıtı kaldırmanın yanında aygıtı değiştirmenin de iki yolu vardır:

source: from the card of this one, in the tab "Plugins -> Uninstallation",
tr_tr: Kartından, "Uygulama ekleri -> Kaldır" sekmesinden,

source: from the massive modification list.
tr_tr: Toplu değişiklik listesinden.

source: Since a replacement template can be recursive (visible in the sub-entities), the list of templates displayed in the massive actions indicates all the templates available in the current entity (either those defined in this entity, or in an entity above it and visible in the sub-entities).
tr_tr: Bir değişiklik hiyerarşide aşağıya doğru geçerli olabileceğinden (alt birimlerde görüntülenir), toplu işlemlerde görüntülenen kalıpların listesi, geçerli birimde kullanılabilecek tüm kalıpları gösterir (ya bu birimde tanımlananlar ya da bu birimin üzerindeki bir birimde ve alt birimlerinde görüntülenenler).

source: Once you have selected the hardware to be replaced via the massive actions, or you use the "Uninstall" tab directly in it :
tr_tr: Toplu işlemlerle değiştirilecek donanımı seçtikten ya da doğrudan kartındaki "Kaldır" sekmesini kullandıktan sonra:

source: a summary of the selected template appears in order to show you the actions that will be performed by the plugin.
tr_tr: Uygulama eki tarafından gerçekleştirilecek işlemleri size göstermek için seçilen kalıbın bir özeti görüntülenir.

source: the list of the selected hardware(s) appears and you can choose the replacement hardware in the same way as when you choose a hardware in a Support Ticket.
tr_tr: Seçilmiş donanım(lar)ın listesi görüntülenir ve bir destek kaydında bir donanım seçerken olduğu gibi değiştirilen donanımı seçebilirsiniz.

source: Change of location on replacement
tr_tr: Değiştirme sırasında konumu değiştirmek

source: It is possible to change the location of the equipment once it has been replaced. This selection is made either :
tr_tr: Değiştirildikten sonra aygıtın yeri değiştirilebilir. Bu seçim şu şekillerde yapılabilir:

source: in the equipment sheet, once the replacement model has been chosen,
tr_tr: aygıt sayfasında değiştirilecek model seçildikten sonra,

source: from the user's preferences for massive modification replacement.
tr_tr: toplu değişiklik değişimi için kullanıcının ayarlarından.

source: Note that a location is declared within an entity. It is therefore possible, depending on the current entity, to define a replacement location.
tr_tr: Bir birim içinde bir konumun bildirildiğine dikkat edilmelidir. Bu nedenle, var olan birime bağlı olarak bir değiştirme konumu belirtilebilir.

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/Uninstall/>`_
tr_tr: Uygulama ekinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/Uninstall/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
