Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/agent_config/index.po
Languages: es_ar, tr_tr

source: Agent Config
es_ar: Configuración del Agente
tr_tr: Aracı yapılandırması

source: Requirements (on-premise)
es_ar: Requisitos (locales)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
es_ar: Versión de GLPI
tr_tr: GLPI sürümü

source: Minimum PHP
es_ar: Mínimo PHP
tr_tr: En düşük PHP sürümü

source: Recommended
es_ar: Recomendado
tr_tr: Önerilen

source: A `GLPI Network BASIC <https://services.glpi-network.com/#offers>`_ subscription (or higher) is required. This plugin is also available for all GLPI Network `Cloud instances <https://glpi-network.cloud>`_.
es_ar: Se requiere una suscripción a GLPI Network BASIC <https://services.glpi-network.com/#offers>`_ (o superior). Este complemento también está disponible para todas las instancias de GLPI Network Cloud <https://glpi-network.cloud>`_.
tr_tr: Bir `GLPI Network BASIC <https://services.glpi-network.com/#offers>`_ aboneliği (ya da üzeri) gereklidir. Bu eklenti tüm GLPI Network `Cloud kopyaları <https://glpi-network.cloud>`_ ile de edinilebilir.

source: Install the plugin
es_ar: Instalar el complemento
tr_tr: Eklentiyi kurmak

source: Go to the marketplace. Download and install the “`Agent config`” plugin.
es_ar: Vaya a la tienda. Descargue e instale el complemento «Agent config».
tr_tr: Mağazaya gidin. **Agent config** eklentisini indirip kurun.

source: Setting up the plugin
es_ar: Configuración del complemento
tr_tr: Eklentiyi kurmak

source: In **Setup** > **General** > **GLPI Agent Contiguration**, select the options you want :
es_ar: En **Configuración** > **General** > **Configuración del agente GLPI**, seleccione las opciones que desee:
tr_tr: **Kurulum** > **Genel** > **GLPI Agent Configuration** bölümünden istediğiniz ayarları yapın:

source: By default, the URL of the inventory is indicated
es_ar: Por defecto se indica la URL del inventario
tr_tr: Varsayılan olarak, varlığın adresi belirtilir

source: To secure your instance and limit feedback from your mobile devices, you can enter a **login** and **password** for each mobile device to be inventoried
es_ar: Para proteger su instancia y limitar los comentarios desde sus dispositivos móviles, puede ingresar un **nombre de usuario** y una **contraseña** para cada dispositivo móvil que se inventariará.
tr_tr: Kopyanızın güvenliğini sağlamak ve mobil aygıtlarınızdan gelen geri bildirimleri sınırlamak için, varlık kayıtlarına eklenecek her mobil aygıt için bir **kullanıcı adı** ve **parola** belirtebilirsiniz.

source: You can use a **tag entity** (choose **Yes** and indicate your **tag** if needed)
es_ar: Puede utilizar una **entidad de etiqueta** (elija **Sí** e indique su **etiqueta** si es necesario)
tr_tr: Bir **etiket varlığı** kullanabilirsiniz (**Evet** seçin ve gerekirse **etiketinizi** belirtin)

source: Choose the **asset type** by default (computers or phones, this information indicates the type of device by default, but can be modified individually from each device)
es_ar: Elige el **tipo de activo** por defecto (Computadores o teléfonos, este dato indica el tipo de dispositivo por defecto, pero se puede modificar individualmente desde cada dispositivo)
tr_tr: Varsayılan olarak **varlık türünü** seçin (bilgisayarlar veya telefonlar, bu bilgiler varsayılan olarak aygıt türünü gösterir, ancak her aygıttan ayrı ayrı değiştirilebilir)

source: Display **QR Code** (on central page)
es_ar: Mostrar **Código QR** (en la página central)
tr_tr: **Kare kodu** görüntüleyin (merkez sayfada)

source: Display **Deeplink** (on central page)
es_ar: Mostrar **Deeplink** (en la página central)
tr_tr: **Derin bağlantıyı** görüntüleyin (merkez sayfada)

source: Manage **automatic inventory and frequency** for android
es_ar: Administrar **inventario automático y frecuencia** para Android
tr_tr: Android için **otomatik envanter ve sıklık** ayarını yapın

source: setup the plugin
es_ar: configurar el complemento
tr_tr: eklentiyi kurun

source: Central page
es_ar: Página Central
tr_tr: Merkez sayfa

source: On **Home** > **GLPI Agent Config** use Deep link or QR Code to preconfigure the agent :
es_ar: En **Inicio** > **Configuración del agente GLPI** use un enlace profundo o un código QR para preconfigurar el agente:
tr_tr: **Giriş** > **GLPI Agent Config** bölümünden aracıyı önceden yapılandırmak için derin bağlantıyı ya da kare kodu kullanın:

source: Deeplink of QRCode
es_ar: Enlace profundo o código QR
tr_tr: Derin bağlantı ya da kare kod

source: When a factory reset is performed on the phone, the serial number automatically generated by the agent changes You can use **Deep Link** / **QR Code** to configure the agent with the serial number previously generated and inventoried in GLPI.
es_ar: Cuando se realiza un restablecimiento de fábrica en el teléfono, el número de serie generado automáticamente por el agente cambia Puedes utilizar **Deep Link** / **QR Code** para configurar el agente con el número de serie previamente generado e inventariado en GLPI.
tr_tr: Telefon fabrika ayarlarına sıfırlandığında, aracı tarafından otomatik olarak oluşturulan seri numarası değişir. Aracıyı daha önce oluşturulan ve GLPI üzerinde varlık kaydı yapılmış seri numarasıyla yapılandırmak için **derin bağlantı** / **Kare kod** kullanabilirsiniz.

source: Setup mobile device
es_ar: Configurar el dispositivo móvil
tr_tr: Mobil aygıtı kurun

source: Download the **Agent GLPI** on the Google Store
es_ar: Descargue el **Agente GLPI** en Google Store
tr_tr: Google Store üzerinden **Agent GLPI** uygulamasını indirin

source: Install agent on the Google Store
es_ar: Instalar agente en Google Store
tr_tr: Google Store üzerinden aracıyı kurun

source: With Deep Link
es_ar: Con Enlace Profundo
tr_tr: Derin bağlantı ile

source: Go to GLPI with your device web browser
es_ar: Vaya a GLPI con el navegador web de su dispositivo
tr_tr: Aygıtınızın tarayıcısı ile GLPI kopyanıza gidin

source: Click on the DeepLink
es_ar: Clic en el Enlace Profundo
tr_tr: Derin bağlantıya tıklayın

source: Click on Deeplink
es_ar: Clic en Enlace Profundo
tr_tr: Derin bağlantıya tıklayın

source: App will open and pre-fill the fields for adding a server
es_ar: La aplicación se abrirá y completará previamente los campos para agregar un servidor.
tr_tr: Uygulama bir sunucu eklemek için gerekli alanlar önceden doldurulmuş olarak açılır

source: Then click on **Add server**
es_ar: Luego haga clic en **Agregar servidor**
tr_tr: Ardından **Sunucu ekle** üzerine tıklayın

source: Add server
es_ar: Agregar servidor
tr_tr: Sunucu ekle

source: With QR Code
es_ar: Con código QR
tr_tr: Kare kod ile

source: Open **GLPI Agent** on your device
es_ar: Abra **GLPI Agent** en su dispositivo
tr_tr: Aygıtınız üzerinde **GLPI aracısı** uygulamasını açın

source: Go to **Advanced Settings** > **Open List Server** > **Add servers**
es_ar: Vaya a **Configuración avanzada** > **Abrir servidor de lista** > **Agregar servidores**
tr_tr: **Gelişmiş ayarlar** > **Açık liste sunucusu** > **Sunucu ekle** üzerine dokunun

source: Click on **QR Code** button
es_ar: Haga clic en el botón **Código QR**
tr_tr: **Kare kod** üzerine dokunun

source: Flash QR Code
es_ar: Código QR Flash
tr_tr: Kare kodu okutun

source: Use QR Code
es_ar: Utilice el código QR
tr_tr: Kare kodu kullanın

source: App pre-fill the fields for adding a server
es_ar: La aplicación rellena previamente los campos para agregar un servidor
tr_tr: Uygulama bir sunucu eklemek için gerekli alanları doldurur

source: Then add server.
es_ar: Luego agrega el servidor.
tr_tr: Ardından sunucuyu ekleyin.

source: Category Global
es_ar: Categoría Global
tr_tr: Genel kategori

source: In mobile device, menu > advanced settings > Category global, select/unselect the informations you want to inventory
es_ar: En el dispositivo móvil, menú > configuración avanzada > Categoría global, seleccione/deseleccione la información que desea inventariar
tr_tr: Mobil aygıtta, Menü > Gelişmiş ayarlar > Genel kategori, varlık kaydını yapmak istediğiniz bilgileri seçin ya da seçimini kaldırın

source: Show catgory you want to inventory
es_ar: Muestra la categoría que deseas inventariar
tr_tr: Varlık kaydını yapmak istediğiniz kategoriyi görüntüleyin

source: Contributing
es_ar: Contribuyendo
tr_tr: Katkıda bulunun

source: Open a ticket for each bug/feature so it can be discussed
es_ar: Abra un ticket para cada error/característica para que pueda discutirse
tr_tr: Değerlendirilmesi için hatalar veya istediğiniz özellikler ile ilgili bir destek kaydı açın

source: Follow `development guidelines <http://glpi-developer-documentation.readthedocs.io/en/latest/plugins/index.html>`_
es_ar: Siga las `pautas de desarrollo <http://glpi-developer-documentation.readthedocs.io/es/latest/plugins/index.html>`_
tr_tr: `Geliştirme rehberi <http://glpi-developer-documentation.readthedocs.io/en/latest/plugins/index.html>`_ belgesindeki önerileri uygulayın

source: Refer to `GitFlow <http://git-flow.readthedocs.io/>`_ process for branching
es_ar: Consulte el proceso `GitFlow <http://git-flow.readthedocs.io/>`_ para la ramificación
tr_tr: Dallandırmak için `GitFlow <http://git-flow.readthedocs.io/>`_ işlemine bakın

source: Work on a new branch on your own fork
es_ar: Trabaja en una nueva rama en tu propia bifurcación
tr_tr: Kendi yeni dalınız üzerinde çalışın

source: Open a PR that will be reviewed by a developer
es_ar: Abrir un PR que será revisado por un desarrollador
tr_tr: Bir geliştirici tarafından değerlendirilmesi için bir çekme isteği (PR) oluşturun

source: Creative Commons License
es_ar: Licencia Creative Commons
tr_tr: Creative Commons Lisansı
