Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/genericobject/index.po
Languages: cs_cz, fr_fr, pt_pt, tr_tr

source: Generic Object
cs_cz: Obecný objekt
pt_pt: Objeto genérico
tr_tr: Genel nesne

source: Download
cs_cz: Stáhnout
fr_fr: Télécharger
tr_tr: İndir

source: Sources
cs_cz: Zdroje
tr_tr: Kaynaklar

source: Requirements (on-premise)
cs_cz: Požadavky (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
cs_cz: Verze GLPI
fr_fr: Version de GLPI
tr_tr: GLPI sürümü

source: Minimum PHP
fr_fr: PHP minimum
tr_tr: En düşük PHP sürümü

source: Recommended
cs_cz: Doporučeno
fr_fr: Recommandé
tr_tr: Önerilen

source: This plugin is available without a `GLPI Network <https://services.glpi-network.com/#offers>`_ subscription. It is also available on `GLPI Cloud <https://glpi-network.cloud>`_.
tr_tr: Bu eklenti bir `GLPI-Network <https://services.glpi-network.com/#offers>`_ aboneliği olmadan kullanılabilir. Ayrıca `GLPI Cloud <https://glpi-network.cloud/>`_ üzerinden de edinilebilir.

source: Features
cs_cz: Funkce
fr_fr: Fonctionnalités
pt_pt: Funcionalidades
tr_tr: Özellikler

source: This plugin allows you to add new inventory objects types, integrated into GLPI framework.
cs_cz: Tento zásuvný modul umožňuje přidávat nové typy objektů, integrované do GLPI.
fr_fr: Ce plugin vous permet d'ajouter de nouveaux type d'objets qui seront intégrés dans GLPi
pt_pt: Este plugin permite que adicione novos tipos de objetos de inventário, integrados à estrutura GLPI.
tr_tr: Bu eklenti GLPI yapısına bütünleşik yeni envanter nesneleri eklenebilmesini sağlar.

source: It supports following GLPI features:
cs_cz: Podporuje následující funkce GLPI:
fr_fr: Il supporte les fonctionnalités suivantes de GLPi :
pt_pt: Suporta as seguintes características GLPI:
tr_tr: Şu GLPI özelliklerini destekler:

source: entity and sub-entities management;
cs_cz: správa entit a podřízených entit;
fr_fr: gestion des Entités et sous-Entités ;
pt_pt: gestão de entidades e subentidades;
tr_tr: Varlık ve alt varlık yönetimi,

source: search;
cs_cz: vyhledávání;
fr_fr: recherche ;
pt_pt: pesquisar;
tr_tr: Arama,

source: templates;
cs_cz: šablony;
fr_fr: modèles ;
pt_pt: modelos;
tr_tr: Kalıplar,

source: history;
cs_cz: historie;
fr_fr: historique ;
pt_pt: história;
tr_tr: Geçmiş,

source: helpdesk integration;
cs_cz: Začlenění služby podpory;
fr_fr: intégration dans l'assistance ;
pt_pt: helpdesk;
tr_tr: Destek merkezi bütünleştirmesi,

source: CSV file injection plugin integration;
cs_cz: začlenění zásuvného modulu pro vložení CSV souboru;
fr_fr: intégration dans le plugin d'injection de fichiers CSV :
pt_pt: Integração de plugin de injeção de arquivo CSV;
tr_tr: CSV dosya ekleme eklentisi bütünleştirmesi,

source: Item uninstallation plugin integration;
cs_cz: Začlenění zásuvného modulu odinstalace položky;
fr_fr: intégration dans le plugin de désinstallation d'objets ;
pt_pt: Integração de plugins de desinstalação de itens;
tr_tr: Öge kaldırma eklentisi bütünleştirmesi,

source: order management plugin integration.
cs_cz: začlenění zásuvného modulu Správa objednávek.
fr_fr: intégration dans le plugin de gestion des commandes.
pt_pt: integração de plugins de gestão de pedidos.
tr_tr: Sipariş yönetimi eklentisi bütünleştirmesi.

source: Example of usage
cs_cz: Příklad použití
fr_fr: Exemple d'utilisation
pt_pt: Exemplo de uso
tr_tr: Kullanım örneği

source: **Objective:** Manage your car fleet like the rest of your IT Assets.
cs_cz: **Cíl:** Spravovat vozový park podobně jako vaše počítačové vybavení.
fr_fr: **Objectif :** gérer votre flotte de véhicules de la même manière que le reste de votre parc.
pt_pt: **Objectivo:** Gerir a sua frota automóvel como o resto dos seus Activos de TI.
tr_tr: **Amaç:** Araç filonuzu BT varlıklarınız gibi yönetmek.

source: Create a new type of inventory object *car*.
cs_cz: Vytvořte nový typ objektu inventáře *auto*.
fr_fr: Créer un nouvel objet d'inventaire de type *véhicule*.
pt_pt: Crie um novo tipo de objeto de inventário *car*.
tr_tr: *Araçlar* adında yeni bir envanter nesnesi ekleyin.

source: Add the accurate fields for a *car*, like: *name*, *serial number*, *inventory number*, *type*, *model*, *color*, *state*, etc.
cs_cz: Přidejte přesné kolonky pro *automobil* jako: *název*, *WIN kód*, *inventární číslo*, *typ*, *model*, *barva*, *stav*, atp.
fr_fr: Ajouter les champs adéquats pour un *véhicule*, comme : *nom*, *numéro de série*, *numéro d'inventaire*, *type*, *modèle*, *couleur*, *état*, etc.
pt_pt: Adicione os campos precisos para um *carro*, como: *nome*, *número de série*, *número de inventário*, *tipo*, *modelo*, *cor*, *estado*, etc.
tr_tr: *Araçlar* için kullanılacak alanları ekleyin: *ad*, *seri numarası*, *stok kodu*, *tür*, *model*, *renk*, *durum*, gibi.

source: Describe the behaviour of a *car*: visible in subentity, retain history, etc.
cs_cz: Popište chování *automobilu*: viditelnost v dílčí položce, uchovávání historie, atp.
fr_fr: Décrire le comportement d'un *véhicule* : visible dans les sous entités, conserver l'historique, etc.
pt_pt: Descrever o comportamento de um *carro*: visível na subentidade, manter a história, etc.
tr_tr: Bir *aracın* davranışını belirtin: Alt birimde görüntülensin, geçmişi kaydedilsin gibi.

source: Adjust the rights on *cars*.
cs_cz: Upravte oprávnění na *automobily*.
fr_fr: Ajuster les droits sur *véhicules*.
pt_pt: Ajuste os direitos nos *carros*.
tr_tr: *Araçlar* üzerindeki izinleri ayarlayın.

source: Activate the *cars* object.
cs_cz: Aktivujte objekt *automobily*.
fr_fr: Activer l'objet *véhicules*.
pt_pt: Ative o objeto *carros*.
tr_tr: *Araçlar* nesnesini etkinleştirin.

source: Manage your collection of *cars* in GLPI.
cs_cz: Spravujte svůj vozový park v GLPI.
fr_fr: Gérer votre collection de *véhicules* dans GLPI.
pt_pt: Organize a sua coleção de *carros* em GLPI.
tr_tr: *Araç* filonuzu GLPI üzerinden yönetin.

source: Install the Plugin
cs_cz: Nainstalovat zásuvný modul
fr_fr: Installer le plugin
pt_pt: Instalar este Plugin
tr_tr: Eklentiyi kurmak

source: Uncompress the archive.
cs_cz: Rozbalit archiv
fr_fr: Décompresser l'archive.
pt_pt: Descompactar o arquivo.
tr_tr: Arşivi ayıklayın.

source: Move the ``genericobject`` directory to the ``<GLPI_ROOT>/plugins`` directory
cs_cz: Přesuňte složku ``genericobject`` do složky ``<GLPI_ROOT>/plugins``
fr_fr: Déplacer le répertoire ``genericobject`` dans le répertoire `<GLPI_ROOT>/plugins``.
pt_pt: Mova o diretório ``genericobjeto`` para o diretório ``<GLPI_ROOT>/plugins``
tr_tr: ``genericobject`` klasörünü ``<GLPI_ROOT>/plugins`` klasörüne taşıyın

source: Navigate to the *Configuration > Plugins* page
cs_cz: Přejděte do *Nastavení > Zásuvné moduly*
fr_fr: Se rendre sur la page *Configuration > Plugins*
pt_pt: Navegue até a página *Configuração > Plugins
tr_tr: *Yapılandırma > Eklentiler* bölümüne gidin

source: Install and activate the plugin
cs_cz: Nainstalovat a aktivovat zásuvný modul
fr_fr: Installer et activer le plugin
pt_pt: Instale e ative o plugin
tr_tr: Eklentiyi kurup etkinleştirin.

source: Usage
cs_cz: Využití
fr_fr: Utilisation
pt_pt: Utilização
tr_tr: Kullanım

source: Create a new object type
cs_cz: Vytvořit nový typ objektu
fr_fr: Créer un nouveau type d'objet
pt_pt: Criar um novo tipo de objeto
tr_tr: Yeni bir nesne türü ekleyin

source: This is the first step.
cs_cz: Toto je první krok.
fr_fr: Ceci constitue la première étape.
pt_pt: Este é o primeiro passo.
tr_tr: Bu ilk adımdır.

source: Click on the *+* button in the plugin configuration form.
cs_cz: Klikněte na tlačítko *+* ve formuláři nastavení zásuvného modulu.
fr_fr: Cliquer sur le bouton *+* dans le formulaire de configuration du plugin.
pt_pt: Clique no botão * + * no formulário de configuração do plugin.
tr_tr: Eklenti yapılandırması formunda *+* düğmesine tıklayın.

source: Create the new type of inventory object:
cs_cz: Vytvořte nový typ objektu inventáře:
fr_fr: Créer un nouvel objet de type inventaire :
pt_pt: Crie um novo tipo de objeto de inventário *car*:
tr_tr: Yeni envanter nesnesi türü oluşturun:

source: *name*: mandatory, lowercase, and must be composed of letters only;
cs_cz: *název*: povinný, malými písmeny – může obsahovat pouze písmena;
fr_fr: nom* : requis, en minuscules, et doit être composé de lettres uniquement ;
pt_pt: *Nome:* obrigatório, minúsculo, e deve ser composto de letras apenas;
tr_tr: *Ad*: Zorunludur, küçük harflerle ve yalnızca şu karakterler kullanılarak yazılmalıdır:

source: *label*: by default, the same as the name.
cs_cz: *štítek*: ve výchozím stavu je stejné jako název.
fr_fr: *libellé* : par défaut, identique au nom.
pt_pt: *Label:* por padrão, o mesmo que o nome.
tr_tr: *Etiket*: Varsayılan olarak ad ile aynıdır.

source: Validate.
cs_cz: Ověřit
fr_fr: Valider.
pt_pt: Validar.
tr_tr: Doğrulayın.

source: Activate the new item type to use it.
cs_cz: Aby ji bylo možné použít, novou položku aktivujte.
fr_fr: Activer le nouveau type d'objet pour l'utiliser.
pt_pt: Ative o novo tipo de item para usá-lo.
tr_tr: Kullanabilmek için yeni öge türünü etkinleştirin.

source: **Example:** Create a new type of inventory object *car*.
cs_cz: **Příklad:** Vytvořte nový typ objektu *auto*.
fr_fr: **Exemple :** créer un nouveau type d'objet d'inventaire *véhicule*.
pt_pt: **Exemplo:** Crie um novo tipo de objeto de inventário *car*.
tr_tr: **Örnek:** Yeni *Araç* envanter nesnesini oluşturun.

source: Edit labels
cs_cz: Upravit označení
fr_fr: Modifier les libellés
pt_pt: Editar rótulos
tr_tr: Etiketleri düzenleyin

source: For each type, a language file is available in ``<GLPI_ROOT>/files/_plugins/genericobject/locales/itemtype/``
cs_cz: Pro každý typ je k dispozici jazykový soubor v ``<GLPI_ROOT>/files/_plugins/genericobject/locales/itemtype/``
fr_fr: Pour chaque type, un fichier de langue est disponible dans ``<GLPI_ROOT>/files/_plugins/genericobject/locales/itemtype/``
pt_pt: Para cada tipo, um arquivo de idioma está disponível em ``<GLPI_ROOT>/files/_plugins/genericobject/locales/itemtype/``
tr_tr: Her tür için ``<GLPI_ROOT>/files/_plugins/genericobject/locales/itemtype/`` altında bir dil dosyası bulunur

source: The plugin creates :
cs_cz: Zásuvný modul vytváří:
fr_fr: Le plugin créé :
pt_pt: O plugin cria :
tr_tr: Bu eklenti şunları oluşturur:

source: a language file for the current language
cs_cz: jazykový soubor pro stávající jazyk
fr_fr: un fichier de langue pour la langue courante
pt_pt: um arquivo de idioma para o idioma atual
tr_tr: Geçerli dil için bir dil dosyası

source: a language file for the default GLPI language
cs_cz: jazykový soubor pro výchozí jazyk GLPI
fr_fr: un fichier de langue pour la langue par défaut de GLPI
pt_pt: um arquivo de idioma para o idioma padrão GLPI
tr_tr: Varsayılan GLPI dili için bir dil dosyası

source: If the current and default languages are the same, only one file is created.
cs_cz: Pokud stávající a výchozí jazyk jsou stejné, je vytvořen pouze jeden soubor.
fr_fr: Si la langue courante et la langue par défaut sont identiques, un seul fichier sera créé.
pt_pt: Se os idiomas atuais e padrão forem os mesmos, apenas um arquivo é criado.
tr_tr: Geçerli ve varsayılan dil aynı ise yalnızca bir dosya oluşturulur.

source: To change the label of the itemtype, for the english language, edit the file:
cs_cz: Pro změnu označení typu položky, pro český jazyk, upravte soubor:
fr_fr: Pour modifier le libellé du type d'objet, pour la langue anglaise, éditer le fichier :
pt_pt: Para alterar a etiqueta do itemtype, para o idioma inglês, edite o arquivo:
tr_tr: İngilizce dilinde öge türünün etiketini değiştirmek için şu dosyayı düzenleyin:

source: You can also define labels globally in ``<GLPI_ROOT>/files/_plugins/genericobject/locales/fields.<lang>.php`` files:
cs_cz: Můžete také definovat štítky globálně v souborech ``<GLPI_ROOT>/files/_plugins/genericobject/locales/fields.<lang>.php``:
fr_fr: Vous pouvez également définir des libellés globalement dans les fichiers ``<GLPI_ROOT>/files/_plugins/genericobject/locales/fields.<lang>.php`` :
tr_tr: Etiketleri ayrıca ``<GLPI_ROOT>/files/_plugins/genericobject/locales/fields.<lang>.php`` dosyalarında genel olarak da tanımlayabilirsiniz:

source: Setup behaviour
cs_cz: Nastavení chování
fr_fr: Configuration du comportement
pt_pt: Comportamento padrão
tr_tr: Kurulum davranışı

source: **Example:** Describe the behaviour of a *car*: visible in subentity, retain history, etc.
cs_cz: **Příklad:** Popište chování *automobilu*: viditelné v dílčí položce, uchovávat historii, etc.
fr_fr: **Exemple :** décrire le comportement d'un *véhicule* : visible dans les sous entités, conserver l'historique, etc.
pt_pt: **Exemplo:** Descrever o comportamento de um *carro*: visível na subentidade, manter a história, etc.
tr_tr: **Örnek:** Bir *aracın* davranışını belirtin: Alt varlıkta görüntülensin, geçmişi kaydedilsin gibi.

source: The new type will be managed the same way as the usual GLPI types (computer, monitor, network device, etc.)
cs_cz: Nový typ bude spravován stejným způsobem jako obvyklé GLPI typy (počítač, monitor, síťové zařízení, atd.)
fr_fr: Le nouveau type sera géré de la même manière que les types usuels de GLPI (ordinateurs, moniteurs, matériels réseau, etc.)
pt_pt: O novo tipo será gerido da mesma forma que os tipos GLPI habituais (computador, monitor, dispositivo de rede, etc.)
tr_tr: Yeni tür normal GLPI türleri (bilgisayar, ekran, ağ aygıtı vb) ile aynı şekilde yönetilir

source: All objects are at least assigned to an *entity*
cs_cz: Všechny objekty jsou přinejmenším přiřazeny k *entitě*
fr_fr: Tous les objets sont au moins assignés à une *entité*
pt_pt: Todos os objetos são pelo menos atribuídos a uma *entidade*
tr_tr: Tüm nesneler için atanmış en az bir *birim* olmalıdır

source: The Behaviour tab allows you to define:
cs_cz: Karta Chování umožňuje určit:
fr_fr: L'onglet comportement vous permet de définir :
pt_pt: O separador Comportamento permite-lhe definir:
tr_tr: Davranış sekmesinde şunlar tanımlanabilir:

source: *child-entities:* allows the type to be recursive;
cs_cz: *child-entities:* umožní typu aby byl rekurzivní;
fr_fr: *sous-entités :* autorise le type à être récursif ;
pt_pt: *child-entities:* permite que o tipo seja repetitivo;
tr_tr: *Alt kayıtlar:* Türün alta doğru genişletilmesini sağlar;

source: *Helpdesk:* allows an object to be associated to a ticket;
cs_cz: *Služba podpory:* umožňuje aby objekt byl přiřazen k požadavku;
fr_fr: *Assistance :* autorise l'objet à être associé à un ticket ;
pt_pt: *Helpdesk:* permite que um objeto seja associado a um bilhete;
tr_tr: *Destek masası:* Bir nesnenin bir çağrı kaydı ile ilişkilendirilmesini sağlar:

source: *Trash:* use GLPI's trash functionnality;
cs_cz: *Koš:* použít funkci GLPI koš;
fr_fr: *Corbeille :* utiliser la fonctionnalité corbeille de GLPI ;
pt_pt: *Trash:* usa a funcionalidade do lixo do GLPI;
tr_tr: *Çöp:* GLPI çöp kutusu özelliğini kullanır;

source: *Notes:* use GLPI's note functionnality;
cs_cz: *Poznámky:* použít funkci GLPI poznámky;
fr_fr: *Notes :* utiliser la fonctionnalité notes de GLPI ;
pt_pt: *Notes:* use a funcionalidade das notas do GLPI;
tr_tr: *Notlar:* GLPI not özelliğini kullanır;

source: *History:* allow history for this type;
cs_cz: *Historie:* umožnit historii pro tento typ;
fr_fr: *Historique :* autorise l'historique pour ce type ;
pt_pt: *History:* Permitir a história para este tipo;
tr_tr: *Geçmiş:* Bu türün geçmişini kaydeder;

source: *Templates:* allows template management;
cs_cz: *Šablony:* umožňuje správu šablon;
fr_fr: *Modèles :* autorise la gestion de modèles ;
pt_pt: *Modelos:* permite a gestão de modelos;
tr_tr: *Kalıplar:* Kalıpların yönetimini sağlar;

source: *Documents:* allows documents to be attached to an object of this type;
cs_cz: *Dokumenty:* umožňuje připojovat dokumenty k objektu tohoto typu;
fr_fr: *Documents :* permet à des documents d'être attachés à ce type ;
pt_pt: *Documentos:* permite que documentos sejam anexados a um objeto deste tipo;
tr_tr: *Belgeler:* Bu türdeki nesnelere belge eklenebilmesini sağlar;

source: *Loans:* allows objects to be loaned;
cs_cz: *Zápůjčky:* umožňuje aby objekty byly zapůjčovány;
fr_fr: *Prêts :* autorise le prêt d'objet ;
pt_pt: *Empréstimos:* permite que objetos sejam emprestados;
tr_tr: *Ödünç verme:* Nesnelerin ödünç verilebilmesini sağlar;

source: *Contracts:* link an object to one or more contracts;
cs_cz: *Smlouvy:* odkaz na objekt jednoho a více smluv;
fr_fr: *Contrats :* lie un objet à un ou plusieurs contrats ;
pt_pt: *Contratos:* ligar um objeto a um ou mais contratos;
tr_tr: *Sözleşmeler:* Bir nesneyi bir ya da bir kaç kişi ile ilişkilendirir;

source: *Network connections:* allow ports to be used and management for this type;
cs_cz: *Síťová připojení:* umožní aby pro tento typ byly používány a spravovány porty;
fr_fr: *Connexions réseau :* permet l'utilisation et la gestion de ports réseau pour ce type ;
pt_pt: *Ligações de rede:* permitem que as portas sejam usadas e o gerenciamento deste tipo;
tr_tr: *Ağ bağlantıları:* Bu tür için yönetim ve bağlantı noktalarının kullanılabilmesini sağlar;

source: *CSV file injection plugin:* allows this type to be available for use in the plugin;
cs_cz: *Zásuvný modul vložení CSV souboru:* umožní aby tento typ byl k dispozici pro použití v zásuvném modulu;
fr_fr: *Plugin d'injection de fichiers CSV :* permet à ce type d'être disponible pour utilisation dans le plugin ;
pt_pt: *plugin de injecção de ficheiro CSV:* permite que este tipo esteja disponível para uso no plugin;
tr_tr: *CSV file injection eklentisi:* Bu türün şu eklentiyle kullanılabilmesini sağlar;

source: *Item uninstallation plugin:* allows this type to be uninstalled;
cs_cz: *Zásuvný modul odebrání položky:* umožní odinstalaci tohoto typu;
fr_fr: *Plugin de désinstallation d'objets :* autorise la désinstallation de ce type ;
pt_pt: *O plugin de desinstalação do item:* permite que este tipo seja desinstalado;
tr_tr: *Item uninstallation eklentisi:* Bu türün kaldırılmasını sağlar;

source: *Order management plugin:* allows this type to be linked to an order;
cs_cz: *Zásuvný modul pro správu objednávek:* umožní tomuto typu aby byl propojený s objednávkou;
fr_fr: *Plugin de gestion des commandes :* autorise le lien de ce type à une commande ;
pt_pt: *Plugin de gestão de pedidos:* permite que este tipo seja ligado a uma ordem;
tr_tr: *Sipariş yönetimi eklentisi:* Bu türün bir sipariş ile ilişkilendirilmesini sağlar;

source: Add Fields
cs_cz: Přidat kolonky
fr_fr: Ajouter des champs
pt_pt: Adicionar campos
tr_tr: Alanlar ekleyin

source: **Example:** Add the accurate fields for a *car*, like: *name*, *serial number*, *inventory number*, *type*, *model*, *color*, *state*, etc.
cs_cz: **Příklad:** Přidejte přesné kolonky pro *automobil* jako: *název*, *WIN kód*, *inventární číslo*, *typ*, *model*, *barva*, *stav*, atd.
fr_fr: **Exemple :** ajouter les champs adéquats pour un *véhicule*, comme : *nom*, *numéro de série*, *numéro d'inventaire*, *type*, *modèle*, *couleur*, *état*, etc.
pt_pt: **Exemplo:** Adicione os campos precisos para um *carro*, como: *nome*, *número de série*, *número de inventário*, *tipo*, *modelo*, *cor*, *estado*, etc.
tr_tr: **Örnek:** *Araçlar* için kullanılacak alanları ekleyin: *ad*, *seri numarası*, *stok kodu*, *tür*, *model*, *renk*, *durum*, gibi.

source: Navigate to the *Fields* tab.
cs_cz: Přejděte na kartu *Kolonky*.
fr_fr: Aller à l'onglet *Champs*.
pt_pt: Navegue até a guia *Campos*.
tr_tr: *Alanlar* sekmesine gidin.

source: The plugin comes with several ready to use fields:
cs_cz: Zásuvný modul přichází s několika předpřipravenými kolonkami:
fr_fr: Le plugin est fourni avec plusieurs champs prêts à l'utilisation :
pt_pt: O plugin vem com vários campos prontos para uso:
tr_tr: Bu eklentisi ile kullanılmaya hazır bazı alanlar gelir:

source: Name
cs_cz: Název
fr_fr: Nom
pt_pt: Nome
tr_tr: Ad

source: Type
cs_cz: Typ
pt_pt: Tipo
tr_tr: Tür

source: Serial number
cs_cz: Sériové číslo
fr_fr: Numéro de série
pt_pt: Número de série
tr_tr: Seri numarası

source: Inventory number
cs_cz: Inventární číslo
fr_fr: Numéro d'inventaire
pt_pt: Número de inventário
tr_tr: Stok numarası

source: Item's user
cs_cz: Uživatel položky
fr_fr: Utilisateur
pt_pt: Item do utilizador
tr_tr: Ögenin kullanıcısı

source: Group
cs_cz: Skupina
fr_fr: Groupe
tr_tr: Grup

source: Status
cs_cz: Stav
fr_fr: Statut
pt_pt: Estado
tr_tr: Durum

source: Comments
cs_cz: Komentáře
fr_fr: Commentaires
pt_pt: Comentários
tr_tr: Yorumlar

source: Notes
cs_cz: Poznámky
pt_pt: Notas
tr_tr: Notlar

source: Location
cs_cz: Umístění
fr_fr: Emplacement
tr_tr: Konum

source: Other
cs_cz: Ostatní
fr_fr: Autre
pt_pt: Outro
tr_tr: Diğer

source: Manufacturer
cs_cz: Výrobce
fr_fr: Constructeur
pt_pt: Fabricante
tr_tr: Üretici

source: URL
cs_cz: URL adresa
tr_tr: İnternet adresi

source: Creation date
cs_cz: Datum vytvoření
fr_fr: Date de création
pt_pt: Data criação
tr_tr: Eklenme tarihi

source: Expiration date
cs_cz: Datum skončení platnosti
fr_fr: Date d'expiration
pt_pt: Data final
tr_tr: Son kullanma tarihi

source: Category
cs_cz: Kategorie
fr_fr: Catégorie
pt_pt: Categoria
tr_tr: Kategori

source: Visible in Helpdesk
cs_cz: Viditelné ve službě podpory
fr_fr: Visible dans l'assistance
pt_pt: Visível em Helpdesk
tr_tr: Destek merkezinde görüntülensin

source: Technician in charge of the hardware
cs_cz: Technik odpovědný za hardware
fr_fr: Technicien en charge du matériel
pt_pt: Técnico responsável pelo hardware
tr_tr: Donanımdan sorumlu kişi

source: Domain
cs_cz: Doména
fr_fr: Domaine
pt_pt: Dominio
tr_tr: Etki alanı

source: Contact
cs_cz: Kontakt
pt_pt: Contacto
tr_tr: İlgili

source: Contact number
cs_cz: Kontaktní číslo
fr_fr: Numéro de contact
pt_pt: Número de contato
tr_tr: İlgilinin telefonu

source: Using some behaviour will automatically add some fields to the object:
cs_cz: Použití nějakého chování automaticky přidá objektu některé kolonky:
fr_fr: L'utilisation de certains comportement entraînera l'ajout automatique de champs dans l'objet :
pt_pt: Usar algum comportamento adicionará automaticamente alguns campos ao objeto:
tr_tr: Bazı davranışlar kullanıldığında nesneye bazı alanlar otomatik olarak eklenir:

source: network connection => location
cs_cz: síťové připojení => umístění
fr_fr: connexion réseau => emplacement
pt_pt: ligação à rede => localização
tr_tr: Ağ bağlantısı => konum

source: loans => location
cs_cz: zápůjčky => umístění
fr_fr: prêts => emplacement
pt_pt: empréstimos => localização
tr_tr: Ödünç verme => konum

source: helpdesk => is visible in Helpdesk
cs_cz: služba podpory => je viditelné ve službě podpory
fr_fr: assistance => visible dans l'assistance
pt_pt: helpdesk => é visível em Helpdesk
tr_tr: Destek merkezi => destek merkezinde görüntülensin

source: notes => notepad
cs_cz: poznámky => poznámkový blok
pt_pt: notas => notepad
tr_tr: Notlar => notepad

source: Helpdesk integration
cs_cz: Začlenění služby podpory
fr_fr: Intégration assistance
pt_pt: Integração com Helpdesk
tr_tr: Destek merkezi bütünleştirmesi

source: To use an object in the helpdesk, use following setup:
cs_cz: Pro použití objektu ve službě podpory, použijte následující uspořádání:
fr_fr: Pour utiliser un objet dans l'assistance, utiliser la configuration suivante :
pt_pt: Para usar um objeto no helpdesk, use a seguinte configuração:
tr_tr: Bir nesneyi destek merkezinde kullanmak için şu ayarları kullanın:

source: In *Behaviour* tab : *use helpdesk* must be set to **Yes**.
cs_cz: V panelu *Chování*: je třeba, aby *použít službu podpory* bylo nastaveno na **Ano**.
fr_fr: Dans l'onglet *Comportement* : *utiliser l'assistance* doit être défini à **Oui**.
pt_pt: No separador *Comportamento* : *use helpdesk* deve ser configurado para **Sim**.
tr_tr: *Davranış* sekmesinde: *Destek merkezi kullanılsın* seçeneği **Evet** olarak ayarlanmalıdır.
