Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/genericobject/index.po
Languages: cs_cz, fr_fr, pt_pt, tr_tr

source: Create a new file named : ``<GLPI_ROOT>/files/_plugins/genericobject/fields/biomedical.constant.php``
cs_cz: Vytvořte nový soubor nazvaný: ``<GLPI_ROOT>/files/_plugins/genericobject/fields/biomedical.constant.php``
fr_fr: Créer un nouveau fichier appelé : ``<GLPI_ROOT>/files/_plugins/genericobject/fields/biomedical.constant.php``
pt_pt: Criar um novo ficheiro com o nome``<GLPI_ROOT>/files/_plugins/genericobject/fields/biomedical.constant.php``
tr_tr: Şu adla yeni bir dosya oluşturun : ``<GLPI_ROOT>/files/_plugins/genericobject/fields/biomedical.constant.php``

source: Add following content :
cs_cz: Přidejte následující obsah:
fr_fr: Ajouter le contenu suivant :
pt_pt: Adicione o seguinte conteúdo:
tr_tr: Şu içeriği ekleyin :

source: Trailing ``s_id`` is mandatory in ``[plugin_genericobject_field*s_id*]`` because the GLPI framework requires foreign key fields to end with ``s_id``. In database, ``glpi_plugin_genericobject_fields`` is table name and ``id``, its foreign key. See `GLPI developer documentation <http://glpi-developer-documentation.readthedocs.io/en/master/devapi/database/dbmodel.html#fields>`_.
cs_cz: Uzavírající ``s_id`` je v ``[plugin_genericobject_field*s_id*]`` povinné protože GLPI framework vyžaduje, aby kolonky cizích klíčů končily na ``s_id``. V databázi, ``glpi_plugin_genericobject_fields`` je název tabulky a ``id``, jeho cizí klíč. Viz `Vývojářská dokumentace ke GLPI <http://glpi-developer-documentation.readthedocs.io/en/master/devapi/database/dbmodel.html#fields>`_.
fr_fr: Le ``s_id`` de fin est obligatoire dans ``[plugin_genericobject_field*s_id*]``. Le framework GLPI impose que les champs de clés étrangères se terminent par ``s_id``. En base de données, ``glpi_plugin_genericobject_fields`` est le nom de la table et ``id``, sa clé étrangère. Voir `la documentation développeur de GLPI <http://glpi-developer-documentation.readthedocs.io/en/master/devapi/database/dbmodel.html#fields>`_.
pt_pt: Trailing ``s_id``` é obrigatório em ``[plugin_genericobject_field*s_id*]`` porque o framework GLPI requer campos chave estrangeiros para terminar com ``s_id``. Na base de dados, ``glpi_plugin_genericobject_fields``` é o nome da tabela e ``id```, sua chave externa. Veja `a documentação do desenvolvedor GLPI <http://glpi-developer-documentation.readthedocs.io/en/master/devapi/database/dbmodel.html#fields>`_.
tr_tr: Başlangıçtaki ``s_id`` zorunludur ``[plugin_genericobject_field*s_id*]`` çünkü GLPI çatısı için dış anahtar alanlarının ``s_id`` ile bitmesi gereklidir. Veri tabanında, ``glpi_plugin_genericobject_fields`` tablo adıdır ve ``id``, dış anahtardır. Ayrıntılı bilgi almak için `GLPI geliştirici belgeleri <http://glpi-developer-documentation.readthedocs.io/en/master/devapi/database/dbmodel.html#fields>`_ bölümüne bakın.

source: Define fields labels
cs_cz: Definovat štítky kolonek
fr_fr: Définir les libellés des champs
pt_pt: Definir rótulos de campos
tr_tr: Alan etiketlerini yazın

source: See :ref:`edit_labels` section.
cs_cz: Viz sekce :ref:`edit_labels`.
fr_fr: Voir la section :ref:`edit_labels`.
pt_pt: Veja a seção :ref:`edit_labels`.
tr_tr: ref:`edit_labels` bölümüne bakın.

source: Edit your locales file, for example : ``<GLPI_ROOT>/files/_plugins/genericobject/locales/biomedical/biomedical.fr_FR.php``
cs_cz: Upravte svůj soubor s místními a jazykovými nastaveními, například: ``<GLPI_ROOT>/files/_plugins/genericobject/locales/biomedical/biomedical.cs_CZ.php``
fr_fr: Éditer vos fichiers de locales, par exemple : ``<GLPI_ROOT>/files/_plugins/genericobject/locales/biomedical/biomedical.fr_FR.php``
pt_pt: Edite seus arquivos locais, por exemplo : ``<GLPI_ROOT>/ficheiros/_plugins/genericobject/locais/biomédica/biomédica.fr_FR.php``
tr_tr: Dil dosyalarınızı düzenleyin, örnek : ``<GLPI_ROOT>/files/_plugins/genericobject/locales/biyotip/biyotip.tr_TR.php``

source: Add following content at the end of file :
cs_cz: Na konec souboru přidejte následující obsah:
fr_fr: Ajouter le contenu suivant à la fin du fichier :
pt_pt: Adicione o seguinte conteúdo no final do arquivo :
tr_tr: Dosyanın sonuna şu içeriği ekleyin :

source: Define behaviours
cs_cz: Určit chování
fr_fr: Définir les comportements
pt_pt: Definir comportamentos
tr_tr: Davranışları tanımlayın

source: In *Plugins > Objects management* menu, on *Main* tab, select :
cs_cz: V nabídce *Zásuvné moduly > Správa objektů*, na panelu *Hlavní*, vyberte:
fr_fr: Dans le menu *Plugins > Gestion d'objets*, sur l'onglet *Principal*, sélectionner :
pt_pt: No menu *Plugins > Gerenciamento de objetos*, na aba *Main*, selecione :
tr_tr: *Eklentiler > Nesne yönetimi* menüsündeki *Temel* sekmesinden şunu seçin :

source: *Item in the dustbin*
cs_cz: *Položky v koši*
fr_fr: *Élément à la corbeille*
pt_pt: *Item no lixo*
tr_tr: *Öge çöp kutusunda*

source: *Historical*
cs_cz: *Historické*
fr_fr: *Historique*
pt_pt: *Histórico*
tr_tr: *Geçmiş*

source: *Financial and administratives information*
cs_cz: *Finanční a správní informace*
fr_fr: *Informations financières et administratives*
pt_pt: *Informações financeiras e administrativas*
tr_tr: *Mali ve idari bilgiler*

source: *Documents*
cs_cz: *Dokumenty*
pt_pt: *Documentos*
tr_tr: *Belgeler*

source: *Global search*
cs_cz: *Globální hledání*
fr_fr: *Recherche globable*
pt_pt: *Pesquisa global*
tr_tr: *Genel arama*

source: *Assistance*
cs_cz: *Asistence*
pt_pt: *Assistência*
tr_tr: *Destek*

source: *Templates*
cs_cz: *Šablony*
fr_fr: *Modèles*
pt_pt: *Modelos*
tr_tr: *Kalıplar*

source: *Contracts*
cs_cz: *Smlouvy*
fr_fr: *Contrats*
pt_pt: *Contratos*
tr_tr: *Sözleşmeler*

source: This will add ready to use fields to your type of object.
cs_cz: Toto přidá předpřipravené kolonky do vašeho typu objektu.
fr_fr: Cette action ajoutera des champs pré-définis à votre type d'objet
pt_pt: Isso adicionará campos prontos para uso ao seu tipo de objeto.
tr_tr: Bu işlem nesne türünüze kullanmaya hazır alanlar ekler.

source: Add fields to your type of object
cs_cz: Přidat kolonky do svého typu objektu
fr_fr: Ajouter des champs à votre type d'objet
pt_pt: Adicionar campos ao seu tipo de objeto
tr_tr: Nesne türünüze alanlar ekleyin

source: In *Plugins > Objects management* menu, on *Fields* tab, you can now add fields to Biomedical type of object :
cs_cz: V nabídce *Zásuvné moduly > Správa objektů*, na panelu *Kolonky*, je možné přidat kolonky k typu objektu Biomedicínské:
fr_fr: Dans le menu *Plugins > Gestion d'objets*, sur l'onglet *Champs*, vous pouvez maintenant ajouter des champs au type d'objet Biomedical :
pt_pt: No menu *Plugins > Gerência de objetos*, na aba *Campos*, agora pode adicionar campos ao tipo de objeto Biomédico:
tr_tr: *Eklentiler > Nesne yönetimi* menüsündeki *Alanlar* sekmesinden Biyotıp türündeki nesneye alanlar ekleyebilirsiniz :

source: ready to use fields (GLPI's built-in fields)
cs_cz: předpřipravené kolonky (kolonky vestavěné v GLPI)
fr_fr: champs pré-définis (champs natifs à GLPI)
pt_pt: o plugin vem com vários campos prontos para uso
tr_tr: Kullanıma hazır alanlar (GLPI iç alanları)

source: new fields (defined in :ref:`biomedical_new_fields` section)
cs_cz: nové kolonky (určené v sekci :ref:`biomedical_new_fields`;)
fr_fr: nouveaux champs (définis dans la section :ref:`biomedical_new_fields`)
pt_pt: novos campos (definidos na secção :ref:`biomedical_new_fields`)
tr_tr: Yeni alanlar (:ref:`biomedical_new_fields` bölümünde)

source: Define Admin_biomed profile
cs_cz: Určete profil Spravce_biomedicinskeho
fr_fr: Définir le profil Admin_biomed
pt_pt: Definir perfil Admin_biomed
tr_tr: Biyotıp_Yönetim profilini tanımlayın

source: Clone *Admin* profile
cs_cz: Klonovat profil *Správce*
fr_fr: Cloner le profil *Admin*
pt_pt: Clonar perfil Administrador
tr_tr: *Yönetim* profilini kopyalayın

source: Set following rights in *Admin_biomed* profile :
cs_cz: V profilu *Spravce_biomedicinskeho* nastavte následující práva:
fr_fr: Définissez les droits suivants dans le profil *Admin_biomed* :
pt_pt: Defina os seguintes direitos no perfil *Admin_biomed*:
tr_tr: *Biyotıp-Yönetim* profili için şu izinleri ayarlayın :

source: *Administration > Profiles > Admin_biomed > Assets tab > Unselect all*
cs_cz: *Správa > Profilů > Spravce_biomedicínského > panel Majetky > Odznačit vše*
fr_fr: *Administration > Profils > Admin_biomed > Onglet Parc > Désélectionner tout*
pt_pt: *Administração > Perfil > Admin_biomed > Separador de assistência > Desmarcar tudo*
tr_tr: *Yönetim > Profiller > Yönetim_Biyotıp > Varlıklar sekmesi > Tümünü bırak*

source: *Administration > Profiles > Admin_biomed > Assistance tab > Association > Associable items to a ticket > Biomedical*
cs_cz: *Správa > Profilů > Spravce_biomedicínského > panel Asistence > Přiřazení > Položky přiřaditelné k požadavku > Biomedical*
fr_fr: *Administration > Profils > Admin_biomed > Onglet Assistance > Association > Matériels associables à un ticket > Biomedical*
pt_pt: *Administração > Perfis > Admin_biomed > Separador Assistência > Associação > Artigos associados a um bilhete > Biomédica*
tr_tr: *Yönetim > Profiller > Yönetim_Biyotıp > Varlıklar sekmesi > Atama > Destek kaydına atanabilecek ögeler > Biyotıp*

source: *Administration > Profiles > Admin_biomed > Management tab > Select all*
cs_cz: *Správa > Profilů > Spravce_biomedicínského > Panel správa > Vybrat vše*
fr_fr: *Administration > Profils > Admin_biomed > Onglet Gestion > Sélectionner tout*
pt_pt: *Administração > Perfil > Admin_biomed > Separador de gerência > Selecionar tudo*
tr_tr: *Yönetim > Profiller > Yönetim_Biyotıp > Yönetim sekmesi > Tümünü seç*

source: *Administration > Profiles > Admin_biomed > Objects management tab > Biomedical > Select all*
cs_cz: *Správa > Profily > Admin_biomed > Panel správa objektů > Biomedicínsko > Vybrat vše*
fr_fr: *Administration > Profils > Admin_biomed > Onglet Gestion d'objets > Biomedical > Sélectionner tout*
pt_pt: *Administração > Perfil > Admin_biomed > Separador de gerência de objetos > Biomédica > Selecionar tudo*
tr_tr: *Yönetim > Profiller > Yönetim_Biyotıp > Nesne yönetimi sekmesi > Biyotıp > Tümünü seç*

source: With these settings, *Admin_biomed* users only see *Biomedical* in Assets menu.
cs_cz: S těmito nastaveními, uživatelé z *Admin_biomed* vidí v nabídce Majetky pouze *Biomedicínské*.
fr_fr: Avec ces paramètres, les utilisateurs avec le profil *Admin_biomed* voient uniquement *Biomedical* dans le menu Parc
pt_pt: Com essas configurações, os utilizadores de *Admin_biomed* só verão *Biomédica* no menu de Assistência.
tr_tr: Bu ayarlar ile *Yönetim_Biyotıp* kullanıcıları Varlık menüsünde yalnızca *Biyotıp* seçeneğini görebilir.

source: Define Biomed entity and authorizations rules
cs_cz: Určit entitu Biomed a ověřovací pravidla
fr_fr: Définir l'entité Biomed et les règles d'habilitations
pt_pt: Definir regras de entidade Biomédica e autorizações
tr_tr: Biyotıp varlığını ve izinlerini tanımlayın

source: Create *Biomed* entity under *Root entity* in *Administration > Entities*
cs_cz: Vytvořte entitu *Biomedicínské* pod *Kořenová entita* v *Správa > Entity*
fr_fr: Créer l'entité *Biomed* sous l\'*Entité Racine* dans *Administration > Entités*
pt_pt: Criar entidade *Biomédica* em *Entidade raiz* em *Administração > Entidades*
tr_tr: "Yönetim > Valıklar* bölümünden *Kök varlık* altına *Biyotıp* varlığını ekleyin

source: Configure authorizations rules to assign *Admin_biomed* profile to *Biomed* entity users.
cs_cz: Nastavit pravidla ověřování pro přiřazení *Admin_biomed* profilu k entity *Biomedicínské* uživatelů.
fr_fr: Configurer les règles d'habilitations pour assigner le profil *Admin_biomed* aux utilisateurs de l'entité *Biomed*
pt_pt: Configure as regras de autorização para atribuir o perfil *Admin_biomed* a utilizadores de entidades *Biomédica*.
tr_tr: *Biyotıp* varlığı kullanıcıları için *Biyotıp_Yönetim* profili izin kurallarını yapılandırın.

source: As *Admin_biomed* user, you can create your first object in *Assets > Biomedical*.
cs_cz: Jako *Admin_biomed* uživatel, můžete vytvořit svůj první objekt v *Majetky > Biomedicínské*.
fr_fr: En tant qu'utilisateur *Admin_biomed*, vous pouvez créer votre premier objet dans *Parc > Biomedical*.
pt_pt: Como utilizador *Admin_biomed*, pode criar seu primeiro objeto em *Ativos > Biomédica*.
tr_tr: *Yönetim_Biyotıp* kullanıcısı olarak *Varlıklar > Biyotıp* içine ilk nesnenizi ekleyin.

source: In order to gain time, define values in *Setup > Dropdowns > Objects management* for new fields.
cs_cz: Pro získání času, zadejte hodnoty v *Nastavení > Rozbalovací nabídky > Správa objektů pro nové kolonky*
fr_fr: Pour gagner du temps, définissez les valeurs des nouveaux champs dans *Configuration > Intitulés > Gestion d'objets*.
pt_pt: Para ganhar tempo, defina valores em *Configuração > Dropdowns > Gerência de objetos* para novos campos.
tr_tr: Zaman kazanmak için *Kurulum > Açılan kutular > Nesne yönetimi* bölümünden yeni alan değerlerini tanımlayın.

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/Generic_objects/>`_
cs_cz: Máte-li jakékoli dotazy týkající se používání zásuvného modulu, přečtěte si prosím `naše časté dotazy <https://faq.teclib.com/04_Plugins/Generic_objects/>`_
fr_fr: Si vous avez des questions à propos de l'utilisation de ce plugin, veuillez consulter `notre FAQ <https://faq.teclib.com/04_Plugins/Generic_objects/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/Generic_objects/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
cs_cz: Licence Creative Commons
fr_fr: Licence Creative Commons
tr_tr: Creative Commons Lisansı

source: Model
fr_fr: Modèle
pt_pt: Modelo
