Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/genericobject/index.po
Languages: cs_cz, fr_fr, pt_pt, tr_tr

source: if the *User* field is defined, it allows item to be visible in the *My Items* list (as item whose owner is the user).
cs_cz: pokud je určena kolonka *Uživatel*, umožní to, aby položka byla viditelná v seznamu *Moje položky* (jako položka jejíž vlastník je uživatel).
fr_fr: Si le champ *Utilisateur* est défini, l'objet sera visible dans la liste *Mes objets* (comme un objet dont l'utilisateur est propriétaire).
pt_pt: se o campo *utilizador* estiver definido, ele permite que o item seja visível na lista *Meus itens* (como item cujo proprietário é o utilizador).
tr_tr: *Kullanıcı* alanı belirtilmiş ise öge *Ögelerim* listesinde görüntülenir (ögenin sahibi bu kullanıcı olarak).

source: if the *Group* field is defined, it allows item to be visible in the *My Items* list too (as item belonging to a group in which the user belongs to).
cs_cz: pokud je určená kolonka *Skupina*, umožní aby položky byly viditelné také v seznamu *Moje položky* (protože položka náležející do skupiny do které náleží uživatel).
fr_fr: Si le champ *Groupe* est défini, l'objet sera visible dans la liste *Mes objets* également (comme un objet dont le propriétaire est un groupe auquel l'utilisateur appartient).
pt_pt: se o campo *Grupo* estiver definido, ele permite que o item seja visível na lista *Meu itens* também (como item pertencente a um grupo ao qual o utilizador pertence).
tr_tr: *Grup* alanı belirtilmiş ise öge gene *Ögelerim* listesinde görüntülenir (öge kullanıcının bulunduğu gruba ait olduğundan).

source: if *Helpdesk visible* field is set and if the value is set to **No** in the object, then the object won't be visible at all in the helpdesk.
cs_cz: pokud je v objektu kolonka *Služba podpory viditelná* nastavená a pokud je její hodnota **Ne**, pak objekt nebude vůbec viditelný ve službě podpory.
fr_fr: Si le champ *Assistance visible* est défini et que sa valeur est à **Non** dans l'objet, ce objet ne sera pas visible du tout dans l'assistance.
pt_pt: se o campo *Helpdesk visível* estiver definido e se o valor estiver definido como **Não** no objeto, então o objeto não será visível no helpdesk.
tr_tr: *Destek merkezinde görüntülensin* alanı ayarlanmış ve değeri **Hayır** ise nesne destek merkezinde görüntülenmez.

source: Add new fields
cs_cz: Přidat nové kolonky
fr_fr: Ajouter de nouveaux champs
pt_pt: Adicionar novos ficheiros
tr_tr: Yeni alanlar eklemek

source: New fields will be available for all object's types.
cs_cz: Nové kolonky budou dostupné pro objekty všech typů.
fr_fr: Les nouveaux champs seront disponibles pour tous les types d'objets.
pt_pt: Novos campos estarão disponíveis para todos os tipos de objetos.
tr_tr: Bu seçenek etkinleştirildiğinde, yeni alanlar tüm nesne türleri için kullanılabilir.

source: Create a new file named ``<GLPI_ROOT>/files/_plugins/genericobject/fields/<type>.constant.php``
cs_cz: Vytvořte nový soubor nazvaný ``<GLPI_ROOT>/files/_plugins/genericobject/fields/<type>.constant.php``
fr_fr: Créer un nouveau fichier nommé ``<GLPI_ROOT>/files/_plugins/genericobject/fields/<type>.constant.php``
pt_pt: Criar um novo ficheiro com o nome``<GLPI_ROOT>/files/_plugins/genericobject/fields/<type>.constant.php``
tr_tr: ``<GLPI_ROOT>/files/_plugins/genericobject/fields/<type>.constant.php`` adında yeni bir dosya oluşturun

source: For example, for a *car* type the constant file will be ``<GLPI_ROOT>/files/_plugins/genericobject/fields/car.constant.php``.
cs_cz: Například, pro typ *auto* soubor konstanty bude ``<GLPI_ROOT>/files/_plugins/genericobject/fields/car.constant.php``.
fr_fr: Par exemple, pour un type *véhicule* le fichier de constantes sera ``<GLPI_ROOT>/files/_plugins/genericobject/fields/car.constant.php``.
pt_pt: Por exemplo, para um tipo *car* o arquivo constante será ``<GLPI_ROOT>/files/_plugins/genericobject/fields/car.constant.php``.
tr_tr: Örneğin *arac* türü için sabit dosyası ``<GLPI_ROOT>/files/_plugins/genericobject/fields/arac.constant.php`` şeklinde olur.

source: Please note that the file's first line must be the following, otherwise the new fields won't appear in the list:
cs_cz: Mějte na paměti, že je třeba, aby první řádek souboru byl následující, jinak se nové kolonky neobjeví v seznamu:
fr_fr: Notez que la première ligne du fichier doit être la suivante, sans quoi les nouveaux champs n'apparaîtront pas dans la liste :
pt_pt: Observe que a primeira linha do ficheiro deve ser a seguinte, caso contrário os novos campos não aparecerão na lista:
tr_tr: Lütfen dosyanın ilk satırının şu şekilde olduğundan emin olun. Yoksa yeni alanlar listede görüntülenmez:

source: Add the new fields definitions.
cs_cz: Přidat definice nových kolonek.
fr_fr: Ajouter les nouvelles définitions de champs.
pt_pt: Adicionar novoas definições de ficheiros.
tr_tr: Yeni alan tanımlarını ekleyin.

source: Add a simple dropdown field
cs_cz: Přidat kolonku jednoduchého rozbalovacího seznamu
fr_fr: Ajouter un champ liste déroulante simple
pt_pt: Adicionar um campo dropdown simples
tr_tr: Basit açılan kutu alanı eklemek

source: The language variable must be defined in the language file (see explaination above).
cs_cz: V souboru s jazykovými daty je třeba určit proměnnou pro jazyk (viz vysvětlení výše).
fr_fr: La variable de langue doit être définie dans le fichier de langues (voir les explications ci-dessus).
pt_pt: A variável de idioma deve ser definida no arquivo de idioma (ver explicação acima).
tr_tr: Dil dosyasında dil değişkeni tanımlanmalıdır (yukarıdaki açıklamaya bakın).

source: Add a dropdown field that is assigned to an entity:
cs_cz: Přidat kolonku rozbalovací nabídky která je přiřazená k entitě:
fr_fr: Ajouter un champ liste déroulante qui est assigné à une entité :
pt_pt: Adicione um campo drop-down atribuído a uma entidade:
tr_tr: Bir varlığa atanmış bir açılan kutu alanı eklemek:

source: Add a tree dropdown field
cs_cz: Přidat kolonku stromové rozbalovací nabídky
fr_fr: Ajouter un champ liste déroulante hiérarchique
pt_pt: Adicionar um campo drop-down em esquema
tr_tr: Bir açılan ağaç alanı eklemek

source: You can use at the same time the following parameters : *entities_id*, *is_recursive*, *is_tree*.
cs_cz: Ve stejnou chvíli je možné použít následující parametry: *entities_id*, *is_recursive*, *is_tree*.
fr_fr: Vous pouvez utiliser en même temps les paramètres suivants : *entities_id*, *is_recursive*, *is_tree*.
pt_pt: É possível utilizar ao mesmo tempo os seguintes parâmetros : *entities_id*, *is_recursive*, *is_tree*.
tr_tr: Aynı zamanda şu parametreleri de kullanabilirsiniz: *entities_id*, *is_recursive*, *is_tree*.

source: Add a dropdown field that is based on a GLPI-core object (user, location...)
cs_cz: Přidat rozbalovací kolonku která je založena na objektu GLPI samotného (uživatel, umístění…)
fr_fr: Ajout d'un champ liste déroulante basé sur les objets du coeur de GLPI (utilisateur, emplacement, ...)
pt_pt: Adicionar um campo drop-down baseado em um objeto núcleo GLPI (utilizador, localização…)
tr_tr: GLPI çekirdek nesnesi temelli bir açılan kutu alanı eklemek (kullanıcı, konum...):

source: Name between brackets (``[]``) **MUST** begin with ``users_id`` in order to be recognized as a field based on GLPI users' list.
cs_cz: Aby kolonka byla rozpoznána jako ta založená na seznamu uživatelů GLPI je **NUTNÉ**, aby jméno mezi hranatými závorkami (``[]``) začínalo na ``users_id`.
fr_fr: Les noms entre crochets (``[]``) **DOIVENT** commencer par ``users_id`` pour être reconnus comme étant des champs basés sur la liste des utilisateurs de GLPI.
pt_pt: O nome entre parênteses (``[]``) **DEVE** começar com ``users_id``` para ser reconhecido como um campo baseado na lista de utilizadores GLPI.
tr_tr: Köşeli parantez içindeki adlar (``[]``) GLPI kullanıcı listesinde bir alan olarak değerlendirilmesi için ``users_id`` ile **BAŞLAMALIDIR**.

source: See file ``<GLPI_ROOT>/files/_plugins/genericobject/fields/field.constant.php`` to get a complete list of available fields.
cs_cz: Viz soubor ``<GLPI_ROOT>/files/_plugins/genericobject/fields/field.constant.php`` s úplným seznamem kolonek, které jsou k dispozici.
fr_fr: Voir le fichier ``<GLPI_ROOT>/files/_plugins/genericobject/fields/field.constant.php`` pour une liste complète des champs disponibles.
pt_pt: Seja o arquivo ``<GLPI_ROOT>/files/_plugins/genericobject/fields/field.constant.php``` para obter uma lista completa dos campos disponíveis.
tr_tr: Kullanılabilecek alanların tam listesini ``<GLPI_ROOT>/files/_plugins/genericobject/fields/field.constant.php`` dosyasından görebilirsiniz.

source: Add a global dropdown
cs_cz: Přidat globální rozbalovací nabídku
fr_fr: Ajouter une liste déroulante globale
pt_pt: Adicionar uma lista pendente geral
tr_tr: Bir genel açılan kutu eklemek

source: A global dropdown can be used in all itemtypes. A good example would be :
cs_cz: Globální rozbalovací nabídku je možné použít ve všech typech položek. Dobrý příklad by byl:
fr_fr: Une liste déroulante globale peut être utilisée dans tous les types d'objets. Un bon exemple serait :
pt_pt: Uma lista suspensa geral pode ser utilizada em todos os tipos de item. Um bom exemplo seria :
tr_tr: Tüm öge türleri için genel bir açılan kutu kullanılabilir. İyi bir örnek şöyle olabilir:

source: A specific category table will be created for each itemtype. The table name and field name will the computed this way:
cs_cz: Pro každý typ položky bude vytvořena zvlášť tabulka kategorie. Název tabulky a kolonky bude vytvořena takto:
fr_fr: Une table pour les catégorie spécifique sera créée pour chaque type d'objet. Le nom de la table et le nom du champ seront concaténés de cette manière :
pt_pt: Uma tabela de categorias específicas será criada para cada tipo de item. O nome da tabela e o nome do campo serão calculados desta forma:
tr_tr: Her öge türü için özel bir kategori tablosu oluşturulur. Tablo adı ve alan adı şu şekilde belirlenir:

source: table : ``glpi_plugin_genericobject_<itemtypename>_category``
cs_cz: tabulka: ``glpi_plugin_genericobject_<itemtypename>_category``
pt_pt: tabela : ``glpi_plugin_genericobject_<itemtypename>_category``
tr_tr: tablo : ``glpi_plugin_genericobject_<itemtypename>_category``

source: field name : ``plugin_genericobject_<itemtype>categories_id``
cs_cz: název kolonky: ``plugin_genericobject_<itemtype>categories_id``
fr_fr: nom du champ : ``plugin_genericobject_<itemtype>categories_id``
pt_pt: nome de ficheiro: ``plugin_genericobject_<itemtype>categories_id``
tr_tr: alan adı : ``plugin_genericobject_<itemtype>categories_id``

source: Add an integer field
cs_cz: Přidat celočíselnou kolonku
fr_fr: Ajouter un champ entier
pt_pt: Adicionar um campo inteiro
tr_tr: Bir tamsayı alanı eklemek

source: Add a text field
cs_cz: Přidat textovou kolonku
fr_fr: Ajouter un champ texte
pt_pt: Adicionar um campo de texto
tr_tr: Bir metin alanı eklemek

source: By adding the following argument, you can tell the plugin that this field can be automatically generated when using a template:
cs_cz: Přidáním následujícího argumentu je možné zásuvnému modulu sdělit, že tato kolonka může být vytvořena automaticky při použití šablony:
fr_fr: En ajoutant l'argument suivant, vous indiquerez au plugin que ce champ peut être généré automatiquement en utilisant un modèle :
pt_pt: Ao adicionar o seguinte argumento, pode dizer ao plugin que este campo pode ser gerado automaticamente ao usar um modelo:
tr_tr: Şu argümanı ekleyerek, eklentiye bir kalıpta kullanıldığında bu alanın otomatik olarak üretileceğini söylemiş olursunuz:

source: Add a Yes/No field
cs_cz: Přidat kolonku Ano/Ne
fr_fr: Ajouter un champ Oui/Non
pt_pt: Adicionar campo Sim/Não
tr_tr: Bir Evet/Hayır alanı eklemek

source: Add a date field
cs_cz: Přidat datumovou kolonku
fr_fr: Ajouter un champ date
pt_pt: Adicionar um campo de data
tr_tr: Bir tarih alanı eklemek

source: Add a date & time field
cs_cz: Přidat kolonku datum a čas
fr_fr: Ajouter un champ date et heure
pt_pt: Adicionar um campo de data e hora
tr_tr: Bir tarih ve saat alanı eklemek

source: If you don't want a field to be modified using massive actions, add the following line to its definition:
cs_cz: Pokud nechcete aby byla kolonka upravena hromadnými akcemi, přidejte do její definice následující řádek:
fr_fr: Si vous ne souhaitez pas que le champ puisse être modifié en utilisant une action de masse, ajouter la ligne suivante à sa définition :
pt_pt: Se você não quiser que um campo seja modificado usando ações massivas, adicione a seguinte linha à sua definição:
tr_tr: Bir alanın toplu işlemlerden etkilenmesini istemiyorsanız tanımına şu satırı ekleyin:

source: Add global fields
cs_cz: Přidat globální kolonky
fr_fr: Ajouter des champs globaux
pt_pt: Adicionar campos globais
tr_tr: Genel alanlar eklemek

source: To make your fields accessible to all itemtypes:
cs_cz: Pro zpřístupnění vašich kolonek všem položkám všech typů:
fr_fr: Pour rendre vos champs accessibles depuis tous les types d'objets :
pt_pt: Para tornar os seus campos acessíveis a todos os tipos de itens:
tr_tr: Alanlarınızın tüm öge türleri tarafından kullanılabilmesi için:

source: Create a file named ``<GLPI_ROOT>/files/_plugins/genericobject/fields/field.constant.php``
cs_cz: Vytvořte soubor nazvaný ``<GLPI_ROOT>/files/_plugins/genericobject/fields/field.constant.php``
fr_fr: Créer un fichier nommé ``<GLPI_ROOT>/files/_plugins/genericobject/fields/field.constant.php``
pt_pt: Crie um ficheiro com o nome ``<GLPI_ROOT>/files/_plugins/genericobject/fields/field.constant.php``
tr_tr: ``<GLPI_ROOT>/files/_plugins/genericobject/fields/field.constant.php`` adında bir dosya oluşturun

source: Put your definitions in this file.
cs_cz: Umístěte své definice do tohoto souboru.
fr_fr: Ajouter les définitions dans ce fichier.
pt_pt: Coloque as suas definições neste ficheiro.
tr_tr: Tanımlarınızı bu dosya içine ekleyin.

source: Setup Rights
cs_cz: Nastavit oprávnění
fr_fr: Configurer les droits
pt_pt: Direitos de Configuração
tr_tr: Kurulum izinleri

source: You can define access rights for each object's type, for each profile. Available options are:
cs_cz: Je možné určit přístupová práva pro každý z typů objektu, pro každý profil. Dostupné možnosti jsou:
fr_fr: Vous pouvez définir des droits d'accès pour chaque type d'objet, pour chaque profil. Les options disponibles sont :
pt_pt: É possível definir direitos de acesso para cada tipo de objeto, para cada perfil. As opções disponíveis são:
tr_tr: Her profil için her bir nesne türüne göre erişim izinleri tanımlanabilir. Şu seçenekler kullanılabilir:

source: *right on the type*: *no access*, *read*, *write*.
cs_cz: *právo na typu*: *žádný přístup*, *čtení*, *zápis*.
fr_fr: *droits sur le type* : *pas d'accès*, *lecture*, *écriture*.
pt_pt: *direto ao tipo*: *sem acesso*, *leia*, *escreva*.
tr_tr: *Tür izni*: *Erişilemez*, *Okuma*, *Yazma*.

source: *right to associate this type of object to tickets*: *yes*, *no*.
cs_cz: *právo přiřadit tento typ objektu k požadavku*: *ano*, *ne*.
fr_fr: *droits pour associer ce type d'objet aux tickets* : *oui*, *non*.
pt_pt: *o direito de associar este tipo de objecto a bilhetes: *sim*, *não*.
tr_tr: *Bu nesne türünü destek kayıtları ile ilişkilendirme izni*: *Evet*, *Hayır*

source: To associate the rights you can either:
cs_cz: Pro přiřazení oprávnění je možné buď:
fr_fr: Pour associer les droits, vous pouvez au choix :
pt_pt: Para associar os direitos que também pode:
tr_tr: İzinleri atamak için şunları yapabilirsiniz:

source: Use the *Rights* tab in the *itemtype* form.
cs_cz: Použijte panel *Práva* ve formuláři *typ položky*.
fr_fr: Utiliser l'onglet *Droits* dans le formulaire du *type d'objet*.
pt_pt: Utilize a ficha *Direitos* no formulário *tipo de item*.
tr_tr: *Öge türü* formundaki *İzinler* sekmesini kullanın.

source: Navigate to *Administration > Profiles* and administer the rights for each profile.
cs_cz: Přejděte do *Správa > Profily* a spravujte práva pro každý z profilů.
fr_fr: Aller dans *Administration > Profils* pour administrer les droits de chaque profil.
pt_pt: Vá até *Administração > Perfis* e administre os direitos para cada perfil.
tr_tr: *Yönetim > Profiller* bölümüne gidin ve her bir profil için izinleri ayarlayın.

source: Use the new field
cs_cz: Použít novou kolonku
fr_fr: Utiliser le nouveau champ
pt_pt: Use o novo ficheiro
tr_tr: Yeni alanı kullanmak

source: Activate the new type, it's now ready to be used.
cs_cz: Aktivujte nový typ, nyní je připraven k použití.
fr_fr: Activer le nouveau type, il est désormais prêt à être utilisé.
pt_pt: Ativar o novo tipo, está agora pronto para ser usado.
tr_tr: Yeni türü etkinleştirin ve kullanmaya başlayın.

source: The new type is available for users in the *Plugins > Objects management* menu.
cs_cz: Nový typ je uživatelů k dispozici v nabídce *Zásuvné moduly > Správa objektů*.
fr_fr: Le nouveau type est disponible pour les utilisateurs depuis le menu *Plugins > Gestion d'objets*.
pt_pt: O novo tipo está disponível para usuários no menu *Plugins > Gerência de objetos*.
tr_tr: Kullanıcılar yeni türü *Eklentiler > Nesne yönetimi* menüsünden kullanabilir.

source: Use case of Generic Object as a CMMS
cs_cz: Použít velikost generického objektu jako CMMS
fr_fr: Exemple d'utilisation de Generic Object comme GMAO
pt_pt: Caso de uso de objeto genérico como um CMMS
tr_tr: Genel nesle ile BDBYS kullanım örneği

source: Purpose of this documentation
cs_cz: Účel této dokumentace
fr_fr: But de cette documentation
pt_pt: Finalidade desta documentação
tr_tr: Bu belgenin amacı

source: Showing a complete usage of Generic Object as a CMMS (Computerized Maintenance Management System) in biomedical environment.
cs_cz: Zobrazuje se úplné použití Obecného objektu jako CMMS (počítačem podporovaná správa údržby) v biomedicínském prostředí.
fr_fr: Présenter une utilisation complète de Generic Object comme GMAO (Gestion de Maintenance Assistée par Ordinateur) dans un environnement biomédical.
pt_pt: Mostrar uma utilização completa do objeto genérico como um CMMS (Computerized Maintenance Management System) em ambiente biomédico.
tr_tr: Biyotıp alanında Genel nesne ile BDBYS (bilgisayar destekli bakım yönetimi sistemi) kullanımını açıklar.

source: At the end of this use case, you will have :
cs_cz: Na konci tohoto příkladu využití budete mít:
fr_fr: À la fin de cette documentation, vous aurez :
pt_pt: No final deste caso de uso, terá :
tr_tr: Bu kullanım örneğinin sonunda şunları yapmış olacaksınız :

source: a dedicated *Biomed* entity (under *Root entity*)
cs_cz: vyhrazenou entitu *Biomed* (pod *Kořenová entita*)
fr_fr: une entité *Biomed* dédiée (sous l\'*Entité racine*)
pt_pt: uma entidade *Biomédica* dedicada (sob *Entidade raiz*)
tr_tr: Adanmış bir *Biyotıp* varlığı ("Kök varlık" altında)

source: containing *Biomedical* objects (in *Assets* menu)
cs_cz: obsahující *Biomedicínské* objekty (v nabídce *Majetky*)
fr_fr: contenant des objects *Biomedical* (dans le menu *Parc*)
pt_pt: contendo objetos *Biomédicos* (no menu *Ativos*)
tr_tr: *Biyotıp* nesneleri (*Varlıklar* menüsü altında)

source: with built-in and user-defined fields
cs_cz: s vestavěnými a uživatelsky určenými kolonkami
fr_fr: avec des champs pré-définis et personnalisés
pt_pt: com campos internos e campos definidos pelo utilizador
tr_tr: İç ve kullanıcı tanımlı alanlar ile

source: manages by users with *Admin_biomed* profile
cs_cz: spravuje uživatele s profile *Spravce_biomed*
fr_fr: gérée par des utilisateurs avec le profil *Admin_biomed*
pt_pt: gerência por utilizadores com perfil Admin_biomed
tr_tr: *Biyotıp_Yönetici* profilindeki yönetici kullanıcıları

source: Steps
cs_cz: Kroky
fr_fr: Étapes
pt_pt: Passos
tr_tr: Adımlar

source: Following steps assume you have a Super-Admin authorization :
cs_cz: Následující kroky předpokládají, že máte práva hlavního správce (Super-Admin):
fr_fr: Les étapes suivantes partent du principe que vous avez une habilitation Super-Admin :
pt_pt: Os seguintes passos assumem que tem uma autorização do Super-Admin:
tr_tr: Bundan sonraki adımları yapabilmek için Süper Yönetici yetkileriniz olmalıdır :

source: Installing Generic Object on GLPI (validated with genericobject >= 0.85-1.0 and GLPI >= 0.90)
cs_cz: Instaluje se Obecný objekt on GLPI (ověřeno s genericobject >= 0.85-1.0 a GLPI >= 0.90)
fr_fr: Installer Generic Object sur GLPI (validé avec genericobject >= 0.85-1.0 et GLPI >= 0.90)
pt_pt: A instalar Objeto Genérico no GLPI (validado com objeto genérico >= 0.85-1.0 e GLPI >= 0.90)
tr_tr: GLPI üzerine Genel nesne eklentisini kurun (Generic Object 0.85 ile 1.0 arasındaki sürümler ve GLPI 0.90 ve üzerindeki sürümler gereklidir)

source: Generic Object configuration
cs_cz: Nastavení obecného objektu
fr_fr: Configuration de Generic Object
pt_pt: Configuração de objeto genérico
tr_tr: Genel nesne yapılandırması

source: GLPI configuration
cs_cz: Nastavení GLPI
fr_fr: Configuration de GLPI
pt_pt: Configuração GLPI
tr_tr: GLPI yapılandırması

source: Start using Generic Object and GLPI
cs_cz: Začít používat obecný objekt a GLPI
fr_fr: Démarrer l'utilisation de Generic Object et GLPI
pt_pt: Iniciar a utilização de Objeto genérico e GLPI
tr_tr: Genel nesne ve GLPI kullanmaya başlayın

source: Installing Generic Object on GLPI
cs_cz: Instalace obecného objektu do GLPI
fr_fr: Installer Generic Object sur GLPI
pt_pt: Instalação de objeto genérico no GLPI
tr_tr: GLPI üzerine Genel nesne eklentisini kurmak

source: See :ref:`install_plugin` section.
cs_cz: Viz sekce :ref:`install_plugin`.
fr_fr: Voir la section :ref:`install_plugin`.
pt_pt: Veja a seção :ref:`install_plugin`.
tr_tr: ref:`install_plugin` bölümüne bakın.

source: Create your type of object
cs_cz: Vytvořte typ objektu
fr_fr: Créer votre type d'objet
pt_pt: Cria um tipo de objeto
tr_tr: Nesne türünüzü ekleyin

source: See :ref:`create_new_object` section and use *biomedical* as internal identifier. Label will be set automatically to *Biomedical* (with an uppercase *B*).
cs_cz: Viz sekce :ref:`create_new_object` a použít *biomedicínské* jako vnitřní identifikátor. Štítek bude automaticky nastaven na *Biomedicínské* (S velkým písmenem *B*).
fr_fr: Voir la section :ref:`create_new_object` et utiliser *biomedical* comme identifiant interne. Le libellé sera défini automatiquement à *Biomedical* (avec un *B* majuscule).
pt_pt: Veja a seção :ref:`criar_novo_objeto` e use *biomédica* como identificador interno. A etiqueta será automaticamente definida como *Biomédica* (com uma maiúscula *B*).
tr_tr: :ref:`create_new_object` bölümüne bakın ve iç belirteç olarak *biyotıp* yazın. Etiket otomatik olarak *Biyotıp* (Büyük *B* ile) olarak ayarlanır.

source: After a logoff/login, you will see *Biomedical* menu in Assets.
cs_cz: Po odhlášení/přihlášení, v Majetku uvidíte nabídku *Biomedicínské*.
fr_fr: Après une connexion/déconnexion, vous verrez le menu *Biomedical* dans le Parc.
pt_pt: Após um logoff/login, verá o menu *Biomédico* em Ativos.
tr_tr: Oturumu kapatıp yeniden açtıktan sonra Varlıklar menüsünde *Biyotıp* görüntülenir.

source: Define Biomedical's new fields
cs_cz: Určit nové kolonky biomedicínského
fr_fr: Définir les nouveaux champs du type Biomedical
pt_pt: Definir novos campos da Biomédica
tr_tr: Biyotıp için yeni alanları tanımlayın

source: These fields will be usable only by Biomedical's objects :
cs_cz: Tyto kolonky budou použitelné pouze v biomedicínských objektech:
fr_fr: Ces champs seront utilisables uniquement par les objets du type Biomedical
pt_pt: Estes campos serão utilizados apenas por objetos Biomédicos:
tr_tr: Bu alanlar yalnızca Biyotıp nesneleri için kullanılabilir :
