Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/escalade/index.po
Languages: tr_tr

source: Escalade
tr_tr: Düzey yükseltme

source: Download
tr_tr: İndir

source: Sources
tr_tr: Kaynaklar

source: Requirements (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
tr_tr: GLPI sürümü

source: Minimum PHP
tr_tr: En düşük PHP sürümü

source: Recommended
tr_tr: Önerilen

source: This plugin is available without a `GLPI Network <https://services.glpi-network.com/#offers>`_ subscription. It is also available on `GLPI Cloud <https://glpi-network.cloud>`_.
tr_tr: Bu eklenti bir `GLPI-Network <https://services.glpi-network.com/#offers>`_ aboneliği olmadan kullanılabilir. Ayrıca `GLPI Cloud <https://glpi-network.cloud/>`_ üzerinden de edinilebilir.

source: Install the plugin
tr_tr: Eklentiyi kurmak

source: Go to the marketplace. Download and install the plugin **Escalade**.
tr_tr: Mağazaya gidin. **Üste aktar** eklentisini indirip kurun.

source: Assign a ticket
tr_tr: Bir destek kaydı ekleyin

source: Escalade vs business rules We advise you **to use business rules** to allocate tickets or escalations. This allows you to manage more flexibly when changing category, urgency, etc.
tr_tr: Üste aktarma ile iş kurallarını karşılaştırırsak, destek kayıtlarını veya üste aktarmaları atamak için **İş kuralları** kullanmanızı öneririz. Böylece, kategori ve önem düzeyi gibi değişiklikleri daha esnek bir şekilde yönetebilirsiniz.

source: **Escalade** allows tickets **to be escalated only to groups**, and not to live users.
tr_tr: **Üste aktar**, destek kayıtlarının **Yalnızca gruplara** aktarılmasına izin verir, canlı kullanıcılara aktarılmasına izin vermez.

source: When the plugin is activated, a new option is available from the ticket interface :
tr_tr: Eklenti etkinleştirildiğinde, destek kaydı arayüzünde yeni bir seçenek kullanılabilir:

source: Set plugin parameters
tr_tr: Eklenti parametrelerini ayarlayın

source: From the plugin, click on the spanner and choose the various options that interest you:
tr_tr: Eklentide somun anahtarı simgesine tıklayın ve ilgilendiğiniz seçenekleri seçin:

source: Action
tr_tr: İşlem

source: Effect
tr_tr: Etki

source: **Remove old assign group on new group assign**
tr_tr: **Yeni grup atandığında önceki atanmış grup kaldırılsın**

source: Deletes or not the existing groups when you assign a new one
tr_tr: Yeni bir grup atadığınızda var olan grupların silinip silinmeyeceğini belirler

source: **show group assign history visually**
tr_tr: **Grup atama geçmişi görselleştirilsin**

source: (*valid only if previous option is set to* **yes**) Previous groups will be visible when a new group is escalated
tr_tr: (*Yalnızca önceki seçenek **Evet** olarak ayarlandığında geçerlidir) Yeni bir grup üste aktarıldığında önceki gruplar görünür olur

source: **Assign ticket to initial group on solve ticket**
tr_tr: **Destek kaydı çözümlendiğinde ilk gruba atansın**

source: (*valid only if previous option is set to* **yes**) Reassigns ticket to initial group if a group is deleted
tr_tr: (*Yalnızca önceki seçenek **Evet** olarak ayarlandığında geçerlidir) Bir grup silinirse destek kaydını ilk gruba yeniden atar

source: **Escalation history in tasks**
tr_tr: **Görevlerde üste aktarma geçmişi kaydedilsin**

source: Keep or not the history of escalations in the tasks
tr_tr: Görevlerde üste aktarma geçmişinin kaydedilip kaydedilmeyeceğini belirler

source: **Remove technician(s) on escalation**
tr_tr: **Üste aktarmada teknisyenler kaldırılsın**

source: Technician(s) will be deleted when a new technician is added to the ticket
tr_tr: **Destek kaydına yeni bir teknisyen eklendiğinde teknisyenler silinir

source: **Ticket status can be changed after escalation**
tr_tr: **Üste aktarma sonrası destek kaydı durumu değiştirilebilsin**

source: Modify the status of the ticket after the escalation. A “do not modify” option is also available.
tr_tr: Üste aktarma sonrasında destek kaydının durumunu değiştirir. "Değiştirilmesin" seçeneği de vardır.

source: **Assign the technical manager on ticket category change**
tr_tr: **Destek kaydı kategorisi değiştiğinde teknik yönetici atansın**

source: If a technical manager is declared in an ITIL category, they will be automatically assigned and will receive a notification.
tr_tr: Bir ITIL kategorisi için bir teknik yönetici belirtilmiş ise, otomatik olarak atanır ve bir bildirim alır.

source: **Assign the technical group on ticket category change**
tr_tr: **Destek kaydı kategorisi değiştiğinde teknik grup atansın**

source: If a technical group is declared for an ITIL category, it will be automatically assigned and the members of the group will receive a notification
tr_tr: Bir ITIL kategorisi için bir teknik grup belirtilmiş ise, otomatik olarak atanır ve grubun üyeleri bir bildirim alır

source: **Clone tickets**
tr_tr: **Destek kayıtları kopyalansın**

source: Possibility of cloning tickets from the helpdesk interface .. figure:: images/Escalade-4.png
tr_tr: Yardım masası arayüzünden destek kayıtlarını kopyalayabilme .. şekil:: images/Escalade-4.png

source: **Close cloned tickets at the same time**
tr_tr: **Kopyalanmış destek kayıtları aynı anda kapatılsın**

source: Close all cloned tickets when one of them is closed
tr_tr: Kopyalanmış destek kayıtlarının biri kapatıldığında diğeri de kapatılır

source: **Use the technician’s group**
tr_tr: **Teknisyenin grubu kullanılsın**

source: If a technician is assigned, their group will also be assigned. You can choose to take account of the assignment when the ticket is created and/or modified. You can also choose to select the first or last group to which the user is assigned
tr_tr: Bir teknisyen atanırsa, grubu da atanır. Destek kaydı oluşturulduğunda ve/veya değiştirildiğinde atamayı hesaba katmayı seçebilirsiniz. Ayrıca kullanıcının atandığı ilk veya son grubun seçilmesini de seçebilirsiniz

source: **Remove requester(s) on escalation**
tr_tr: **Üste aktarmada istekte bulunanlar kaldırılsın**

source: Remove requester(s) in the event of an escalation. Please note that no history is kept, as is the case for assigning a group
tr_tr: Üste aktarma sonrasında istekte bulunanları kaldırır. Lütfen bir grup atanması durumunda olduğu gibi herhangi bir geçmiş kaydının korunmayacağını unutmayın

source: **Display delete button**
tr_tr: **Sil düğmesi görüntülensin**

source: Displays the option of deleting actors from the ticket (ability to refine which user/group/supplier by requestor/watcher/technician)
tr_tr: Aktörleri destek kaydından silme seçeneğini görüntüler (istekte bulunan/izleyen/teknisyen tarafından hangi kullanıcı/grup/tedarikçinin silineceği belirlenebilir)

source: **Activate filtering on allocation groups**
tr_tr: **Atama grupları süzülebilsin**

source: Enables filtering and whether or not escalation to other groups is possible. *See next chapter for more information*
tr_tr: Süzme ve diğer gruplara üste aktarma yapılıp yapılamayacağını belirler. *Ayrıntılı bilgi almak için bir sonraki bölüme bakın*

source: Setting up filtering
tr_tr: Süzmeyi ayarlamak

source: Filtering allows you to define which group is able to escalate tickets to other groups. For example, we don’t want N1 support to be able to escalate to N3 directly. The escalation to N2 must be mandatory.
tr_tr: Süzme, hangi grubun destek kayıtları diğer gruplara üste aktarabileceğinizi belirlemenizi sağlar. Örneğin, N1 desteğinin doğrudan N3 üstüne aktarılmasını istemiyoruz. N2 üstüne aktarılması zorunlu olmalıdır.

source: From **Administration > Groups**, select one of the groups
tr_tr: **Yönetim > Gruplar** bölümünden bir grup seçin

source: In **Escalade**, add the groups to which this one will be able to escalate tickets.
tr_tr: **Üste aktar** bölümünden bu grubun destek kayıtlarını aktarabileceği grupları ekleyin.

source: This option can be useful, but it requires all groups to be set up. If, for example, the **technician N1** group can escalate tickets to the **technician N2** group, you need to ensure that the **technician N2** group can escalate tickets to the **technician N3** group and also to the **N1** group, so that a ticket can be escalated if necessary.
tr_tr: Bu seçenek yararlı olabilir, ancak tüm grupların kurulmuş olması gerekir. Örneğin, **N1 Teknisyen** grubu destek kayıtları **N2 Teknisyen** grubu üstüne aktarabiliyorsa, **N2 Teknisyen** grubunun destek kayıtlarının **N3 Teknisyen** grubu ve ayrıca **N1** grubu üstüne aktarılabildiğinden emin olmalısınız. Böylece gerekirse bir destek kaydı üste aktarılabilir.

source: Example :
tr_tr: Örnek:

source: **Joe** user is **added** to group **Groupe 1**
tr_tr: **Ali** kullanıcısı **Grup 1** grubuna **eklendiğinde**

source: **Groupe 1** is configured to allow ticket escalation only to **Groupe 2**
tr_tr: **Grup 1** destek kayıtlarını yalnızca **Grup 2** üstüne aktarmaya izin verecek şekilde yapılandırılmıştır

source: **Joe** user can **only reassign** ticket to **Groupe 2** because it's assign to Groupe 1
tr_tr: **Ali** kullanıcısı destek kaydını **Grup 2** grubuna **yalnızca yeniden atayabilir** çünkü bu destek kaydı Grup 1 grubuna atanır

source: For other users not assign to **Groupe 1**, they can't reassign group to ticket (groups are not proposed in the list of assignation)
tr_tr: **Grup 1** grubuna atanmayan diğer kullanıcılar, grubu destek kaydına yeniden atayamazlar (gruplar atama listesinde önerilmez)

source: You can **bypass** this behavior per user
tr_tr: Bu davranışı her kullanıcı için **atlayabilirsiniz**

source: Ticket's search engine
tr_tr: Destek kaydının arama motoru

source: Plugin add three new search option
tr_tr: Eklenti üç yeni arama seçeneği ekler

source: Group concerning by escalation
tr_tr: Düzey yükseltme ile ilgilenen grup

source: Ex : get all tickets actually escalated to group **Groupe 1**
tr_tr: Örnek : **Grup 1** grubu üstüne aktarılmış tüm destek kayıtlarını alın

source: Number of escalation
tr_tr: Düzey yükseltme sayısı

source: Ex : get all tickets with more than ten escalation
tr_tr: Örnek: Düzeyi on kereden fazla yükseltilmiş tüm destek kayıtlarını alın

source: Number of escalation between two groups
tr_tr: İki grup arasındaki düzey yükseltme sayısı

source: Ex : get all tickets with more than 2 escalations between two groups
tr_tr: Örnek : İki grup arasında 2 kereden fazla yükseltilmiş tüm destek kayıtlarını alın

source: Central page
tr_tr: Merkez sayfa

source: New dashlet to display ticket solved to close and assign to you group
tr_tr: Kapatmak ve grubunuza atamak için çözümlenen destek kaydını görüntüleyen yeni pano bileşeni

source: New dashlet to display not solved ticket where your groups was not actually assign but was in the past
tr_tr: Gruplarınızın güncel olarak atanmadığı ancak geçmişte atanmış olduğu çözümlenmemiş destek kayıtlarını görüntülemek için yeni pano bileşeni

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/Escalade/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/Escalade/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
