Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/sccm/index.po
Languages: cs_cz, tr_tr

source: Download
tr_tr: İndir

source: Sources
tr_tr: Kaynaklar

source: Requirements for latest version
cs_cz: Požadavky pro poslední verzi
tr_tr: Son sürümün gereksinimleri

source: This plugin requires :
cs_cz: Tento zásuvný modul vyžaduje :
tr_tr: Bu eklentinin gereksinimleri:

source: PHP 7.2 or higher
cs_cz: PHP 7.2 nebo vyšší
tr_tr: PHP 7.2 ve üzerindeki sürümler

source: GLPI >= 9.4
tr_tr: GLPI 9.4 ve üzerindeki sürümler

source: FusionInventory plugin for GLPI
cs_cz: Zásuvný modul FusionInventory pro GLPI
tr_tr: GLPI için FusionInventory eklentisi

source: SCCM >= 1802
tr_tr: SCCM 1802 ve üzerindeki sürümler

source: PHP curl_init and sqlsrv_connect
tr_tr: PHP curl_init ve sqlsrv_connect

source: Microsoft Drivers for PHP for Microsoft SQL Server
cs_cz: Microsoft ovladače pro PHP pro Microsoft SQL Server
tr_tr: PHP için Microsoft SQL Server sürücüleri

source: Features
cs_cz: Funkce
tr_tr: Özellikler

source: Plugin to synchronize computers from SCCM (version 1802) to GLPI (version 9.3 and 9.4). It uses the "FusionInventory for GLPI" plugin and the power of its internal engine.
cs_cz: Zásuvný modul synchronizuje počítače z SCCM (verze 1802) do GLPI (verze 9.3 a 9.4). Využívá zásuvný modul Fusioninventory pro GLPI a sílu jeho interního enginu.
tr_tr: Bu eklenti SCCM üzerindeki bilgisayarları (sürüm 1802) GLPI ile (sürüm 9.3 ve 9.4) eşitlemek için kullanılır. "GLPI FusionInventory" eklentisi ve iç işleyicinin gücünü kullanır.

source: Workflow
cs_cz: Pracovní postup
tr_tr: İş akışı

source: This plugin add two automatic actions : "SCCMCollect" et "SCCMPush"
cs_cz: Zásuvný modul přidává dvě automatické akce: "SCCMCollect" a "SCCMPush"
tr_tr: Bu eklenti iki otomatik işlem ekler: "SCCMCollect" ve "SCCMPush"

source: The automatic action "SCCMCollect" queries the SCCM server with MsSQL queries.
cs_cz: Automatická akce "SCCMCollect" se dotazuje SCCM serveru dotazy MSSQL
tr_tr: Otomatik "SCCMCollect" işlemi, SCCM sunucusuna MsSQL sorguları gönderir.

source: This same action builds an XML foreach computer (in FusionInventory format).
cs_cz: Stejná akce vytvoří XML soubor pro každý počítač (ve formátu Fusioninventory).
tr_tr: Aynı işlem, her bilgisayar için bir XML dosyası oluşturur (FusionInventory biçiminde).

source: The automatic action "SCCMPush" injects XML files into GLPI over HTTP(s) (via cURL and FusionInventory) to display computer in GLPI.
cs_cz: Automatická akce "SCCMPush" vloží XML soubory do GLPI cestou HTTP(s) (skrze CURL a Fusioninventory) pro zobrazení počítače v GLPI.
tr_tr: Otomatik "SCCMPush" işlemi, bilgisayarı GLPI üzerinde görüntülemek için XML dosyalarını http(s) iletişim kuralı üzerinden GLPI üzerine (cURL ve FusionInventory aracılığıyla) aktarır.

source: Schematic diagram
cs_cz: Schematický diagram
tr_tr: Şematik çizim

source: Collected data
cs_cz: Sebraná data
tr_tr: Toplanan veriler

source: Depending on data availability in the SCCM server, foreach computer we collect:
cs_cz: V závislosti na dostupnosti dat v SCCM serveru sbíráme pro každý počítač:
tr_tr: SCCM sunucusundaki verilerin kullanılabilirliğine bağlı olarak, her bilgisayar için şu veriler toplanır:

source: Computer: name, last connected user, UUID, user login, domain, comments, serial
cs_cz: Počítač: název, poslední připojený uživatel, UUID, přihlašovací jméno, doména, komentáře, sériové číslo
tr_tr: Bilgisayar: Ad, son bağlanan kullanıcı, UUID, kullanıcı oturumu açma, etki alanı, açıklama, seri no

source: Operating system: name, architecture, version, service pack
cs_cz: Operační systém: název, architektura, verze, service pack
tr_tr: İşletim sistemi: Ad, mimari, sürüm, hizmet paketi

source: BIOS information: tag, model, type, manufacturer, serial, install date, version
cs_cz: BIOS informace: štítek, model, typ, výrobce, sériové číslo, datum instalace, verze
tr_tr: BIOS bilgileri: Etiket, model, tür, üretici, seri no, kurulum tarihi, sürüm

source: CPU: description (or name), manufacturer, frequency, type (arch), nb core, nb threads
cs_cz: CPU: popis (nebo název), výrobce, taktovací kmitočet, typ (architektura), počet jader, počet vláken
tr_tr: İşlemci: Açıklama (veya ad), üretici, frekans, tür (mimari), çekirdek sayısı, işlem sayısı

source: Softwares: name, version, editor, install date
cs_cz: Software: název, verze, editor, datum instalace
tr_tr: Yazılımlar: Ad, sürüm, düzenleyici, kurulum tarihi

source: Memory (RAM): capacity, decription, frequency, type, bus, serial
cs_cz: Paměť (RAM): velikost, popis, taktovací kmitočet, typ, sběrnice, sériové číslo
tr_tr: Bellek (RAM): Kapasite, açıklama, frekans, tür, veri yolu, seri no

source: Graphical card: name, chipset, memory
cs_cz: Grafická karta: název, chipset, paměť
tr_tr: Görüntü kartı: Ad, yonga seti, bellek

source: Sound card: name, manufacturer
cs_cz: Zvuková karta: název, výrobce
tr_tr: Ses kartı: Ad, üretici

source: Network card: name, MAC address, IP address (v4, v6)
cs_cz: Síťová karta: název, MAC adresa, IP adresa (IPv4, IPv6)
tr_tr: Ağ kartı: Ad, MAC adresi, IP adresi (v4, v6)

source: Disk part: name, mount type, total size
cs_cz: Diskový oddíl: název, typ připojení, celková velikost
tr_tr: Disk bölümü: Ad, bağlama türü, toplam boyut

source: Automatic actions
cs_cz: Automatické akce
tr_tr: Otomatik işlemler

source: Action to collect data from SCCM to XML files.
cs_cz: Akce pro sběr dat z SCCM do XML souborů.
tr_tr: SCCM üzerinden XML dosyalarına veri toplama işlemi.

source: Action to push XML file to FusionInventory plugin
cs_cz: Akce pro vložení XML souboru do zásuvného modulu Fusioninventory
tr_tr: XML dosyasını FusionInventory eklentisine gönderme işlemi

source: Creative Commons License
tr_tr: Creative Commons Lisansı
