Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/credit/index.po
Languages: tr_tr

source: Download
tr_tr: İndir

source: Sources
tr_tr: Kaynaklar

source: Requirements (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
tr_tr: GLPI sürümü

source: Minimum PHP
tr_tr: En düşük PHP sürümü

source: Recommended
tr_tr: Önerilen

source: Install the plugin
tr_tr: Eklentiyi kurmak

source: Go to the marketplace. Download and install the plugin “**Credit**”.
tr_tr: Mağazaya gidin. **Credit** eklentisini indirip kurun.

source: Setting up the plugin
tr_tr: Eklentiyi kurmak

source: Creating a credit type
tr_tr: Bir kredi türü oluşturuluyor

source: From **Setup > Dropdowns**,
tr_tr: **Kurulum > Açılan kutular** bölümünden,

source: click on **Credits** then **Credit types**.
tr_tr: **Krediler** ve **Kredi türleri** üzerine tıklayın.

source: search credit
tr_tr: kredi ara

source: Click on **add**.
tr_tr: **Ekle** üzerine tıklayın

source: Enter a name representing the type of credit granted
tr_tr: İzin verilen kredi türü için bir ad yazın

source: add credit
tr_tr: kredi ekle

source: Add credit to customer entity(ies)
tr_tr: Müşteri varlıklarına kredi eklemek

source: Example : We will create 3 types of credit:
tr_tr: Örnek: 3 kredi türü ekleyeceğiz

source: For a new follow-up
tr_tr: Yeni bir izleme için

source: For a new task
tr_tr: Yeni bir görev için

source: For a new solution
tr_tr: Yeni bir çözüm için

source: You can create a single type of credit which will group together the 3, it depends on the management of each case.
tr_tr: Her bir olayın yönetimine bağlı olarak, 3 türü bir arada gruplayacak şekilde tek bir kredi türü oluşturabilirsiniz.

source: In **Administration > Entities**, select the entity that will receive the credits.
tr_tr: **Yönetim > Varlıklar** bölümünden kredileri alacak varlığı seçin.

source: Go to the **Credit** section
tr_tr: **Krediler** bölümüne gidin

source: In the section **Add a credit**, enter a name for the new credit
tr_tr: **Kredi ekle** bölümünden yeni kredi için bir ad yazın

source: Define the type of credit created earlier
tr_tr: Daha önce oluşturulmuş kredi türünü tanımlayın

source: The start and end dates of the credit
tr_tr: Kredinin başlangıç ​​ve bitiş tarihleri

source: Activate it,
tr_tr: Etkinleştirin,

source: Make it available or not in the child entities (note that if you are in the parent entity, it will be accessible to all entities)
tr_tr: Alt varlıklarda kullanıma açın ya da kapatın (üst varlıktaysanız, tüm varlıklar tarafından erişilebilir olacağını unutmayın)

source: The quantity of credit sold
tr_tr: Satılan kredi tutarı

source: The authorisation to overconsume or not
tr_tr: Sınırı aşma izni verin ya da vermeyin

source: Click on **add**
tr_tr: **Ekle** üzerine tıklayın

source: add voucher
tr_tr: kupon ekleyin

source: Here, we’ll do the same for the 3 types of credit (followup, task and solution)
tr_tr: Burada aynı işlemi 3 kredi türü (izleme, görev ve çözüm) için yapacağız.

source: It is therefore possible to enter different values (number of credits, validity, overconsumption, etc.) for each credit:
tr_tr: Bu nedenle her kredi için farklı değerler (kredi sayısı, geçerlilik, sınır aşma vb.) belirtilebilir:

source: list voucher
tr_tr: kuponu listeleyin

source: Define default values
tr_tr: Varsayılan değerleri tanımlayın

source: In **Administration > Entities**, select the entity that will receive the credits
tr_tr: **Yönetim > Varlıklar** bölümünden kredileri alacak varlığı seçin

source: In the **Default options for entity** section
tr_tr: **Varlığın varsayılan seçenekleri** bölümünden

source: Select the type of credit by action
tr_tr: İşleme göre kredi türünü seçin

source: default credit
tr_tr: Varsayılan kredi

source: Click on **Update**
tr_tr: **Güncelle** üzerine tıklayın

source: "Caution Indicating credit types does not allow automatic settlement. It pre-selects the credit but it must be settled by the technician.
tr_tr: "Dikkat: Kredi türlerini belirtmek otomatik atanmalarını sağlamaz. Kredi önceden seçilir ancak teknisyen tarafından atanması gerekir.

source: Counting credits
tr_tr: Kredilerin sayılması

source: When a ticket is created, you can choose whether or not to deduct the corresponding credits.
tr_tr: Bir destek kaydı oluşturulduğunda, ilgili kredilerin düşülüp düşülmeyeceğini seçebilirsiniz.

source: In our example, we have chosen to deduct each action.
tr_tr: Örneğimizde her bir işlemi düşmeyi seçtik.

source: If we are doing a **follow-up**, we can deduct the credit assigned by default:
tr_tr: **İzleme** yapıyorsak, varsayılan olarak atanan krediyi düşebiliriz:

source: add credit on ticket
tr_tr: Destek kaydına kredi ekleyin

source: The same for a **task**:
tr_tr: Bir **görev** için de aynıdır:

source: add credit on task
tr_tr: Göreve kredi ekleyin

source: And for a **solution** :
tr_tr: Ve bir **çözüm** için:

source: add credit on solution
tr_tr: Çözüme kredi ekleyin

source: In the **Credit** section of the ticket you can see a summary of credits spent and remaining
tr_tr: Destek kaydının **Kredi** bölümünde harcanan ve kalan kredilerin özetini görebilirsiniz

source: list of credits
tr_tr: Kredilerin listesi

source: Modify a credit on a ticket
tr_tr: Bir destek kaydının kredisini değiştirin

source: Increase or decrease a granted credit
tr_tr: Verilen krediyi artırın ya da azaltın

source: You can modify credits on a ticket if a readjustment is necessary.
tr_tr: Yeniden düzenlenmesi gerekirse destek kaydındaki kredileri değiştirebilirsiniz.

source: From the ticket in question, go to the **credit** section
tr_tr: İlgili destek kaydında **Kredi** bölümüne gidin

source: Select the credit you wish to adjust
tr_tr: Ayarlamak istediğiniz krediyi seçin

source: Click on **Actions**
tr_tr: **İşlemler** üzerine tıklayın

source: Click on **Quantity consumed** then add the desired quantity
tr_tr: **Kullanılan tutar** üzerine tıklayın ve ardından istediğiniz tutarı ekleyin

source: Click on **Send**
tr_tr: **Gönder** üzerine tıklayın

source: See how to proceed
tr_tr: Nasıl ilerleyeceğinizi görün

source: modify credit on ticket
tr_tr: Destek kaydının kredisini değiştirin

source: Delete deducted credits
tr_tr: Düşülen kredileri silin

source: From the ticket in question, go to the **Credit** section
tr_tr: İlgili destek kaydında **Kredi** bölümüne gidin

source: Select the credit you wish to delete
tr_tr: Silmek istediğiniz krediyi seçin

source: Click on **Delete permanently**
tr_tr: **Kalıcı olarak sil** üzerine tıklayın

source: delete credit on ticket
tr_tr: Destek kaydının kredisini silin

source: Credits will be automatically reallocated in the credit bank
tr_tr: Krediler kredi bankasından otomatik olarak yeniden atanır

source: Including an expired credit
tr_tr: Geçerlilik süresi geçmiş bir krediyi katmak

source: If the credit has expired, it will not be proposed in the list of available credits. You will not be able to deduct it. You will need to change the end date of the credit to be able to use it again.
tr_tr: Kredinin geçerlilik süresi dolmuşsa, kullanılabilir krediler listesinde önerilmez. Krediyi düşemezsiniz. Yeniden kullanabilmek için kredinin bitiş tarihini değiştirmeniz gerekir.

source: Notification of expired credits
tr_tr: Geçerlilik süresi dolmuş kredilerin bildirilmesi

source: An automatic action is available to notify you when a credit has expired.
tr_tr: Bir kredinin geçerlilik süresi dolduğunda size otomatik olarak bildirecek bir işlem vardır.

source: From **Setup > Automatic actions**, modify the **creditexpired** action to suit your needs.
tr_tr: **Kurulum > Otomatik işlemler** bölümünden **Kredi geçerlilik süresi dolma** işlemini size uygun şekilde değiştirin.

source: Click on **Save**
tr_tr: **Kaydet** üzerine tıklayın

source: automatic action
tr_tr: Otomatik işlem

source: You can of course customise the notification to suit your needs (**Setup > Notifications > Notifications > credit expired**)
tr_tr: Bildirimi size uygun şekilde özelleştirebilirsiniz (**Kurulum > Bildirimler > Kredi geçerlilik süresi dolma**)

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/Cr%C3%A9dit/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/Cr%C3%A9dit/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
