Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/formcreator/configuration.po
Languages: tr_tr

source: They are defined by entities and can be translated since GLPI 0.85 like all other dropdowns.
tr_tr: Varlıklara göre tanımlanırlar ve GLPI 0.85 sürümünden itibaren tüm diğer açılan kutular gibi başka dillere çevrilebilirler.

source: Dropdowns translation must be enabled on GLPI general configuration page `Setup > General`, `General setup > Translate dropdowns = Yes`
tr_tr: Genel GLPI yapılandırması sayfasından açılan kutu çevirileri etkinleştirilmiş olmalıdır: `Yapılandırma > Genel > Genel Yapılandırma > Açılan Kutu Çevirileri = Evet`

source: Categories may be associated to `Knowledge base categories`. This link is necessary to allow FAQ entries to show along your forms.
tr_tr: Kategoriler `Bilgi Bankası Kategorileri` ile ilişkilendirilebilir. Formların yanında yazılan konuya göre SSS kayıtlarının görüntülenmesi için bu bağlantı gereklidir.

source: Configuration
tr_tr: Yapılandırma

source: Render
tr_tr: Görünüm oluşturma

source: After the creation of a form, create fields for the user to fill out.
tr_tr: Formu oluşturduktan sonra kullanıcının dolduracağı alanları oluşturun.

source: The name of the questions will appear on the left and the field type selected on the right.
tr_tr: Soruların adları solda, seçilmiş alan türü sağda görüntülenir.

source: The Description will be under the input field.
tr_tr: Açıklama doldurulacak alanın altında bulunur.

source: Additional options may be displayed depending on the currently selected question type.
tr_tr: Seçilmiş soru türüne göre ek seçenekler görüntülenebilir.

source: If validation of the input is desired, it can be implemented following `PHP Regular Expressions <http://php.net/manual/reference.pcre.pattern.syntax.php>`_.
tr_tr: Girişin doğrulanmasını isteniyorsa, `PHP kurallı ifadeleri <http://php.net/manual/reference.pcre.pattern.syntax.php>`_ kullanılabilir.

source: If you want to show or hide questions depending on the answers of other questions, use the *show fields* area when editing a question. In the version 2.5.0 you may use more complex expressions checking for the content of several questions, and use logic operator **OR** and **AND**. The precedence of boolean operators applies, meaning that **AND** has precedence over **OR**.
tr_tr: Soruların, diğer sorulara verilen yanıtlara göregörüntülenmesini istiyorsanız bir soruyu düzenlerken *alanlar görüntülensin* bölümünü kullanın. 2.5.0 sürümünde bir kaç sorunun içeriğini denetlemek için karmaşık ifadeleri ile **VEYA** ve *VE** mantık işlemleri kullanılabilir. **VE** işleminin **VEYA** işlemine göre önceliği vardır.

source: Translation
tr_tr: Çeviri

source: In some cases a form should be available in several languages. Choose first in which language a form should be created. This language should be english (US or UK) or the language that most of target users understand. This is the fallback language if no alternative is found.
tr_tr: Bazı durumlarda bir formun birden fazla dilde olması gerekir. Önce formun hangi dilde oluşturulacağını seçin. Bu dil İngilizce (ABD ya da İngiltere) ya da hedef kullanıcıların çoğunun anladığı dil olmalıdır. Alternatif bulunamazsa bu dil, varsayılan dildir.

source: This language is also used as reference in the translation process. Then be sure that the chosen language is readable by the user who will translate the form.
tr_tr: Bu dil aynı zamanda çeviri sürecinde referans olarak kullanılır. Ardından, seçilen dilin formu çevirecek kullanıcı tarafından okunabilir olduğundan emin olun.

source: To translate a form open the tab **Form languages**, then create all languages you need to provide to users.
tr_tr: Bir formu çevirmek için **Form dilleri** sekmesini açın. Ardından kullanıcılara sunmanız gereken tüm dilleri oluşturun.

source: Choose a language added to the form and click it to begin or resume translation, then select the tab **Translations**. Click the button **New translation** and a popup dialog will open and show a string to translate. Type the translation, and click save or validate with **Enter** on your keyboard.
tr_tr: Forma eklenen bir dili seçin ve çeviriye başlamak veya sürdürmek için tıklayın. Ardından **Çeviriler** sekmesini seçin. **Yeni çeviri** düğmesine tıklayın. Bir pencere açılır ve çevrilecek bir dizge görüntülenir. Çeviriyi yazın ve klavyenizdeki **Enter** tuşu ile kaydedin veya doğrulayın.

source: If another string must be translated, it will show immediately. If no more string needs to be translated, a message will show instead.
tr_tr: Başka bir dizgenin çevrilmesi gerekiyorsa, hemen görüntülenir. Daha fazla dizgenin çevrilmesi gerekmiyorsa, bir ileti görüntülenir.

source: When you close the dialog the list of translated strings is refreshed. You can edit a translation by clicking on it, delete one or several translations with the checkboxes on the left of the list and the **Delete** button**. You can also filter the list with the filter input box.
tr_tr: Pencereyi kapattığınızda çevrilmiş dizgelerin listesi yenilenir. Bir çeviriyi üzerine tıklayarak düzenleyebilir, listenin solundaki işaret kutuları ve **Sil** düğmesi** ile bir veya birkaç çeviriyi silebilirsiniz. Ayrıca süzgeç alanını kullanarak listeyi süzebilirsiniz.

source: Creative Commons License
tr_tr: Creative Commons Lisansı
