Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/formcreator/configuration.po
Languages: tr_tr

source: Forms configuration
tr_tr: Form yapılandırmaları

source: Form creation
tr_tr: Form oluşturmak

source: The right to create forms is enabled to the profiles having the right to update entities in GLPI. Refer to the documentation of GLPI to know how to setup this right.
tr_tr: GLPI üzerinde varlıkları güncelleme hakkına sahip profillere form oluşturma izni verilir. Bu iznin nasıl kurulacağını öğrenmek için GLPI belgelerine bakın.

source: Forms must be created in the entities where they are intended to be available. A form may be available in its entity and all sub entities if the field **Child entities** is set to **Yes**.
tr_tr: Formlar, bulunmaları amaçlanan birimlerde oluşturulmalıdır. **Alt birimler** alanı **Evet** olarak ayarlanmışsa, bir form kendi biriminde ve tüm alt birimlerinde kullanılabilir.

source: Navigate to **Administration > Forms**.
tr_tr: **Yönetim > Formlar** bölümüne gidin.

source: Click on the button to add a form **+**
tr_tr: Bir form eklemek için **+** düğmesine tıklayın

source: Following fields must be populated:
tr_tr: Şu alanlar doldurulmalıdır:

source: **Name**: Name of the form.
tr_tr: **Ad**: Formun adı.

source: **Active**: A form is inactive by default. You need to explicitly activate it when it is ready to use.
tr_tr: **Etkin**: Bir form varsayılan olarak etkin değildir. Kullanıma hazır olduğunda etkinleştirmeniz gerekir.

source: It is recommended to fill the Category field:
tr_tr: Kategori alanını doldurmanız önerilir:

source: In the simplified interface, categories allow to tidy forms by Blocks.
tr_tr: Basitleştirilmiş arayüzde, kategoriler formların bloklara göre düzenlenmesini sağlar.

source: If you want to use the **service catalog** you must use form categories.
tr_tr: **Hizmet kataloğunu** kullanmak istiyorsanız, form kategorilerini kullanmanız gerekir.

source: Form categories are plugin's dropdowns. You can add form categories directly when editing a form using the **+** next to category field. You can do the same from **Configuration > Dropdowns > Form category**.
tr_tr: Form kategorileri, eklentisinin açılır listeleridir. Kategori alanının yanındaki **+** simgesi ile bir formu düzenlerken doğrudan form kategorileri ekleyebilirsiniz. Bu işlemi **Yapılandırma > Açılan kutu > Form kategorileri**' bölümünden de yapabilirsiniz.

source: **Direct access on homepage**: Direct access to the form from the GLPI's simplified interface.
tr_tr: **Ana sayfadan doğrudan erişim**: Basitleştirilmiş GLPI arayüzünden forma doğrudan erişim sağlar.

source: **Description**: displays in the list forms.
tr_tr: **Açıklama**: Liste formlarında görüntülenir.

source: **Language**: by default a form is set to the language of its creator. The form will be available only to users using the same language as the form. Choose **All languages** to make the form available to users without language restriction.
tr_tr: **Dil**: Varsayılan olarak bir form, oluşturan kişinin kullandığı dile ayarlanır. Form, yalnızca formla aynı dili kullanan kullanıcılar tarafından kullanılabilir. Formu dil kısıtlaması olmaksızın kullanıcılara sunmak için **Tüm diller** seçeneğini seçin.

source: **Header**: displays when the form is displayed.
tr_tr: **Başlık**: Form görüntülendiğinde görüntülenir.

source: **Need to be validate**: If **Yes** a list of validators is displayed. This is a list of GLPI users (with the right **Validate an incident** or **Validate a request** (in its profile) on a compatible entity with the form's entity. The list of validators is a multiple choice list. If no validator is selected all of them are submitted when the form is being used.
tr_tr: **Doğrulanması gerekiyor**: **Evet** olarak ayarlanmış ise bir doğrulayıcı listesi görüntülenir. Formun birimiyle uyumlu bir birim üzerindeki GLPI kullanıcılarının (sağda **Bir sorunu doğrula** ya da **Bir isteği doğrula** (profilinde) ile listeler. Doğrulayıcıların listesi çoktan seçmeli bir listedir. Doğrulayıcı seçilmezse, form kullanılırken tümüne gönderilir.

source: **Default form in service catalog**: if **Yes** the form will display in the service catalog without being filtered by the current category or keywords.
tr_tr: **Hizmet kataloğunun varsayılan formu**: **Evet** ise form, geçerli kategori veya anahtar sözcüklere göre süzülmeden hizmet kataloğunda görüntülenir.

source: When all fields are filled, click on the **add button** at the bottom of the page.
tr_tr: Tüm alanları doldurduktan sonra, sayfanın altındaki **Ekle** düğmesine tıklayın.

source: Deleting a form is possible only if there are no associated answers. To delete a form, delete all its answers first from the **Form answers** tab.
tr_tr: Bir form ancak ilişkili bir yanıt yoksa silinebilir. Bir formu silmek için önce **Form yanıtları** sekmesinden tüm yanıtlarını silin.

source: Sections
tr_tr: Bölümler

source: After clicking on the tab **Question** the following page displays:
tr_tr: **Soru** sekmesine tıkladıktan sonra aşağıdaki sayfa görüntülenir:

source: You must create a first **section**. Sections are intended to organize questions in the form.
tr_tr: Önce bir **bölüm** oluşturmalısınız. Bölümler, formdaki soruları gruplamak için kullanılır.

source: It is possible to setup conditions to show the whole section, based on the answers provided to questions located in other sections of the form.
tr_tr: Formun diğer bölümlerinde yer alan sorulara verilen yanıtlara göre bölümün görüntülenmesini ya da gizlenmesini sağlaycak koşullar oluşturulabilir.

source: Questions
tr_tr: Sorular

source: Click on the link **Add a question** in a section of your choice.
tr_tr: İstediğiniz bir bölümde **Bir soru ekle** üzerine tıklayın.

source: The following page displays:
tr_tr: Şu sayfa görüntülenir:

source: A question is made of:
tr_tr: Bir soru şunlardan oluşur:

source: a title: this is the label of the question in the form.
tr_tr: Başlık: Sorunun formdaki etiketi.

source: a type: see list below.
tr_tr: Tür: Aşağıdaki listeye bakın.

source: a section: the section containing the question. You can move a question to an other section with this field.
tr_tr: Bölüm: Sorunun bulunduğu bölüm. Bu alandan bir soruyu başka bir bölüme taşıyabilirsiniz.

source: a description: it is displayed under the question in the form. Use it as a hint for the requester, telling him which content is expected.
tr_tr: Açıklama: Formdaki sorunun altında görüntülenir. Bu alanda olması beklenen içeriği açıklayan bir ipucu olarak kullanabilirsiniz.

source: a dropdown list **Show field** to enable a condition
tr_tr: Bir koşulu etkinleştirmek için **Alanı görüntüle** açılır kutusu

source: It submits the following choices:
tr_tr: Şu seçenekleri sunar:

source: **Always visible**: the field is always displays
tr_tr: **Her zaman görüntülensin**: Alan her zaman görüntülenir

source: **Hidden unless**: The question is hidden except if answers to other questions matches a condition.
tr_tr: **Şu olmadan gizlensin**: Diğer soruların yanıtları bir koşulla eşleşmediği sürece soru gizlenir.

source: **Displayed unless**: The question is displayed except if the answers to other questions matches a condition.
tr_tr: **Şu olmadan görüntülensin**: Diğer soruların yanıtları bir koşulla eşleşmediği sürece soru görüntülenir.

source: Conditions may be multiple. To add or remove a condition two buttons are available:
tr_tr: Koşullar birden fazla olabilir. Bir koşul eklemek ya da kaldırmak için iki düğme bulunur:

source: **List of pictograms**
tr_tr: **Simge listesi**

source: The **circle** allows you to make a question mandatory
tr_tr: **Çember** bir sorunun zorunlu kılınmasını ya da

source: , or optional
tr_tr: ya da isteğe bağlı

source: **Arrow up** and **arrow down** allow you to reorder questions in a section.
tr_tr: **Yukarı ok** ve **aşağı ok** bir bölümdeki soruların sıralamasını değiştirmeyi sağlar.

source: Clicking on a question allow you to edit it.
tr_tr: Bir soru üzerine tıklanarak düzenlenebilir.

source: **Two stacked squares** allows you to duplicate a question or a whole section.
tr_tr: **Üst üste iki kare** bir soru ya da bölümün kopyasını oluşturur.

source: The **recycle bin** allows you to delete a question or a whole section.
tr_tr: **Çöp kutusu** bir soru ya da bölümü siler.

source: Questions are organized on a 4 columns array. You can resize width of questions, reorder them using drag and drop and put up to 4 questions on the same row.
tr_tr: Sorular 4 sütunlu bir dizi olarak düzenlenmiştir. Soruların genişliğini değiştirebilir, sürükleyip bırakarak sıralamasını değiştirebilir ve aynı satıra 4 taneye kadar soru koyabilirsiniz.

source: Types of question
tr_tr: Soru türleri

source: There are about twenty types of questions available. Depending on the chosen type, you need to provide additional information.
tr_tr: Yaklaşık yirmi soru türü vardır. Seçilen türe bağlı olarak, ek bilgiler vermeniz gerekir.

source: **Required**: **Yes**/**No**. When running the form a red star shows next to label of questions requiring an input.
tr_tr: **Zorunlu**: **Evet**/**Hayır**. Formu çalıştırırken, yanıtlanması zorunlu olan soruların etiketinin yanında kırmızı bir yıldız görüntülenir.

source: **Default values**: its content depends on the type of the question.
tr_tr: **Varsayılan değerler**: İçeriği, sorunun türüne bağlıdır.

source: **Range Min/Max**: Restricts the value to the given range when running the form.
tr_tr: **Aralık En az/En fazla**: Forma yazılabilecek değeri belirtilen aralıkla sınırlar.

source: **Additional validation (Regular expression)**: You may set a custom regex with a regular expression. Use it when other restriction methods cannot satisfy your needs. Don't forget to specify the delimiters of the regex. You may add any modifier after the closing delimiter.
tr_tr: **Ek doğrulama (kurallı ifade)**: Kurallı ifade kullanarak özel bir kurallı ifade belirtebilirsiniz. Diğer kısıtlama yöntemleri gereksinimi karşılamadığında kullanabilirsiniz. Kurallı ifadenin başında ve sonundaki sınırlayıcıları belirtmeyi unutmayın. Sınırlayıcıdan sonra değiştiriciler ekleyebilirsiniz.

source: Actors
tr_tr: Aktörler

source: This field allows you to choose one or several users:
tr_tr: Bu alan ile, bir veya birkaç kullanıcı seçebilirsiniz:

source: in GLPI, available in **Administration > Users**
tr_tr: GLPI içinden **Yönetim > Kullanıcılar** bölümündeki kullanıcılar seçilebilir

source: not in GLPI, by typing an email address
tr_tr: GLPI dışından e-posta adresi yazabilirsiniz

source: Checkboxes (multiple choices)
tr_tr: İşaret kutuları (çoklu seçim)

source: Add a line per value in **Values**. Default values may be set in **Default values**, one per line. If this field is empty, no checkbox will be ticked.
tr_tr: **Değerler** bölümünde her değer için bir satır ekleyin. Varsayılan değerler, her satıra bir tane olacak şekilde **Varsayılan değerler** bölümünden ayarlanabilir. Bu alan boş bırakıldığında hiçbir kutu işaretlenmez.

source: Date / Datetime / Time
tr_tr: Tarih / Tarih saat / Saat

source: This field allows to select a date, a datetime or a time from a mini calendar.
tr_tr: Bu alan mini takvimden bir tarih, tarih saat veya saat seçilebilmesini sağlar.

source: Description
tr_tr: Açıklama

source: This field only displays information. Use it to give more details about a question.
tr_tr: Bu alan yalnızca bilgi görüntülemek için kullanılır. Bir soru hakkında ayrıntılı bilgi vermek için kullanabilirsiniz.

source: Dropdown
tr_tr: Açılan kutu

source: This field allows the user to choose a value among those available in a dropdown from GLPI (in **Configuration > Dropdowns**).
tr_tr: Bu alan, kullanıcının GLPI içindeki bir açılır menüde (**Yapılandırma > Açılan kutular**) bulunan kutular arasından bir değer seçmesini sağlar.

source: Email
tr_tr: E-posta

source: The answer to this type of field must be a syntactically valid email address.
tr_tr: Bu tür bir alanın yanıtı, söz dizimsel olarak geçerli bir e-posta adresi olmalıdır.

source: File
tr_tr: Dosya

source: This field allows the requester to upload a file.
tr_tr: Bu alan, istekte bulunan kişinin bir dosya yükleyebilmesini sağlar.

source: Float
tr_tr: Ondalık

source: This field must be a float value. Note you may use a regular expression to tighter restrict the answer.
tr_tr: Bu alanın yanıtı ondalık bir değer olmalıdır. Yanıtı daha sıkı kısıtlamak için bir kurallı ifade kullanabileceğinizi unutmayın.

source: GLPI Object
tr_tr: GLPI nesnesi

source: This field allows you to build a dropdown from a GLPI object among those available in the menus:
tr_tr: Bu alan, menülerdeki GLPI nesnelerinden bir açılır menü oluşturulmasını sağlar:

source: Assets
tr_tr: Varlıklar

source: Assistance
tr_tr: Destek

source: Management
tr_tr: Yönetim

source: Tools
tr_tr: Araçlar

source: Administration
tr_tr: Yönetim

source: Hidden field
tr_tr: Gizli alan

source: This field is hidden and allows to retrieve an arbitrary value when generating the target (ticket or change).
tr_tr: Bu alan gizlidir ve hedef (destek kaydı ya da değişiklik) oluşturulurken rastgele bir değer alınmasını sağlar.

source: This type of questions never shows on a form.
tr_tr: Bu türdeki sorular formda hiçbir zaman görüntülenmez.

source: Hostname
tr_tr: Sunucu adı

source: This field is invisible. It allows to get the hostname of the computer used by the requester, assuming the DNS is able to properly resolve it from its IP address
tr_tr: Bu alan formda görüntülenmez. DNS adının IP adresinden uygun şekilde çözümlenebildiği varsayılarak, istekte bulunan kişi tarafından kullanılan bilgisayarın adının alınmasını sağlar.

source: Integer
tr_tr: Tamsayı

source: This field must be an integer value. Note you may use a regular expression to tighter restrict the answer.
tr_tr: Bu alanın yanıtı bir tamsayı değeri olmalıdır. Yanıtı daha sıkı kısıtlamak için bir kurallı ifade kullanabileceğinizi unutmayın.

source: IP Address
tr_tr: IP adresi

source: This field is hidden and collects the IP address of the form requester. It does not show in the form.
tr_tr: Bu alan formda görüntülenmez. Formu doldurarak istekte bulunan kişinin IP adresinin alınmasını sağlar.

source: LDAP select
tr_tr: LDAP seçimi

source: This field allows you to create a dropdown list with objects from a LDAP directory:
tr_tr: Bu alan, bir LDAP dizinindeki nesnelerin bulunduğu bir açılan kutu oluşturmanızı sağlar:

source: This type of questions cannot be used to fill actors of a target.
tr_tr: Bu türdeki sorular bir hedefin aktörlerini doldurmak için kullanılamaz.

source: Multiselect (multiple choice)
tr_tr: Çoklu seçim (birden çok seçenek)

source: This field allows you to create a dropdown list with ability to select multiple items. Values are added one per line in the field **Values**. You may set default values, one per line in *Default values**. If no default value is set then no item will be selected by default.
tr_tr: Bu alan, birden fazla ögenin seçilebileceği bir açılan kutu oluşturmanızı sağlar. Kutuda görüntülenecek değerler, **Değerler** bölümünde her biri ayrı satırda olacak şekilde eklenir. *Varsayılan değerler** bölümünden her biri ayrı satırda olacak şekilde varsayılan değerler ayarlayabilirsiniz. Varsayılan değer ayarlanmadığında, baştan varsayılan bir öge seçilmez.

source: Request type
tr_tr: İstek türü

source: This field is a dropdown with "Incident" or "Request" choices. It can be used to set the request type of a ticket being generated by the form.
tr_tr: Bu alan "Olay" veya "İstek" seçeneklerinin bulunduğu bir açılan kutudur. Form tarafından oluşturulan bir destek kaydının türünü ayarlamak için kullanılabilir.

source: Radio buttons (one choice only)
tr_tr: Radyo düğmeleri (yalnızca bir seçenek)

source: Add a line per value in **Values**. A default value may be set in **Default value**. If this field is empty, no radio will be selected.
tr_tr: **Değerler** bölümünde her değer için bir satır ekleyin. Varsayılan değer, **Varsayılan değer** bölümünden ayarlanabilir. Bu alan boş bırakıldığında baştan hiçbir seçenek işaretlenmez.

source: Select (one choice only)
tr_tr: Seçim (yalnızca bir seçenek)

source: This field allows you to create a dropdown list and set its items. Items are added one per line in **Values**. Default value may be set in **Default value**. If there is no default, no item is selected by default.
tr_tr: Bu alan, bir açılır kutu oluşturmanızı ve kutuda görüntülenecek ögeleri ayarlamanızı sağlar. Ögeler, **Değerler** bölümünden her biri ayrı satırda olacak şekilde eklenir. Varsayılan değer **Varsayılan değer** bölümünden ayarlanabilir. Varsayılan değer ayarlanmadığında, baştan varsayılan bir öge seçilmez.

source: Tags
tr_tr: Etiketler

source: This is a hidden field to add a tag to the form for future processing.
tr_tr: Gelecekteki işlemlerde kullanılmak üzere forma bir etiket eklemek için kullanılan gizli alan.

source: This type of field is only available when the plugin **Tag** is installed and enabled.
tr_tr: Bu alan türü yalnızca **Etiket** eklentisi kurulmuş ve etkinleştirilmiş ise kullanılabilir.

source: Text
tr_tr: Metin

source: This field allows you to input a single line of text.
tr_tr: Bu alan, tek bir metin satırı yazılmasını sağlar.

source: Text area
tr_tr: Metin alanı

source: This field allows you to input several lines of text.
tr_tr: Bu alan, bir kaç satırlık metin yazılmasını sağlar.

source: Urgency
tr_tr: Önem derecesi

source: This field allows you to select an urgency defined in GLPI.
tr_tr: Bu alan, GLPI içinde tanımlanmış bir önem derecesini seçmenizi sağlar.

source: Conditions
tr_tr: Koşullar

source: Conditions are expressions involving questions and sections which are evaluated in order to determine
tr_tr: Koşullar, bir şeyi belirlemek için değerlendirilecek soruları ve bölümleri içeren ifadelerdir.

source: if a question is displayed
tr_tr: Bir soru görüntüleniyor ise

source: if a section is displayed
tr_tr: Bir bölüm görüntüleniyor ise

source: if the submit button of a form is displayed
tr_tr: Bir formda Gönder düğmesi görüntüleniyor ise

source: if a target (see below) must be generated
tr_tr: Bir hedef (aşağı bakın) oluşturulması gerekiyor ise

source: Available operators in an assertion are:
tr_tr: Bir değerlendirmede kullanılabilecek işlemler şunlardır:

source: equals
tr_tr: şuna eşit olan

source: not equals
tr_tr: şuna eşit olmayan

source: less than
tr_tr: şundan küçük olan

source: greater than
tr_tr: şundan büyük olan

source: less than or equal
tr_tr: şundan küçük ya da eşit olan

source: greater than or equal
tr_tr: şundan büyük ya da eşit olan

source: is visible
tr_tr: görünür olan

source: is not visible
tr_tr: görünür olmayan

source: matches a regular expression
tr_tr: bir kurallı ifadeye uyan

source: The condition expression can be used with the following rules:
tr_tr: Koşul ifadesi aşağıdaki şu kullanılabilir:

source: **Hidden unless**: the item is hidden or not generated except when the expression is true
tr_tr: **Şu olmadığında gizli**: ifade doğru olmadığı sürece öge gizlenir veya oluşturulmaz

source: **Displayed unless**: the item is displayed or generated except when the expression is true
tr_tr: **Şu olmadığında görünür**: ifade doğru olmadığı sürece öge görünür veya oluşturulur

source: Access types
tr_tr: Erişim türleri

source: Three values are available:
tr_tr: Üç değer kullanılabilir:

source: **Public access**: Anonymous users may access the form; you may use it in an intranet.
tr_tr: **Herkese açık erişim**: Anonim kullanıcılar forma erişebilir. Bir Intranet sitesinde kullanabilirsiniz.

source: **Private access**: Users having a GLPI account may access the form.
tr_tr: **Özel erişim**: Yalnızca GLPI hesabı olan kullanıcılar forma erişebilir.

source: **Restricted access**: Only users having the specified profiles may access the form.
tr_tr: **Sınırlı erişim**: Yalnızca belirtilen profillerdeki kullanıcılar forma erişebilir.

source: When a form is set to **Public access** it is possible to enable a simple captcha. This captcha should prevent spamming if a form is accessible from internet.
tr_tr: Bir form **Herkese açık** olarak ayarlandığında basit bir güvenlik kodu kullanılabilir. Bu güvenlik kodu, internet üzerinden erişilebilen formlarda istenmeyen gönderimleri önlemek için yeterli olmalıdır.

source: Captchas are not enabled by default on anonymous forms. Administrators need to enabled them explicitly depending on how the form may be accessible from an hostile network such Internet.
tr_tr: Güvenlik kodu anonim formlarda varsayılan olarak açık değildir. Yöneticiler, forma internet gibi kötü niyetli girişimlerin yapılabileceği bir ağdan erişim biçimine göre bunu açmalıdır.

source: Targets
tr_tr: Hedefler

source: There are three types of targets for a form:
tr_tr: Bir formun üç tür hedefi olabilir:

source: tickets
tr_tr: Destek kayıtları

source: changes
tr_tr: Değişiklikler

source: problems
tr_tr: Sorunlar

source: It is possible to generate any number of targets from a single form. Mixing types of targets is also possible.
tr_tr: Tek bir formdan herhangi bir sayıda hedef oluşturulabilir. Hedef türleri karıştırılabilir.

source: To create a target click on the link **Add a target**
tr_tr: Bir hedef oluşturmak için **Bir hedef ekle** üzerine tıklayın

source: The following window is then displayed:
tr_tr: Ardından aşağıdaki pencere görüntülenir:

source: Choose a target name and type, then validate. The new target is created and is available for tuning.
tr_tr: Bir hedef adı seçin ve yazın, ardından doğrulayın. Yeni hedef oluşturulur ve ayarları yapılabilir.

source: Preview
tr_tr: Ön izleme

source: This tab allows you to view how the form will be rendered and test it without activating it.
tr_tr: Bu sekmede, formun nasıl görüntüleneceğine bakabilir ve etkinleştirmeden önce deneyebilirsiniz.

source: Submitting answers from the preview will be actually saved, and will generate targets if the form is not configured with validation.
tr_tr: Ön izlemeden gönderilen yanıtlar gerçekten kaydedilir ve form doğrulanacak şekilde yapılandırılmamışsa hedefler oluşturulur.

source: Form answers
tr_tr: Form yanıtları

source: This tab shows all answers saved for the form.
tr_tr: Bu sekmede, formun kaydedilen tüm yanıtları görüntülenir.

source: To delete a form, all its answers must be deleted first. A warning shows at the bottom of the main tab of a form as a reminder.
tr_tr: Bir formu silmek için önce tüm yanıtlarının silinmesi gerekir. Bir anımsatıcı olarak bir formun ana sekmesinin altında bir uyarı görüntülenir.

source: Categories
tr_tr: Kategoriler

source: **Menu** : `Setup > Dropdowns : Forms > Form categories`
tr_tr: **Menu** : `Ayarlar > Açılan kutular : Formlar > Form kategorileri`

source: Form categories allow you to arrange your forms list. Forms are displayed when they belong to the selected category or any sub category. When a form does not have any category, it is displayed when no category is selected or when the user selects "view all".
tr_tr: Form kategorileri, form listenizi düzenlemenizi sağlar. Formlar, seçilen kategoriye ya da herhangi bir alt kategoriye ait olduklarında görüntülenir. Herhangi bir kategorisi olmayan bir form, yalnızca herhangi bir kategori seçilmediğinde ya da kullanıcı "tümünü görüntüle" seçeneğini seçtiğinde görüntülenir.

source: You can add or edit categories generally from the Setup menu : `Setup > Dropdowns`.
tr_tr: Kategoriler genel olarak `Ayarlar > Açılan Kutular` menüsünden eklenip düzenlenebilir.

source: You can also add new categories directly from the form page like all GLPI dropdowns.
tr_tr: Ayrıca yeni kategoriler, tüm diğer GLPI açılan kutuları gibi doğrudan form sayfasından eklenebilir.
