Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/formcreator/contributing.po
Languages: tr_tr

source: Contributing
tr_tr: Katkıda bulunun

source: Adding new features
tr_tr: Yeni özellikler ekleyin

source: **You are a developer ?**
tr_tr: **Yazılım geliiştiricisi misiniz?**

source: You can help us adding new features by forking the GitHub repository.
tr_tr: GitHub deposu üzerinde bizimle birlikte çalışarak yeni özellikler eklememize yardımcı olabilirsiniz.

source: Develop the new feature on your branch and then, ask for a `pull request <https://github.com/pluginsGLPI/formcreator/pulls>`__ to merge your development into the repository.
tr_tr: Kendi dalınızda yeni özelliği geliştirdikten sonra geliştirdiğiniz yazılımın depoya aktarılması için <https://github.com/pluginsGLPI/formcreator/pulls>`__ adresinden pull isteğinde bulunun.

source: You can also help us debug the `declared issues and requested features <https://github.com/pluginsGLPI/formcreator/issues>`_.
tr_tr: Ayrıca bildirilen <https://github.com/pluginsGLPI/formcreator/issues>`_. adresindeki sorun ve öneriler ile ilgili hataları ayıklamak için de yardımcı olabilirsiniz.

source: **You are not a developer ?**
tr_tr: **Yazılım geliiştiricisi değil misiniz?**

source: You can submit your ideas of new feature by `creating an issue <https://github.com/pluginsGLPI/formcreator/issues>`_ or adding comment on an existing issue (to add explanations or just to say "I'm also interested").
tr_tr: <https://github.com/pluginsGLPI/formcreator/issues>`_ adresinden yeni bir öneride bulunarak fikirlerinizi gönderebilir ya da var olan bir öneri üzerine yorum yapabilirsiniz (açıklamalar ekleyebilir ya da"Ben de istiyorum" diyebilirsiniz).

source: See also the `roadmap <https://github.com/pluginsGLPI/formcreator/milestones>`_
tr_tr: Yol haritasını <https://github.com/pluginsGLPI/formcreator/milestones>`_ adresinden görebilirsiniz.

source: Help us debug
tr_tr: Hataları ayıklamamıza yardımcı olun

source: If you are a developer and want to code the fix yourself, just read the paragraph bellow...
tr_tr: Bir yazılım geliştiricisi iseniz ve kodlardaki hataları düzeltmek istiyorsanız aşağıdaki paragrafı okuyun...

source: But if you are not a developer or don't want to develop fixes yourself, you can still help us by creating `issues <https://github.com/pluginsGLPI/formcreator/issues>`_. Indicate your GLPI and plugin's version and steps to reproduce for a faster and easier fix.
tr_tr: Yazılım geliştiricisi değilseniz ya da yazılım güncellemesi yapmak istemiyorsanız <https://github.com/pluginsGLPI/formcreator/issues>`_ adresinden önerilerde bulunabilirsiniz. Daha kolay düzeltilebilmesi için GLPI ve uygulama ekinizin sürümünü belirterek sorunun görülebilmesi için oluştuğu adımları açıklayın.

source: Documentation
tr_tr: Belgeler

source: You can fork the `documentation repository <https://github.com/pluginsGLPI/doc>`_ to add new contents or fix some issues in existing content.
tr_tr: <https://github.com/pluginsGLPI/doc>`_ adresindeki belgelere yeni içerikler ekleyebilir ya da var olan içeriklerdeki sorunları giderebilirsiniz.

source: Make your changes on your branch and then, ask for a `pull request <https://github.com/pluginsGLPI/doc/pulls>`__) to merge it into the repository.
tr_tr: Değişiklikleri kendi dalınızda yaptıktan sonra depoya aktarılması için <https://github.com/pluginsGLPI/doc/pulls>`__) adresinden pull isteğinde bulunun.

source: Translations
tr_tr: Çeviriler

source: If you want Formcreator to be available in your native language and have a little time, you can help us:
tr_tr: Form Creator uygulama ekini kendi dilinizde kullanabilmek istiyorsanız ve zamanınız kısıtlıysa bize yardımcı olabilirsiniz:

source: Join us on `Transifex <https://www.transifex.com/teclib/glpi-project-plugin-formcreator>`_.
tr_tr: `Transifex <https://www.transifex.com/teclib/glpi-project-plugin-formcreator>`_ üzerinden çeviriye katkıda bulunun.

source: **Current available languages :** Czech (Czech Republic), English (United Kingdom) , French (France), German (Germany), Hungarian (Hungary), Polish (Poland), Portuguese (Brazil), Romanian (Romania), Russian (Russia), Spanish (Argentina), Turkish (Turkey)
tr_tr: **Şu anda kullanılabilen diller :** Çekce (Çek Cumhuriyeti), İngilizce (Birleşik Krallık) , Fransızca (Fransa), Almanca (Almanya), Macarca (Macaristan), Lehçe (Polonya), Portekizce (Brezilya), Romence (Romanya), Rusça (Rusya), İspanyolca (Arjantin), Türkçe (Türkiye)
