Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/formcreator/features.po
Languages: cs_cz, ko_kr, pt_pt, tr_tr, zh_cn

source: Features
cs_cz: Funkce
ko_kr: 특징
pt_pt: Funcionalidades
tr_tr: Özellikler
zh_cn: 功能

source: Direct access to forms self-service interface in main menu,
cs_cz: Přímý přístup z hlavní nabídky do rozhraní s formuláři pro samoobsluhu,
ko_kr: 메인 메뉴 내에서 양식 자체-서비스 인터페이스로의 직접 접근,
pt_pt: Acesso direto a formulários de interface self-service no menu principal,
tr_tr: Ana menüden form yönetim ara yüzüne doğrudan erişim,
zh_cn: 直接访问主菜单中的表单自助服务界面，

source: Highlighting forms in homepages,
cs_cz: Zvýrazňování formulářů na domovských stránkách,
ko_kr: 홈페이지 내에서 양식 강조,
pt_pt: Destacando formulários em homepages,
tr_tr: Ana sayfalardaki formların vurgulanması,
zh_cn: 在主页中突出显示表单，

source: Access to forms controlled: public access, identified user access, restricted access to some profiles,
cs_cz: Přístup k formulářům řízen: veřejný přístup, přístup identifikovaným uživatelům, omezený přístup k některým profilům.
ko_kr: 통제된 양식에 접근: 공개 접근, 확인된 사용자 접근, 일부 프로필들에 대한 제한된 접근,
pt_pt: Acesso a formulários controlados: acesso público, acesso de usuário identificado, acesso restrito a alguns perfis,
tr_tr: Formlara erişim denetimi: Herkese açık, belirli kullanıcı erişimi, bazı profiller için kısıtlı erişim,
zh_cn: 对受控表单的访问：公共访问，识别的用户访问，对某些配置文件的访问受限，

source: Simple and customizable forms,
cs_cz: Jednoduché a přizpůsobitelné formuláře,
ko_kr: 간단하고 맞춤형 양식,
pt_pt: Formulários simples e personalizáveis,
tr_tr: Basit ve uyarlanabilir formlar,
zh_cn: 简单且可定制的表格，

source: Forms organized by categories, entities and languages,
cs_cz: Formuláře uspořádané podle kategorií, entit a jazyků,
ko_kr: 분류 별, 개체 별 그리고 언어 별로 구성된 양식,
pt_pt: Formulários organizados por categorias, entidades e línguas,
tr_tr: Formları kategori, varlık ve dillere göre gruplayabilme,
zh_cn: 按类别，实体和语言组织的表格，

source: Questions of any type of presentation: Textareas, lists, LDAP, files, etc,
cs_cz: Dotazy libovolného typu prezentace: textové oblasti, seznamy, LDAP, soubory, atp.
ko_kr: 모든 유형의 프레젠테이션에 대한 질문: 텍스트에어리어, 목록, LDAP, 파일, 기타등,
pt_pt: Perguntas de qualquer tipo de apresentação: textareas, listas, LDAP, arquivos, etc,
tr_tr: Her tür sunum için sorular: Metin alanları, listeler, LDAP, dosyalar gibi
zh_cn: 任何类型的演示文稿的问题：文字区域，列表，LDAP，文件等，

source: Questions organised in sections. Choice of the display order,
cs_cz: Otázky uspořádané do sekcí. Volba pořadí zobrazení,
ko_kr: 섹션으로 구성된 질문. 표시 순서 선택,
pt_pt: Perguntas organizadas em secções. Escolha da ordem de exibição,
tr_tr: Bölümlere göre gruplanmış sorular. Görüntülenme sırasını seçebilme,
zh_cn: 问题按部分组织。 选择显示顺序，

source: Possibility to display a question based on certain criteria (response to a further question),
cs_cz: Možnost zobrazit otázku v závislosti na určitých kritériích (odpověď na další otázku),
ko_kr: 특정 기준에 의한 질문 표시 가능 (추가 질문에 대한 답변),
pt_pt: Possibilidade de apresentar uma pergunta baseada em determinados critérios (resposta a uma outra questão),
tr_tr: Belirli bir ölçüte göre soru görüntüleme (önceki bir sorunun yanıtına göre),
zh_cn: 是否可以根据某些标准显示问题（对另一个问题的回答），

source: A sharp control on responses from forms: text, numbers, size of fields, email, mandatory fields, regular expressions, etc,
cs_cz: Ostrá kontrola odpovědí z formulářů: text, čísla, velikost kolonek, e-mail, povinné kolonky, regulární výrazy, atd,
ko_kr: 양식에 대한 반응을 미세하게 제어: 텍스트, 숫자, 항목의 크기, 이메일, 필수 항목, 정규식, 기타 등,
pt_pt: Um controle acentuado sobre as respostas das formas: texto, números, tamanho dos campos, e-mail, campos obrigatórios, expressões regulares, etc,
tr_tr: Formlardaki yanıtlara göre kesin denetim: Metin, rakam, alan boyutu, e-posta, zorunlu alanlar, kurallı ifadeler gibi,
zh_cn: 对表单响应的敏锐控制：文本，数字，字段大小，电子邮件，必填字段，正则表达式等，

source: Creation of one or more tickets from form answers,
cs_cz: Vytvoření jednoho nebo více požadavků z odpovědí ve formuláři,
ko_kr: 양식 답변에서의 하나 이상의 티켓 생성,
pt_pt: Criação de um ou mais bilhetes a partir de respostas de formulário,
tr_tr: Form yanıtlarından bir ya da bir kaç destek kaydı oluşturulması,
zh_cn: 从表单结果创建一张或多张工单，

source: Adding a description per fields, per sections, per forms, entities or languages,
cs_cz: Přidání popisu na kolonkách, sekcích, formulářích, entitách nebo jazycích.
ko_kr: 항목 당, 섹션 당, 양식 당, 개체 또는 언어에 상세 내용 추가,
pt_pt: Adicionando uma descrição por campos, por seções, por formulários, entidades ou idiomas,
tr_tr: Her alan, bölüm, form, varlık ya da dil için bir açıklama alanı eklenebilmesi,
zh_cn: 为每个字段，每个部分，每个表单，实体或语言添加描述，

source: Formatting the ticket set: answers to questions displayed, tickets templates,
cs_cz: Formátuje se sada požadavku: odpovědi na otázky zobrazeny, šablony požadavku,
ko_kr: 티켓 설정 양식화: 표시된 질문에 대한 답변, 티켓 견본,
pt_pt: Formatação do conjunto de bilhetes: respostas às perguntas exibidas, modelos de bilhetes,
tr_tr: Destek kaydı kümesi biçimlendirebilme: Görüntülenen soruların yanıtları, destek kaydı kalıpları,
zh_cn: 格式化工单集：显示问题的答复，工单模板，

source: You can take an look to `the full changelog from plugin sources <https://github.com/pluginsGLPI/formcreator/blob/master/CHANGELOG.md>`_.
cs_cz: Je možné se podívat do `úplného seznamu změn, dostupného ve zdrojových kódech zásuvného modulu <https://github.com/pluginsGLPI/formcreator/blob/master/CHANGELOG.md>`_.
ko_kr: `플러그인 원본에서의 전체 변경사항<https://github.com/pluginsGLPI/formcreator/blob/master/CHANGELOG.md>`_ 을 둘러볼 수 있습니다.
pt_pt: Pode ver `o changelog completo a partir de fontes de plugin <https://github.com/pluginsGLPI/formcreator/blob/master/CHANGELOG.md>`_.
tr_tr: Tüm değişikliklerin listesine uygulama eki kaynaklarından bakabilirsiniz <https://github.com/pluginsGLPI/formcreator/blob/master/CHANGELOG.md>`_.
zh_cn: 您可以查看来自插件源的完整更改日志<https://github.com/pluginsGLPI/formcreator/blob/master/CHANGELOG.md>`_。
