Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/formcreator/installation.po
Languages: cs_cz, es_co, ko_kr, pt_br, pt_pt, tr_tr, zh_cn

source: Install the Plugin
cs_cz: Nainstalovat zásuvný modul
es_co: Instalar el complemento
ko_kr: 플러그인 설치
pt_br: Instalar o plugin
pt_pt: Instalar este Plugin
tr_tr: Uygulama ekini kurmak
zh_cn: 安装插件

source: Uncompress the archive.
cs_cz: Rozbalte archiv.
es_co: Descomprimir el archivo.
ko_kr: 아카이브를 압축해제 합니다.
pt_br: Descompacte o arquivo.
pt_pt: Descompactar o arquivo.
tr_tr: Arşivi ayıklayın.
zh_cn: 解压缩存档。

source: Move the ``formcreator`` directory to the ``<GLPI_ROOT>/plugins`` directory
cs_cz: Přesunout složku ``formcreator`` do složky ``<GLPI_ROOT>/plugins``
es_co: Mueva el directorio ``formcreator`` al directorio `` <GLPI_ROOT>/plugins``
ko_kr: ``formcreator`` 디렉토리를 ``<GLPI_ROOT>/plugins`` 디렉토리로 이동
pt_br: Mova o diretório ``formcreator`` para o diretório ``<GLPI_ROOT>/plugins``
pt_pt: Mova o diretório ‘’formcreator’’ para o diretório ‘’<GLPI_ROOT>/plugins‘’</GLPI_ROOT>
tr_tr: ``formcreator`` klasörünü ``<GLPI_ROOT>/plugins`` klasörüne taşıyın
zh_cn: 将``formcreator``目录直接移动到``<GLPI_ROOT>/plugins``目录下

source: Navigate to the *Configuration > Plugins* page,
cs_cz: Přejděte na stránku *Nastavení > Zásuvné moduly*,
es_co: Navega a la página *Configuraciones > complementos*,
ko_kr: *Configuration > Plugins* 페이지로 이동해서,
pt_br: Navegar à pagina *Configuração > Plugins*,
pt_pt: Navegue até à página * configuração > plugins *,
tr_tr: *Yapılandırma > Uygulama ekleri* bölümüne gidin.
zh_cn: 导航到* Configuration> Plugins *页面，

source: Install and activate the plugin.
cs_cz: Nainstalujte a zapněte zásuvný modul
es_co: Instalar y activar el complemento.
ko_kr: 플러그인을 설치하고 활성화 합니다.
pt_br: Instalar e ativar o plugin
pt_pt: Instale e ative o plugin.
tr_tr: Uygulama ekini kurup etkinleştirin.
zh_cn: 安装并激活插件。

source: The plugin's directory must have the same name as the plugin:
cs_cz: Je třeba, aby se složka zásuvného modulu jmenovala stejně, jako zásuvný modul:
es_co: El directorio del complemento debe tener el mismo nombre que el complemento:
ko_kr: 플러그인 디렉토리는 플러그인과 같은 이름을 써야 합니다:
pt_br: O diretório de plugin deve ter o mesmo nome do plugin:
pt_pt: O diretório do plugin deve ter o mesmo nome que o plugin:
tr_tr: Uygulama ekinin klasörü uygulama eki ile aynı adı taşımalıdır:
zh_cn: 插件的目录必须与插件的名称相同：

source: **Good**: `glpi/plugins/formcreator`
cs_cz: **Dobré**: `glpi/plugins/formcreator`
es_co: **Bueno**: `glpi/plugins/formcreator`
ko_kr: **좋음**: `glpi/plugins/formcreator`
pt_br: **Ótimo**: `glpi/plugins/formcreateor`
pt_pt: **Certo**: `glpi/plugins/formcreator`
tr_tr: **Doğru**: `glpi/plugins/formcreator`
zh_cn: **正确**: `glpi/plugins/formcreator`

source: **Bad**: `glpi/plugins/formcreator-master`
cs_cz: **Špatné**: `glpi/plugins/formcreator-master`
es_co: **Malo**: `glpi/plugins/formcreator-master`
ko_kr: **나쁨**: `glpi/plugins/formcreator-master`
pt_br: **Ruim**: `glpi/plugins/formcreator-master`
pt_pt: **ERRADO**: `glpi/plugins/formcreator-master`
tr_tr: **Yanlış**: `glpi/plugins/formcreator-master`
zh_cn: **错误**: `glpi/plugins/formcreator-master`

source: **Bad**: `glpi/plugins/formcreator-0.90-1.3.2`
cs_cz: **Špatné**: `glpi/plugins/formcreator-0.90-1.3.2`
es_co: **Malo**: `glpi/plugins/formcreator-0.90-1.3.2`
ko_kr: **나쁨**: `glpi/plugins/formcreator-0.90-1.3.2`
pt_br: **Ruim**: `glpi/plugins/formcreator-0.90-1.3.2`
pt_pt: **ERRADO**: `glpi/plugins/formcreator-0.90-1.3.2`
tr_tr: **Yanlış**: `glpi/plugins/formcreator-0.90-1.3.2`
zh_cn: **错误**: `glpi/plugins/formcreator-0.90-1.3.2`

source: Only one directory must contains the plugin's files of a single plugin in the GLPI plugins directory. **Don't rename the plugin's directory for backup, move it!**
cs_cz: Je třeba, aby se soubory jednoho zásuvného modulu nacházely pouze v jediné podsložce složky plugins v GLPI. **Nezálohujte složku zásuvného modulu přejmenováním, přesuňte ji!**
es_co: Solo un directorio debe contener los archivos del complemento de un solo complemento en el directorio de complementos de GLPI. ** ¡No renombre el directorio del complemento para la copia de seguridad, muévalo! **
ko_kr: 하나의 디렉토리만 GLPI 플러그인 디렉토리 내에 단일 플러그인의 플러그인 파일들을 포함해야 합니다. **백업용으로 플러그인의 디렉토리의 이름을 변경하지 말고, 이동하세요!**
pt_br: Apenas um diretório deve conter os arquivos de plugin de no diretório de plugins do GLPI. **Não renomeie o diretório do plugin para backup, mova-o!**
pt_pt: Apenas um diretório deve conter os arquivos do plugin de um único plugin no diretório de plugins GLPI. * * Não renomeie o diretório do plugin para backup, mova-o! * *
tr_tr: Bir uygulama ekinin dosyaları için GLPI plugins klasöründe yalnız bir klasör bulunmalıdır. **Yedeklemek için bir uygulama eki klasörünün adını değiştirmeyin, kopyalayıp silin!**
zh_cn: 只有一个目录必须包含GLPI插件目录中单个插件的插件文件。 **不要重命名插件的目录以进行备份，移动它！**

source: Creative Commons License
cs_cz: Licence Creative Commons
