Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/formcreator/targets.po
Languages: cs_cz, tr_tr

source: Targets
cs_cz: Cíle
tr_tr: Hedefler

source: Targets are objects generated by FormCreator submission. If a form requires validation, the targets are delayed until approbation.
cs_cz: Cíle jsou objekty vytvořené podáním vytváření formulářů. Pokud formulář vyžaduje ověření, cíle jsou pozdrženy do schválení.
tr_tr: Hedefler FormCreator üzerinden yapılan gönderimlerde oluşturulan nesnelerdir. Bir formun doğrulanması gerekiyorsa, hedefler onay alınana kadar geciktirilir.

source: Targets are currently tickets only.
cs_cz: Cíle jsou v současnosti pouze požadavky.
tr_tr: Hedefler şu anda yalnız destek kayıtları olabilir.

source: A target ticket defines the ticket generated by the form. You may have several targets per form.
cs_cz: Cílový požadavek určuje požadavek vytvořený formulářem. V jednom formuláři je možné mít několik cílů.
tr_tr: Bir hedef destek kaydı form tarafından oluşturulan destek kaydını belirtir. Bir formun bir kaç hedefi olabilir.

source: Open the tab `Destination` and create a target with a name and a type (currently ticket only).
cs_cz: Otevřete kartu `Cíl` a vytvořte cíl s názvem a typem (nyní pouze požadavek).
tr_tr: `Hedef` sekmesini açın ve bir ad ve tür seçerek bir hedef oluşturun (yalnız geçerli destek kaydı için).

source: Target ticket
cs_cz: Cíl požadavek
tr_tr: Hedef destek kaydı

source: A target ticket generates a ticket.
cs_cz: Cíl požadavek vygeneruje požadavek.
tr_tr: Bir destek kaydı oluşturan bir hedef destek kaydı.

source: The ticket is build from scratch or from a ticket template available in GLPI. You may
cs_cz: Požadavek byl vytvořen ze šablony nebo ze šablony požadavku dostupné v GLPI. Můžeš
tr_tr: Destek kaydı, sıfırdan ya da GLPI üzerinde bulunan bir destek kaydı kalıbından oluşturulur. Şunları yapabilirsiniz:

source: customize the name of the target ticket to distinguish it from possible other targets,
cs_cz: upravit název cílového požadavku, aby se odlišil od možných jiných požadavků,
tr_tr: Diğer olası hedeflerden ayırt etmek için hedef destek kaydının adını özelleştirebilirsiniz,

source: customize the title and description of the ticket using questions and answers,
cs_cz: upravit název a popis požadavku pomocí otázek a odpovědí,
tr_tr: Soruları ve yanıtları kullanarak destek kaydının başlığını ve açıklamasını özelleştirebilirsiniz,

source: set tne destination entity of the generated ticket,
cs_cz: nastavit cílovou entitu generovaného požadavku,
tr_tr: Oluşturulan destek kaydının hedef birimini ayarlayabilirsiniz,

source: set a time to resomve (formerly due date),
cs_cz: nastavit čas k odstranění (dříve datum platnosti),
tr_tr: Bir çözümlenme süresi ayarlayabilirsiniz (önceki adıyla bitiş tarihi),

source: set the type of ticket (request or incident),
cs_cz: nastavit typ požadavku (žádost nebo porucha),
tr_tr: Destek kaydının türünü ayarlayabilirsiniz (istek ya da sorun olarak),

source: set the associated elements,
cs_cz: nastavit přiřazené prvky,
tr_tr: İlişkili bileşenleri ayarlayabilirsiniz,

source: set the category,
cs_cz: nastavit kategorii,
tr_tr: Kategoriyi ayarlayabilirsiniz,

source: set the urgency,
cs_cz: nastavit naléhavost,
tr_tr: Önem derecesini ayarlayabilirsiniz,

source: set the location,
cs_cz: nastavit umístění,
tr_tr: Konumu ayarlayabilirsiniz,

source: assign tags to the ticket if the plugin `Tags` is available,
cs_cz: přiřadit štítek k požadavku pokud je zásuvný modul 'Štítky' k dispozici,
tr_tr: `Tags` uygulama eki kullanılabiliyorsa destek kaydına etiketler atayabilirsiniz,

source: link the generated ticket to other tickets
cs_cz: spojit vygenerovaný požadavek s jiným požadavkem
tr_tr: Oluşturulan destek kaydını başka destek kayıtları ile ilişkilendirebilirsiniz,

source: define actors of the ticket.
cs_cz: definovat aktéry požadavku.
tr_tr: Destek kaydının aktörlerini belirleyebilirsiniz,

source: define conditions to meet to generate the target ticket
cs_cz: definovat podmínky, které je třeba splnit pro vygenerování cílového požadavku
tr_tr: Hedef destek kaydını oluşturmak için karşılanması gereken ölçütleri belirleyebilirsiniz.

source: Setting an urgency, a category or a location (specific or from a question) overrides the urgency defined in a ticket template (if any)
cs_cz: Nastavení naléhavosti, kategorie nebo místa (konkrétního nebo z otázky) přepíše naléhavost definovanou v šabloně požadavku (pokud existuje)
tr_tr: Önem derecesi, kategori ya da konum (belirli ya da bir sorudan) ayarlamak, bilet kalıbında (varsa) tanımlanan önem derecesini değiştirir

source: Destination entity
cs_cz: Cílová entita
tr_tr: Hedef birim

source: Many choices are avaialble:
cs_cz: K dispozici je mnoho možností:
tr_tr: Kullanılabilecek pek çok seçenek var:

source: Current active entity: the entity of the requester who fills a form,
cs_cz: Aktuální aktivní entita: entita žadatele, který vyplní formulář,
tr_tr: Geçerli etkin birim: Formu doldurarak istekte bulunan kişinin birimi,

source: Default requester's entity: the default entity defined for the user who fills the form,
cs_cz: Výchozí entita žadatele: výchozí entita definovaná pro uživatele, který vyplní formulář,
tr_tr: Varsayılan istekte bulunanın birimi: Formu doldurarak istekte bulunan kullanıcının varsayılan birimi,

source: First dynamic requester's entity (alphabetical): sorts all dynamic entities of the requester alphabetically and selects the first one,
cs_cz: První dynamická entita žadatele (abecedně): seřadí všechny dynamické entity žadatele podle abecedy a vybere první z nich,
tr_tr: İlk devingen istekte bulunan kişinin birimi (alfabetik): İstekte bulunan kişinin tüm devingen birimlerini alfabetik olarak sıralar ve ilkini seçer,

source: Last dynamic requester's entity (alphabetical): sorts all dynamic entities of the requester alphabetically and selects the last one,
cs_cz: Poslední dynamická entita žadatele (abecedně): seřadí všechny dynamické entity žadatele podle abecedy a vybere poslední z nich,
tr_tr: Son devingen istekte bulunan kişinin birimi (alfabetik): İstekte bulunan kişinin tüm devingen birimlerini alfabetik olarak sıralar ve sonuncusunu seçer,

source: The form's entity: the entity where is located the form being filled by the requester,
cs_cz: Entita formuláře: entita, kde se nachází formulář vyplněný žadatelem,
tr_tr: Formun birimi: İstekte bulunan kişi tarafından doldurulan formun bulunduğu birim,

source: Default entity of the validator: the default entity of the validator who validates the request,
cs_cz: Výchozí entita schvalovatele: výchozí entita schvalovatele, který schvaluje požadavek,
tr_tr: Doğrulayıcının varsayılan birimi: İsteği doğrulayan kişinin varsayılan birimi,

source: Specific entity: an entity set by the form's designer,
cs_cz: Konkrétní entita: entita nastavená návrhářem formuláře,
tr_tr: Belirli birim: Formun tasarımcısı tarafından ayarlanan bir birim,

source: Default entity of a user type question answer: the default entity of a user choosen by the requester in a question.
cs_cz: Výchozí entita uživatelského typu odpověď na otázku: výchozí entita uživatele zvoleného žadatelem v otázce.
tr_tr: Bir kullanıcı türü soru yanıtının varsayılan birimi: Bir soruda istekte bulunan kişi tarafından seçilen bir kullanıcının varsayılan birimi.

source: From a GLPI object > Entity type question answer: the entity choosen by the requester from a question.
cs_cz: Z objektu GLPI > Odpověď na otázku typu entity: entita vybraná žadatelem z otázky.
tr_tr: Bir GLPI nesnesinden > Birim türü sorusunun yanıtı: İstekte bulunan kişi tarafından bir sorudan seçilen birim.

source: Default requester's entity may be not set, then there is a risk to generate tickets in the root entity.
cs_cz: Výchozí entita žadatele nemusí být nastavena, pak existuje riziko generování požadavků v kořenové entitě.
tr_tr: İstekte bulunan kişinin varsayılan birimi ayarlanmamış olabilir. Bu durumda destek kayıtlarının kök birimde oluşturulma riski vardır.

source: Default entity of the validator may be not set, then there is a risk to generate tickets in the root entity.
cs_cz: Výchozí entita schvalovatele nemusí být nastavena, pak existuje riziko generování požadavků v kořenové entitě.
tr_tr: Doğrulayan kişinin varsayılan birimi ayarlanmamış olabilir. Bu durumda destek kayıtlarının kök birimde oluşturulma riski vardır.

source: Dynamic requester's entity requires user synchronization, then there is a risk to generate tickets in the root entity.
cs_cz: Dynamická entita žadatele vyžaduje synchronizaci uživatele, jinak existuje riziko generování požadavků v kořenové entitě.
tr_tr: Devingen istekte bulunan kişinin birimi. Kullanıcı eşitlemesi gerekir. Bu durumda destek kayıtlarının kök birimde oluşturulma riski vardır.

source: Ticket template
cs_cz: Šablona požadavku
tr_tr: Destek kaydı kalıbı

source: Sets predefined setings for the ticket from a template. All settings defined in the target ticket will override the values found in the template.
cs_cz: Nastaví předdefinovaná nastavení pro požadavek ze šablony. Všechna nastavení definovaná v cílovém požadavku přepíší hodnoty nalezené v šabloně.
tr_tr: Bir kalıptan destek kaydı oluşturmak için hazır ayarları belirler. Hedef destek kaydında belirlenen tüm ayarlar, kalıpta bulunan değerleri değiştirir.

source: Request type
cs_cz: Typ požadavku
tr_tr: İstek türü

source: Sets the type of the generated ticket
cs_cz: Nastavuje typ generovaného požadavku
tr_tr: Oluşturulan destek kaydının türünü ayarlar

source: Default or from a template: value set by GLPI when no type is set, or from a template, if any and if this template defiines a type
cs_cz: Výchozí nebo ze šablony: hodnota nastavená pomocí GLPI, když není nastaven žádný typ, nebo ze šablony, pokud existuje a pokud tato šablona definuje typ
tr_tr: Varsayılan ya da bir kalıptan: Herhangi bir tür ayarlanmadığında GLPI tarafından ya da varsa bir kalıptan ve ayarlanmışsa bu kalıptaki tür değerinden

source: Specific type: either request or incident,
cs_cz: Konkrétní typ: žádost nebo porucha,
tr_tr: Belirli tür: İstek ya da sorun,

source: Equals to the answer to the question: the value is set from a request type question.
cs_cz: Rovná se odpovědi na otázku: hodnota je nastavena z otázky na typ požadavku.
tr_tr: Sorunun yanıtına eşittir: Değer, bir istek türü sorusundan ayarlanır.

source: Associated elements
cs_cz: Přiřazené prvky
tr_tr: İlişkili bileşenler

source: Sets associated elements to the generated ticket
cs_cz: Nastaví přiřazené prvky ke generovanému požadavku
tr_tr: Oluşturulan destek kaydının ilişkili bileşenlerini ayarlar

source: None : self explanatory, Specific asset: an asset set by the designer of the form, Equals to the answer to a question: an asset set by the requester, from a question Last valid answer: an asset set by the requester, from the last visible question eligible for this purpose
cs_cz: Žádné : samovysvětlující, Specifické aktivum: aktivum nastavené návrhářem formuláře, Rovná se odpovědi na otázku: aktivum nastavené žadatelem, z otázky Poslední platná odpověď: aktivum nastavené žadatelem, od poslední viditelné otázky vhodné pro tento účel
tr_tr: Yok : Açıklamak gerekmez, Belirli varlık: Formun tasarımcısı tarafından ayarlanan bir varlık, Bir sorunun yanıtına eşittir: İstekte bulunan kişi tarafından, bir sorudan ayarlanan bir varlık Son geçerli yanıt: İstekte bulunan kişi tarafından ayarlanan bir varlık. Bu amaç için uygun olan son görünür sorudan

source: Category
cs_cz: Kategorie
tr_tr: Kategori

source: Sets the category of the generated ticket
cs_cz: Nastaví kategorii generovaného požadavku
tr_tr: Oluşturulan destek kaydının kategorisini ayarlar

source: Category fro template or none: sets the category from a template if any and if this template has a predefined category. None in all other cases,
cs_cz: Kategorie pro šablonu nebo žádná: nastaví kategorii ze šablony, pokud existuje a pokud má tato šablona předdefinovanou kategorii. Žádná ve všech ostatních případech,
tr_tr: Kalıptan kategori ya da yok: Varsa ve bu kalıbın hazır bir kategorisi varsa bir kalıptan kategoriyi ayarlar. Diğer tüm durumlarda yok,

source: Specific category: a category set by the form's designer,
cs_cz: Specifická kategorie: kategorie nastavená návrhářem formuláře,
tr_tr: Belirli kategori: Formun tasarımcısı tarafından ayarlanan bir kategori,

source: Equals to the answer to a question: a category choosen by the requester,
cs_cz: Odpovídá odpovědi na otázku: kategorie zvolená žadatelem,
tr_tr: Bir sorunun yanıtına eşittir: İstekte bulunan kişi tarafından seçilen bir kategori,

source: lastr valid answer: a category from the last visible question of type category,
cs_cz: poslední platná odpověď: kategorie z poslední viditelné otázky kategorie typu,
tr_tr: Son geçerli yanıt: Kategori türünde görüntülenen son sorudan bir kategori,

source: Urgency
cs_cz: Naléhavost
tr_tr: Önem derecesi

source: Urgency fro template or none: sets the urgency from a template if any and if this template has a predefined urgency. None in all other cases,
cs_cz: Naléhavost ze šablony nebo žádná: nastaví naléhavost ze šablony, pokud existuje a má-li tato šablona předdefinovanou naléhavost. Žádná ve všech ostatních případech,
tr_tr: Kalıptan önem derecesi ya da yok: Varsa ve bu kalıbın hazır bir önem derecesi varsa bir kalıptan önem derecesini ayarlar. Diğer tüm durumlarda yok,

source: Specific urgency: an urgency set by the form's designer
cs_cz: Specifická naléhavost: naléhavost nastavená návrhářem formuláře
tr_tr: Belirli önem derecesi: Formun tasarımcısı tarafından ayarlanan bir önem derecesi,

source: Location
cs_cz: Umístění
tr_tr: Konum

source: Specific location: a location set by the form's designer
cs_cz: Specifické umístění: umístění nastavené návrhářem formuláře
tr_tr: Belirli konum: Formun tasarımcısı tarafından ayarlanan bir konum,

source: Condition to show the target
cs_cz: Podmínka pro zobrazení cíle
tr_tr: Hedefi görüntüleyecek koşul

source: The form's designer may restrict creation of the ticket depending on conditions.
cs_cz: Návrhář formuláře může omezit vytvoření tiketu v závislosti na podmínkách.
tr_tr: Form tasarımcısı, koşullara bağlı olarak destek kaydının oluşturulmasını kısıtlayabilir.

source: Target change
cs_cz: Cíl změna
tr_tr: Hedef değişikliği

source: A target change generates a change
cs_cz: Cíl změna generuje změnu
tr_tr: Bir değişiklik oluşturan bir hedef değişikliği

source: The change is built from scratch. You may
cs_cz: Změna je postavena od nuly. Můžeš
tr_tr: Değişiklik sıfırdan oluşturulur. Şunları yapabilirsiniz:

source: customize the title, description, imapct, control list, deployment path, backup plan and checklist fields using questions and answers,
cs_cz: přizpůsobit pole nadpisu, popisu, dopad, kontrolní seznam, plán nasazení, plán zálohování a kontrolní/řídící seznam pomocí otázek a odpovědí,
tr_tr: Soru ve yanıtları kullanarak başlık, açıklama, etki, kontrol listesi, dağıtım yolu, yedekleme planı ve kontrol listesi alanlarını özelleştirebilirsiniz,

source: set the urgency from a value or a question
cs_cz: nastavit naléhavost z hodnoty nebo otázky
tr_tr: Bir değerden ya da bir sorudan önem derecesini ayarlayabilirsiniz,

source: choose the entity of the change among many policies
cs_cz: vybrat entitu změny z mnoha pravidel
tr_tr: Birkaç ilke arasından değişikliğin birimini seçebilirsiniz,

source: set the time to resolve
cs_cz: nastavit čas k vyřešení
tr_tr: Çözümlenme zamanını ayarlayabilirsiniz,

source: define the actors of the change
cs_cz: definovat aktéry změny
tr_tr: Değişiklik aktörlerini belirleyebilirsiniz,

source: set the category of the change
cs_cz: nastavit kategorii změny
tr_tr: Değişiklik kategorisini ayarlayabilirsiniz.
