Repository: pluginsGLPI/doc
Catalog: source/locale/*/LC_MESSAGES/datainjection/index.po
Languages: cs_cz, tr_tr

source: Datainjection
cs_cz: Import dat
tr_tr: Veri içe aktarma

source: Download
tr_tr: İndir

source: Sources
tr_tr: Kaynaklar

source: Requirements (on-premise)
tr_tr: Gereksinimler (özel kurulum)

source: GLPI Version
tr_tr: GLPI sürümü

source: Minimum PHP
tr_tr: En düşük PHP sürümü

source: Recommended
tr_tr: Önerilen

source: Plugin installation
tr_tr: Eklentiyi kurmak

source: Go to the marketplace. Download and install the plugin **Data Injection**
tr_tr: Mağazaya gidin. **Veri içe aktarma** eklentisini indirip kurun.

source: install the plugin
tr_tr: Eklentiyi kurmak

source: Rights management
tr_tr: İzin yönetimi

source: Once the plugin has been installed via the marketplace, you can configure rights according to profile:
tr_tr: Eklentiyi market üzerinden kurduktan sonra, profile göre izinleri yapılandırabilirsiniz:

source: From **Administration > Profiles**, select the profile in question
tr_tr: **Yönetim > Profiller** bölümünden söz konusu profili seçin

source: Go to **Data injection**
tr_tr: **Veri içe aktarma** bölümüne gidin

source: For each user profile, you can grant the following rights:
tr_tr: Her kullanıcı profili için aşağıdaki izinleri verebilirsiniz:

source: **Model management** : Read / Update / Create / Purge
tr_tr: **Model yönetimi** : Okuma / Güncelleme / Ekleme / Silme

source: **Import file** : Read
tr_tr: **Dosya içe aktar** : Okuma

source: Configuration
cs_cz: Nastavení
tr_tr: Yapılandırma

source: You can find the plugin configuration at **Tools > Data injection** The extension is presented in the form of a wizard, each operation is broken down into steps and it is possible to return to the previous step to correct a choice.
tr_tr: Eklenti yapılandırmasını **Araçlar > Veri içe aktarma** adresinde bulabilirsiniz. Eklenti bir yardımcı olarak sunulur. Her işlem adımlara ayrılır ve bir seçimi düzeltmek için bir önceki adıma geri dönülebilir.

source: Managing or using a model
tr_tr: Bir modeli yönetmek veya kullanmak

source: The first step allows you to choose the operation to be carried out, depending on your rights.
tr_tr: İlk adımda izinlerinize bağlı olarak hangi işlemin yapılacağını seçebilirsiniz.

source: Use an existing template in the drop-down menu
tr_tr: Açılır menüden var olan bir kalıbı kullanmak

source: Manage templates to :
tr_tr: Kalıp yönetimi:

source: Create a new template
tr_tr: Yeni bir kalıp oluşturmak

source: Modify an existing template
tr_tr: Var olan bir kalıbı değiştirmek

source: Delete an existing template
tr_tr: Var olan bir kalıbı silmek

source: Use an existing template
tr_tr: Var olan bir kalıbı kullanmak

source: Creating a template
tr_tr: Bir kalıp oluşturmak

source: The first step is to create a template if none exists.
tr_tr: İlk adım, herhangi bir kalıp yoksa bir kalıp oluşturmaktır.

source: From **Tools > Data injection**
tr_tr: **Araçlar > Veri içe aktarma** bölümüne gidin

source: Click on **Template**
tr_tr: **Kalıp** üzerine tıklayın

source: Click on **Add**
tr_tr: **Ekle** üzerine tıklayın

source: add template
tr_tr: Kalıbı ekleyin

source: Defining the model
tr_tr: Model tanımlamak

source: This step allows you to define the main options for the extension:
tr_tr: Bu adım, eklentinin temel seçeneklerini tanımlamanızı sağlar:

source: **Name**: the name that will be visible from the drop-down list
tr_tr: **Ad**: Açılır listede görüntülenecek ad

source: **Visibility**: defines whether it will be visible to other users or not
tr_tr: **Görünürlük**: Diğer kullanıcılar tarafından görülüp görülmeyeceği

source: **Entity** and **sub-entity**: the template can be visible in the creation entity only (sub-entity set to no) or in the entity and all sub-entity (sub-entity set to yes).
tr_tr: **Varlık** ve **Alt varlık**: Kalıp yalnızca oluşturulduğu varlıkta (alt varlık ayarı hayır) ya da varlık ve tüm alt varlıklarında (alt varlık ayarı evet) görülebilir.

source: **Comment**: a comment for the template.
tr_tr: **Açıklama**: Kalıp ile ilgili açıklamalar.

source: **Type of data to import**: the type of data present in the file to be imported. A file only consists of data of the same type.
tr_tr: **İçe aktarılacak veri türü**: İçe aktarılacak dosyada bulunan veri türü. Bir dosya yalnızca aynı türdeki verilerden oluşur.

source: **Allow lines creation**: tells the plugin to create objects if the line does not correspond to an existing element in the database.
tr_tr: **Satırlar eklenebilsin**: Eklentiye, satırdaki veri, veri tabanında var olan bir bileşene karşılık gelmiyorsa nesneyi eklemesini belirtir.

source: **Allow update rows**: tells the plugin to modify existing objects using the data in the file.
tr_tr: **Satır güncellenebilsin**: Eklentiye, dosyadaki verileri kullanarak var olan nesneleri değiştirmesini belirtir.

source: **Header’s presence**: tells the plugin whether the headings present in the file (location, type of equipment, models, etc.) should be created. Creation will also be limited by the rights of the template user.
tr_tr: **Başlığın varlığı**: Eklentiye, dosyada başlık bulunup bulunmadığını (konum, aygıt türü, model, vb.) belirtir. Ekleme ayrıca kalıp kullanıcısının izinleriyle de sınırlıdır.

source: **Update existing fields**: the extension whether the data in the file can replace fields already filled in.
tr_tr: **Var olan alanlar güncellensin**: Eklentiye, dosyadaki verilerin daha önce doldurulmuş alanları değiştirip değiştirmeyeceğini belirtir.

source: **Date format**: the date format is contained in the CSV file. If the format is incorrect, the date cannot be imported.
tr_tr: **Tarih biçimi**: CSV dosyasında bulunan tarih biçimi. Biçim yanlışsa, tarih içe aktarılamaz.

source: **Decimal number format**: the format used for the numbers in the CSV file. If the format is incorrect, the numbers cannot be imported.
tr_tr: **Ondalık sayı biçimi**: CSV dosyasında kullanılan sayı biçimi. Biçim yanlışsa, sayılar içe aktarılamaz.

source: **After validation of the model**, the following fields are added:
tr_tr: **Model doğrulandıktan sonra** şu alanlar eklenir:

source: **Presence of a header**: indicates whether the first line of the CSV file is a header line, so that you can see the contents of the columns to identify the contents of the columns
tr_tr: **Başlığın varlığı**: CSV dosyasının ilk satırının başlık satırı olup olmadığını belirtir. Böylece içeriği belirleyerek sütunların içeriğini görebilirsiniz

source: **File delimiter**: field separator (by default a semicolon)
tr_tr: **Dosya ayracı**: Alan ayracı (varsayılan olarak noktalı virgül)

source: File to be injected
tr_tr: İçe aktarılacak dosya

source: From the **File to inject** tab, you need to choose a file on your computer with exactly the same structure as the data already imported.
tr_tr: **İçe aktarılacak dosya** sekmesinden, bilgisayarınızda içe aktarılmış verilerle aynı yapıda bir dosya seçmelisiniz.

source: Then define the **encoding** (ISO8859-1 for Windows files, UTF-8 for Linux files. Automatic detection can be used to determine the encoding, but will slow down file processing. We strongly recommend that you always work in UTF-8.)
tr_tr: Ardından **kodlamayı** belirtin (Windows dosyaları için ISO8859-1, Linux dosyaları için UTF-8. Kodlamayı belirlemek için otomatik algılama kullanılabilir. Ancak dosyanın işlenmesi yavaşlar. Her zaman UTF-8 kullanmanızı önemle öneririz.)

source: Once the file has been validated, you will be taken to the **Mappings** tab
tr_tr: Dosya doğrulandıktan sonra **Eşleştirmeler** sekmesine yönlendirileceksiniz

source: Mappings
tr_tr: Eşleştirmeler

source: This stage is essential. It defines, for each column in the file, the corresponding field in the database. The columns are identified by the content of the header line (presence defined in the previous step) or by their position (starting from 0). A separator error (in the previous step) will result in an incorrect split. The **View file** button is used to preview the first lines of the file and check their content and the interpretation made by the plugin.
tr_tr: Bu aşama önemlidir. Dosyadaki her sütuna veri tabanındaki karşılık gelen alanı belirler. Sütunlar, başlık satırının içeriğiyle (önceki adımda tanımlanan varlık) veya konumlarıyla (0 ile başlayarak) tanımlanır. Bir ayraç hatası (önceki adımda) verinin yanlış bölünmesine neden olur. **Dosyayı görüntüle** düğmesi, dosyanın ilk satırlarını ön izlemek ve içerikleri ile eklenti tarafından yapılan yorumu kontrol etmek için kullanılır.

source: For each column, you can choose
tr_tr: Her sütun için şunları seçebilirsiniz:

source: **Do not retrieve data from this column** (leave the **Choose a table** option)
tr_tr: **Bu sütundan veri alınmasın** (**Bir tablo seçin** seçeneğini bırakın)

source: **Choose a table**: the data type defined in step 2 or the financial information
tr_tr: **Bir tablo seçin**: 2. adımda tanımlanan veri türü veya mali bilgiler tablosu

source: **Choose a field**: which will be populated by the import
tr_tr: **Bir alan seçin**: İçe aktarma tarafından doldurulacak alan

source: **Link field**: to indicate that this column will be used to check the existence of the data in the database and to choose between creating a new object or update. Candidate fields are, for example, the **Serial number**, the **Name** or the **Inventory number**
tr_tr: **Bağlantı alanı**: Bu sütunun veri tabanındaki verilerin varlığını kontrol etmek ve yeni bir nesne oluşturmak ya da güncellemek arasında seçim yapılmasını sağlar. Aday alan örnekleri, **Seri numarası**, **Ad** veya **Envanter numarası**

source: It is mandatory to define at least 1 linking field. If a field is checked, it must be entered in your **csv** file used for importing.
tr_tr: En az 1 bağlantı alanı tanımlanması zorunludur. Bir alan işaretlenmişse, içe aktarma için kullanılan **CSV** dosyanızda bulunması gerekir.

source: match the fields
tr_tr: Alanları eşleştirin

source: It is possible to define **Comments** or **Notes** as the destination for several columns in the file. Each column will be added to the field on a different line. This step is particularly important and a wrong choice could damage the inventory data. It is therefore advisable to test the import on a test database or to and reserve this function for advanced users.
tr_tr: Dosyadaki birkaç sütun için hedef olarak **Açıklamalar** veya **Notlar** tanımlanabilir. Her sütun alana farklı bir satırda eklenecektir. Bu adım özellikle önemlidir ve yanlış bir seçim envanter verilerine zarar verebilir. Bu nedenle içe aktarmayı bir deneme veri tabanında sınamanız ya da bu özelliği kullanmayı deneyimli kullanıcılara bırakmanız önerilir.

source: Additional information
tr_tr: Ek bilgiler

source: This step is used to define the fields that can/should be populated by the user when a file is injected. For each field, the same value will be used for each line of the file and will take precedence over the contents of the file.
tr_tr: Bu adım, bir dosya içe aktarıldığında kullanıcı tarafından doldurulabilecek/doldurulması gereken alanları tanımlamak için kullanılır. Her alan için, dosyanın her satırı için aynı değer kullanılır ve dosyanın içeriklerine göre öncelik kazanır.

source: **Table**: the data type defined in step **Matching**
tr_tr: **Tablo**: **Eşleştirme** adımında tanımlanan veri türü

source: **Field**: will be populated by the import
tr_tr: **Alan**: İçe aktarma tarafından doldurulacak alan

source: **Mandatory information**: whether model user input is mandatory or optional
tr_tr: **Zorunlu bilgiler**: Model kullanıcı girişinin zorunlu mu yoksa isteğe bağlı mı olduğu

source: Example of use :
tr_tr: Kullanım örneği:

source: Purchase date when importing a delivery note
tr_tr: Bir teslimat notunu içe aktarırken satın alma tarihi

source: Comments to define a criterion that can be used in the search engine (e.g. IMPORT ON 31/10)
tr_tr: Arama motorunda kullanılabilecek bir ölçütü tanımlayan yorumlar (örneğin 31/10 İÇE AKTARIM)

source: Model validation
tr_tr: Model doğrulaması

source: From the Validation tab, you can confirm the registration. It is still possible to return to the previous steps to check and correct certain options.
tr_tr: Doğrulama sekmesinden kaydı onaylayabilirsiniz. Belirli seçenekleri kontrol etmek ve düzeltmek için önceki adımlara geri dönebilirsiniz.

source: template validation
tr_tr: Kalıp doğrulaması

source: If you are working with a sub-entity, you must select the desired entity before importing.
tr_tr: Bir alt varlıkla çalışıyorsanız, içe aktarma işleminden önce istediğiniz varlığı seçmelisiniz.

source: Some fields in your CSV file will need to be filled in as Booleans. This is the case, for example, with double-choice fields, such as: “Ports” (serial/parallel/USB) for printers. Instead of entering **Yes | No** in your CSV, enter **1 | 0** as appropriate. If these values are not changed, you will see an error in the report indicating that the wrong type of data has been entered.
tr_tr: CSV dosyanızdaki bazı alanların Boolean olarak doldurulması gerekir. Bunlar, örneğin yazıcılar için "Bağlantı noktaları" (seri/paralel/USB) gibi çift seçenekli alanlarda geçerlidir. CSV dosyanıza **Evet | Hayır** yazmak yerine, uygun şekilde **1 | 0** yazın. Bu değerler değiştirilmezse, raporda yanlış türde veri bulunduğunu belirten bir hata görürsünüz.

source: Using a template
tr_tr: Bir kalıp kullanmak

source: Choosing a template
tr_tr: Bir kalıp seçmek

source: From **Tools > Data injection**, select the template you require from the drop-down list
tr_tr: **Araçlar > Veri içe aktarma** bölümünde açılır listeden kullanmak istediğiniz kalıbı seçin

source: Then enter the path to the CSV file to be injected
tr_tr: Ardından içe aktarılacak CSV dosyasının yolunu yazın

source: Specify the **Encoding** of the file if you know it. If not, leave on **Automatic detection**
tr_tr: Biliyorsanız dosyanın **Kodlamasını** belirtin. Bilmiyorsanız **Otomatik algılama** olarak bırakın

source: Click on **Proceed with import**
tr_tr: **İçe aktarmayı başlat** üzerine tıklayın

source: import file
tr_tr: Dosyayı içe aktar

source: Confirmation before import
tr_tr: İçe aktarma öncesi onayı

source: A popup will ask you to confirm or not the import of the selected file.
tr_tr: Seçilmiş dosyanın içe aktarılmasını onaylayıp onaylamadığınızı soran bir pencere açılır.

source: Import result
cs_cz: Výsledek importu
tr_tr: İçe aktarma sonuçları

source: From this last stage, by clicking on the coloured circle, you can view a report on the import and, in particular, locate any errors
tr_tr: Bu son aşamada, renkli daireye tıklayarak, içe aktarmayla ilgili bir rapor görüntüleyebilir ve özellikle herhangi bir sorunu görebilirsiniz.

source: import result
tr_tr: İçe aktarma sonuçları

source: Complete the operation
tr_tr: İşlemi tamamlamak

source: A popup window will ask you whether or not you want to confirm the import of the selected file. Once the progress bar is full, click on **Finish**
tr_tr: Açılan bir pencerede, seçilmiş dosyanın içe aktarılmasını onaylamak isteyip istemediğiniz sorulur. İlerleme çubuğu dolduğunda **Tamam** üzerine tıklayın

source: import completed
tr_tr: İçe aktarım tamamlanmış olur

source: FAQ
tr_tr: SSS

source: If you have any questions about using the plugin, please consult `our FAQ <https://faq.teclib.com/04_Plugins/Data_injection/>`_
tr_tr: Eklentinin kullanımıyla ilgili herhangi bir sorunuz varsa `SSS <https://faq.teclib.com/04_Plugins/Data_injection/>`_ bölümüne bakabilirsiniz.

source: Creative Commons License
tr_tr: Creative Commons Lisansı

source: Sources link: https://github.com/pluginsGLPI/datainjection
cs_cz: Odkaz na zdroje: https://github.com/pluginsGLPI/datainjection

source: Download: https://github.com/pluginsGLPI/datainjection/releases
cs_cz: Stažení: https://github.com/pluginsGLPI/datainjection/releases

source: Requirements for latest version
cs_cz: Požadavky pro poslední verzi

source: This plugin requires :
cs_cz: Tento zásuvný modul vyžaduje :

source: PHP 7.2 or higher
cs_cz: PHP 7.2 nebo vyšší

source: Features
cs_cz: Funkce

source: This plugin allows data import into GLPI using CSV files.
cs_cz: Tento zásuvný modul umožňuje import dat do GLPI pomocí CSV souborů.

source: It allows to create models of injection for a future re-use. It's been created in order to:
cs_cz: Umožňuje vytvářet modely pro import dat pro pozdější opakované použití. Modul byl vytvořen za účelem:

source: Import data coming from others asset management softwares
cs_cz: Importu dat z jiných software pro správu aktiv

source: Inject electronic delivery forms
cs_cz: Importu dat z elektronických formulářů

source: Data to be imported using the plugins are:
cs_cz: Data, která mohou být importována pomocí zásuvných modulů jsou:

source: Inventory data (except softwares and licenses),
cs_cz: Inventární data (vyjma software a licencí),

source: Management data (contract, contact, supplier),
cs_cz: Data správy (smlouvy, kontakty, dodavatelé),

source: Configuration data (user, group, entity).
cs_cz: Konfigurační data (uživatel, skupina, entita).

source: Install the Plugin
cs_cz: Instalovat zásuvný modul

source: Uncompress the archive.
cs_cz: Rozbalit archiv.

source: Navigate to the *Configuration > Plugins* page,
cs_cz: Přejít na stránku *Nastavení > Zásuvné moduly*,

source: Install and activate the plugin.
cs_cz: Instalovat a aktivovat zásuvný modul.

source: You will access the datainjetion configuration from the *Tool* > *File injection*.
cs_cz: Ke konfiguraci zásuvného modulu se dostanete z menu * Nástroje *> * Import souboru *.

source: Clic here to manage model
cs_cz: Klikněte zde pro správu modelu

source: Create new model
cs_cz: Vytvořit nový model

source: Fist step you need te create model, for this example we import Computer
cs_cz: Nejprve musíte vytvořit model, například import počítače

source: Clic here to create new model
cs_cz: Klikněte zde pro vytvoření modelu

source: And fill form
cs_cz: A vyplňte formulář

source: Name : define a model Name
cs_cz: Název : definujte název modelu

source: Visibility : is private or not for other user
cs_cz: Videitelnost : soukromá nebo veřejná

source: Entity / sub entity : model visibility for entity
cs_cz: Entita / podřízená entita : viditelnost modelu v entitách

source: Comments : model comment
cs_cz: Komentáře : komentář modelu

source: Type of data : type of data to import
cs_cz: Typ dat : typ dat k importu

source: Allow lines creation : yes or not
cs_cz: Povolit vytváření řádků : ano nebo ne

source: Allow lines update : yes or not
cs_cz: Povolit aktualizaci řádků : ano nebo ne

source: Allow creation of dropdowns : if dropdown value not exist, let's create It
cs_cz: Povolit vytváření rozbalovacích seznamů : pokud hodnota seznamu neexistuje, vytvoří se

source: Dates format : date format in CSV file
cs_cz: Formát dat : formát dat v CSV souboru

source: Allow update of existing fields : yes or not
cs_cz: Povolit aktualizaci existujících polí : ano nebo ne

source: Float format : float format in CSV file
cs_cz: Plovoucí formát : plovoucí formát v CSV souboru

source: Try to establish network connection is possible : yes or not
cs_cz: Pokusit se navázat síťové připojení, pokud je k dispozici : ano nebo ne

source: Port unicity criteria : define unicity field fir port
cs_cz: Kritérium jednotného portu : definuje jednotné pole pro port

source: After model creation it's possible to : * Define if header is present * Change file delimitor : default -> ";"
cs_cz: Po vytvoření modelu je možné : *Definovat záhlaví k dispozici* Změnit oddělovač souboru : výchozí -> ";"

source: Inject your CSV file
cs_cz: Importovat váš CSV soubor

source: Send to GLPI your CSV file with computer data
cs_cz: Poslat do GLPI váš CSV soubor s daty o počítači

source: content of CSV file for this documentation
cs_cz: obsah CSV souboru pro tuto dokumentaci

source: Mapping CSV column and object field
cs_cz: Mapovat CSV sloupec a pole objektu

source: For each column of your CSV file you must select the table and the corresponding field in GLPI
cs_cz: Pro každý sloupec vašeho souboru CSV musíte vybrat tabulku a odpovídající pole v GLPI

source: You need to define link field. The plugin will search on this link field to known if object need to be added or updated
cs_cz: Musíte definovat pole odkazu. Zásuvný modul prohledá v tomto poli známé propojení, zda je třeba objekt přidat nebo aktualizovat

source: The dropdown list contains other tables, which allows it to import, for example, the financial and administrative informations during computer import.
cs_cz: Rozevírací seznam obsahuje další tabulky, které mu umožňují importovat například finanční a administrativní informace během importu do počítače.

source: Each type of data (Computer, Monitor, User) have differents options to import other data
cs_cz: Každý typ dat (počítač, monitor, uživatel) má různé možnosti importu dalších dat

source: Additional data
cs_cz: Doplňující údaje

source: You can define additional data to be imported, it will be requested during import.
cs_cz: Můžete definovat další data, která mají být importována, budou požadována během importu.

source: Each can be flag as manatory
cs_cz: Každý může být označen jako povinný

source: Validate model
cs_cz: Ověření modelu

source: After configuration you can validate model
cs_cz: Po konfiguraci můžete model ověřit

source: Execute import
cs_cz: Provést import

source: You will access the model from the *Tool* > *File injection*.
cs_cz: Přístup k modelu získáte z * Nástrojů *> * Vkládání souborů *.

source: Select a model, select CSV file, and run import
cs_cz: Vyberte model, vyberte soubor CSV a spusťte import

source: After import process, plugin show you result, clic on spere to get more details
cs_cz: Po procesu importu vám zásuvný modul ukáže výsledek, kliknutím na kouli získáte další podrobnosti
